[
 {
  "profile_link": "https://www.linkedin.com/in/rahul-raj-49263330?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAaAEe4BjtHdeI55mW6pJGl4s_99WbVUxWQ",
  "name": "Rahul Raj",
  "information": "Client Solutions Lead (OTT & eCom) at TikTok",
  "location": "Singapore Contact info",
  "company": "TikTok Bharathiar University",
  "connections": "500+ connections",
  "about": "",
  "contact_info": "Rahul’s Profile linkedin.com/in/rahul-raj-49263330"
 },
 {
  "profile_link": "https://www.linkedin.com/in/williamlee?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAIY24B1I1O2CLYi7juZAHn-qcnVYWiebM",
  "name": "William Lee",
  "information": "Head of Digital Products and Innovation",
  "location": "Singapore Contact info",
  "company": "beIN Asia Pacific MIT Sloan School of Management",
  "connections": "500+ connections",
  "about": "Highly experienced in digital products and e-commerce, William is a Digital Pathfinder who helps companies grow their digital businesses in Asia Pacific. William is skilled at leading high performing teams on transformation journeys in building and scaling product innovations to create, deliver and capture the digital value chain. Notable projects include:* beIN Sports Connect, a streaming subscription service launched in 10 countries in APAC.* Mediacorp Toggle (currently rebranded as meWatch)* SingTel TV, mioTV Go* NBCU Syfy, Universal and Diva Channels launches and operations across APAC.* Singapore Press Holdings - pioneered online versions of Straits Times and Business Times … see more",
  "contact_info": "William’s Profile linkedin.com/in/williamlee"
 },
 {
  "profile_link": "https://www.linkedin.com/in/yogesh-sehgal-9102334?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAC-5FwBBPF9Owj2P9WI2SNc6Ml99RyXyl0",
  "name": "Yogesh Sehgal",
  "information": "Head of Partner Development at Magnite",
  "location": "Singapore Contact info",
  "company": "Magnite Institute of Management Technology, Ghaziabad",
  "connections": "500+ connections",
  "about": "Deep experience across Adtech, Publishers setup and operations across different platforms. Main responsibilities involve revenue generation, education & consultation among partners (buy and sell side) across the region. Feedback regional requirements to the product team to plan for future rollouts. … see more",
  "contact_info": "Yogesh’s Profile linkedin.com/in/yogesh-sehgal-9102334 Website magnite.com (Company Website)"
 },
 {
  "profile_link": "https://www.linkedin.com/in/laurent-chivallier-consulting-ai-ml-ott-iot-5g?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAADDZYBJkqiVC5jRaWUhBb8S8zHbnTLN8s",
  "name": "Laurent Chivallier",
  "information": "Senior Advisor at Arthur D. Little | Telecom & Media | Digital innovation | Deep Tech AI ML | Wired to sell | Strategy | Business development | Digital Start-up founder",
  "location": "Singapore Contact info",
  "company": "Arthur D. Little New York University - Leonard N. Stern School of Business",
  "connections": "500+ connections",
  "about": "Sales leader, Corporate strategist, business developer and product innovator at thecrossroads of Mobile, high-Tech and Media industries in Asia, USA, Europe.10 years in Asia. Strong International leadership at CxO level with High-Tech industriesTrack record in Digital innovation & transformation. Lean, Agile, Digital health Start-up Founder & CEO, Tier-1 MBAOver 25+ years of working experience in Strategy, Innovation, Sales & Marketing, Product Management in the Mobile SW, wireless devices, Telco industries , start-up and management consulting.Strong Track Record in envisioning, creating and implementing innovation in mobile services and products. Extensive experience from Mobile Network Operator, Mobile Handsets & Consumer Electronics manufacturers, Semiconductors and Software vendors.Entrepreneur with hands-on experience in Mobile App, Contents, SAAS, cloud, OTT, 5G/IoT and Services creation.STRATEGY* Led Regional TV and OTT Media & Video led services across SE Asia.* Managed Strategic Deep dive in APP monetization (gamification, advertizing) and M-Payment* Sourced Deals and early Due diligences in OTT Content and technology Start-upsMARKETING* Pioneered 1st Linux/Java based Smartphone OS platform. Sold it to Samsung Mobile.SALES* Managed and Billed US$147M/y to Mobile Manufacturers.PRODUCT MANAGEMENT * Created and Launched 1st “Operator Tray” User Interface on ANDROID for SingTel for low-cost smartphones in SE Asia with Singtel Voip, chat, IM, remote storage, pre-loaded apps.* Specified and Launched 1st Philips GSM Mobile Handsets* Specified and launched 1st \"Carousel\" UI for a Philips Mobile* Specified and launched 1st Mobile with Voice Recognition INNOVATION & ENTREPRENEUR*Founder of a Start-up in Mobile Consumer Heath, App creator.*Patent holder - mobile security for wearable -NFC *Awards from GSMA in 2009 for 1st Mobile Healthcare App (iPhone APP with Wireless Sensors)* Regular Speaker at Conferences - Mobile strategies , OTT Telco strategies , App monetization … see more",
  "contact_info": "Laurent’s Profile linkedin.com/in/laurent-chivallier-consulting-ai-ml-ott-iot-5g Websites triumemba.org/ (TRIUM Global Executive MBA) apilinx.com (my company APiLINX) appibuddy.com (Personal Website) Twitter lchivall"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ottsarv?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAS1WG4BSoHSkTWG0Qi2DiZUVH3qA5zONes",
  "name": "Ott S.",
  "information": "Father | Digital Architect | Persistent & Enthusiastic CIO | Broad Experience in Asia Pacific & Europe",
  "location": "Singapore Contact info",
  "company": "Druk Holding & Investments",
  "connections": "16,809 followers",
  "about": "My passion lies at the nexus of my blended experiences in various sectors, from selling books to a CIO position in the most critical national digital transformation-related projects. I bring the best technology to provide the most meaningful customer journeys without forgetting to protect customer's privacy. After working for many nations worldwide since 2014, I've finally landed in the most exciting country to work to bring incredible digital opportunities to Bhutan. From providing support for government and businesses to grow to empower local communities with digital skills to expand access to digital services to more people, my teams and I have placed ourselves at the heart of this increasingly connected landscape to help bring the benefits of technology to more people across Bhutan.Particular expertise in:- Balancing commercial requirements and technical complexities; being a 'technical translator.' - Identifying and implementing operational efficiencies that increase customer satisfaction - Identifying opportunities while providing strong, stable mitigating actions to ensure any risk is managed- Direct and indirect relationship building, technical and leadership collaboration - Creative and curious problem-solving - Building and operating in/running multi-national and multilingual teams. … see more",
  "contact_info": "Ott’s Profile linkedin.com/in/ottsarv Twitter ottonenn"
 },
 {
  "profile_link": "https://www.linkedin.com/in/chelseatan?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAABZfMoBpsXUbp44wG0bOvrePEllakEO5ts",
  "name": "Chelsea Tan",
  "information": "Head of Business Development & Partnership - SEA/KR at Tinder & Match Group",
  "location": "Singapore Contact info",
  "company": "Match Staffordshire University",
  "connections": "500+ connections",
  "about": "Regional Director of Business Development with 15+ years of strategic planning and partnership management experience in the telecommunications and digital/mobile payment sectors while thriving in a fast-moving environment. Recognized for demonstrating a natural aptitude for defining practical solutions, as well as for flexibility and adaptability with a verifiable history of contributing directly to company growth and expansion throughout her career. Professional focal points include business development, partner management, consultative sales, market analysis, solutions development, account administration, and market expansion. … see more",
  "contact_info": "Chelsea’s Profile linkedin.com/in/chelseatan"
 },
 {
  "profile_link": "https://www.linkedin.com/in/panbihao?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAg2TgABnzEODu66RC3_E2IA5eWmE-ZsqXM",
  "name": "Bihao Pan 潘必豪",
  "information": "Open Internet | Connected TV & OTT TV | Internet Technologies | Hiring Rockstars",
  "location": "Singapore, Singapore Contact info",
  "company": "The Trade Desk Harvard Business School Online",
  "connections": "7,952 followers",
  "about": "A passionate technology leader with an impressive track record of building teams to generate hypergrowth and scaling businesses in high-profile leadership roles for diverse corporations. Strong leadership experience in cross culture environments and navigating culture nuances to build international bridges between West and East, driving growth and international market expansion. At The Trade Desk, Bihao is responsible for spearheading the development of high growth channels such as Streaming TV and Audio advertising across South East Asia, India, Australia and New Zealand. Prior to The Trade Desk, he was heading up Programmatic Exchanges for AOL in Asia and running Millennial Media’s advertising sales in China. Bihao is passionate about advancement of internet technologies and using it to improve the quality of life and foster stronger connections among global communities.潘必豪先生是一名互联网广告资深专家，具有丰富的跨国市场拓展和营销经验，曾在不同行业的多家跨国公司担任要职。资深的团队领导经验使得他成功助力多家美国上市公司开拓亚洲业务，并在其中发挥了核心作用。熟知东西方文化不同之处，能在跨文化交际中高效运作，并带领团队在国际化环境中高速发展。潘必豪先生现任职于美国纳斯达克上市公司萃弈科技(The Trade Desk)，担任媒介合作资深总监一职。负责带领团队开拓互联网广告高速增长领域，例如在线电视广告和音乐平台音频广告等业务。业务拓展区域横跨东南亚，印度，澳大利亚和新西兰。在加入萃弈之前，曾担任美国在线(AOL)程序化广告平台亚洲区Head of Open Demand，和美国纽交所上市科技公司Millenial Media中国效果营销Head of Performance Advertising。潘必豪先生热衷于探索互联网各类领先技术，并立志于以此热情来推进和提高的企业商业质量，加强全球化商业活动之间的联系与交流。 … see more",
  "contact_info": "Bihao’s Profile linkedin.com/in/panbihao"
 },
 {
  "profile_link": "https://www.linkedin.com/in/vrocampo?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAACcHzoBt0PrCyWXavSzC06TTllP3q1KIj0",
  "name": "Victor R. Ocampo",
  "information": "Senior Business Development Consultant for Digital Identity and Engagement",
  "location": "Singapore Contact info",
  "company": "Independent Consultant",
  "connections": "500+ connections",
  "about": "PROFILE: (Singapore PR) Victor is a 20-year Business Development veteran of the mobile and digital space. He specializes in new market development, brokering data, content and channel partnerships, enterprise solution sales and technical product marketing for mobile engagement services, digital content, mobile identity solutions, embedded software systems and OTT communication applications. His experience with Yahoo!, BICS, Gemalto, Cellebrite, and TeleSign -- as well as his own start-ups and consultancy practice, has provided him with a deep domain experience in dealing with the length and breadth of the ICT ecosystem - from Telecoms and related technologies, device manufacturers, API and SDK providers, digital identity sources and specialized OTT technology providers. He also has an extensive international network of professional and personal contacts across the Asia-Pacific, South and Western Asia, Australia and Oceania, the Middle East and North Africa. Victor has been invited as a speaker to many conferences such as the Asia Business Federation, CommunicAsia, Digital Identity Vietnam, the GSMA Mobile 360 Summit, the Mobile Entertainment Forum, Social Networking Asia, TADHack and the World Islamic Economic Forum. He is also a start-up mentor for the Innoventure Technopreneurship Challenge and It Takes an Island Hackathon, as well as a former Industry Advisory Council Member to the School of Communications and New Media (National University of Singapore). … see more",
  "contact_info": "Victor R.’s Profile linkedin.com/in/vrocampo"
 },
 {
  "profile_link": "https://www.linkedin.com/in/anusik-pagare-a3461618?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAOmh0gB14xvJsC-f_nLYqXDrgXFAk9jN5E",
  "name": "Anusik Pagare",
  "information": "Head Marketing & Content - ASIA PACIFIC at VMAS ASIA | OTT | Searies | FILMS",
  "location": "Singapore Contact info",
  "company": "VMAS Infotainment Pvt.Ltd Savitribai Phule Pune University",
  "connections": "500+ connections",
  "about": "Experienced Director with a demonstrated history of working in the entertainment industry. Skilled in Marketing Management, Market Planning, Advertising, Market Research, and Brand Management. Strong media and communication professional graduated from SIMS Pune.",
  "contact_info": "Anusik’s Profile linkedin.com/in/anusik-pagare-a3461618"
 },
 {
  "profile_link": "https://www.linkedin.com/in/shenthilranie?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAABwudwBU5fbYfpheWKq7A_9Wtnxq9c1zk4",
  "name": "Shenthil Ranie",
  "information": "VOD | OTT | Chief Content Officer",
  "location": "Singapore Contact info",
  "company": "Inflight Rights La Trobe University",
  "connections": "500+ connections",
  "about": "My experience is built on analyzing new business opportunities and building strong partner relationships, driving significant top and bottom line results, and am comfortable managing multiple responsibilities within a fast-paced environment. I have proven track record of being able to execute at both tactical and strategic levels to achieve long-term growth. … see more",
  "contact_info": "Shenthil’s Profile linkedin.com/in/shenthilranie"
 },
 {
  "profile_link": "https://www.linkedin.com/in/noblebinoy?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAoCrAkBx0rIVjZmH9Gc6VlV1Fe9yr7XcAo",
  "name": "Noble Binoy",
  "information": "D2C | Monetising Video 2.0 : Entertainment, Education, Gaming & Esports, Sports, Shopping | OTT | EdTech | Strategy & Implementation | P&L | Analytics & Insights | TMT | PMO | App Economy",
  "location": "Singapore Contact info",
  "company": "POPS Worldwide National University of Singapore",
  "connections": "500+ connections",
  "about": "Legally eligible to work in Singapore (citizen) and India (OCI cardholder) without employer sponsorship. I'm a business leader with a data-driven mindset. I can dig into details, get my hands dirty, analyse data, makes sense of it, create strategies, inspire and lead cross-functional teams to launch new products in new or existing markets, drive user growth, and revenue. I helped startups and multinational corporations to solve their challenges through my entrepreneurial, analytical, strategic, problem-solving approach and growth mindset. Acquired hands-on experience in strategic planning, project management, analytics, business development, and leading cross-functional teams.A proactive leader and highly adept at partnering with CxO level, cross-functional teams, industry partners to transform ideas into win-win-win solutions and to ensure actual implementation. My purpose is to solve complex problems and to create innovative win-win-win solutions (for everyone in the value chain - the business, the customer, and those in need) with customer-centricity.Although I am proud to be Singaporean, and Indian, my identity and sense of belonging have always been in flux. I consider myself as a global citizen. I lived and worked in emerging, mature, and advanced Asian markets. If I can be of help to you, or you would like to learn more about me, please get in touch! I'm at noblebinoy888@hotmail.com or65-9115 0041. Specialties:# D2C/OTT# Strategy# Leadership# Storytelling# Market Entry# Partnerships# Consultative selling# Product localisation# Market development# Revenue optimisation# Data/Business analysis# Strategic planning, P&L# Emerging Asian markets# Cross-functional leadership# Deal structuring & negotiation# Financial modelling & valuations# Process & Operational improvements# Advertising & Subscription Business Models# Creating a culture of experimentation & optimisation … see more",
  "contact_info": "Noble’s Profile linkedin.com/in/noblebinoy Website twitter.com/Noble_Binoy (Twitter) Twitter Noble_Binoy"
 },
 {
  "profile_link": "https://www.linkedin.com/in/mete-bargmann-886a3b13?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAALSqiYBSfI919l6k5q0wSPIODg90uuEO3o",
  "name": "Mete Bargmann",
  "information": "Director Of Business Development APAC at SpotX & IAB SEA+India CTV & Streaming Committee Member",
  "location": "Singapore Contact info",
  "company": "SpotX Hogeschool Inholland / Inholland University of Applied Sciences",
  "connections": "500+ connections",
  "about": "Experienced Corporate Business Development Director with a demonstrated history of working in the internet and tv industry. Skilled in Online Video Strategy (svod & avod), MVPD's, Programmatic, OTT and CTV. Strong commercial and strategy development professional. Speaks Dutch, English, German and French. … see more",
  "contact_info": "Mete’s Profile linkedin.com/in/mete-bargmann-886a3b13 Website spotxchange.com/ (Company Website)"
 },
 {
  "profile_link": "https://www.linkedin.com/in/tayflorence?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAFNg9oBpQ9WrILLpPni-Fgl3MGoptLkSt4",
  "name": "Florence Tay",
  "information": "Technology Innovation | Integrated Marketing | Partnerships & Alliances | Ecosystem Development",
  "location": "Singapore Contact info",
  "company": "Singtel National University of Singapore",
  "connections": "500+ connections",
  "about": "Technology Innovation, Marketing, eCommerce, Partnerships and Ecosystem builder, with more than 15 years of experience in London, Singapore and South East Asia, working across different cultures globally. Proven track record in strategising and executing regional multichannel marketing plans, to create branding, drive acquisition and retention, as well as working with technology start-ups to drive corporate innovation and transformation. Successfully managed global alliances and third party partnerships to drive business development, share best practices and create ecosystems.Achievements include:* Marketing of technology start-ups, to drive awareness and develop business opportunities within corporates* Managed alliances with system integrators, consulting firms and managed service providers through partnerships with technology start-ups* Successfully managed global alliances for cybersecurity and start-up innovation between Tier-1 global telcos* Created ICE71, a cybersecurity ecosystem, supported by the Singapore Government (CSA & IMDA), consisting more than 6,000 cybersecurity end users, ISVs, IHLs, government, researchers and venture funds, and doubled the number of cybersecurity start-ups in Singapore* Accelerated and scaled 79 cybersecurity start-ups* YoY growth of 75% in online revenues of a listed company * Reduced cost per acquisition by 14% * #1 F&B application in the Apple store * Setting a new Guinness World Record with a creative launch strategyExperienced in leading cross-matrix teams within complex organisations, as well as working in start-up environments in driving business results and successful partnerships. … see more",
  "contact_info": "Florence’s Profile linkedin.com/in/tayflorence"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ctarr?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAPob0BYy_tuu3k_Efd4PbOATTuQ912ad0",
  "name": "Chris Tarr",
  "information": "Senior business leader experienced bringing mobile services & partnerships to market - Fintech | Payments | OTT Video",
  "location": "Singapore Contact info",
  "company": "Samsung Electronics INSEAD",
  "connections": "500+ connections",
  "about": "Results driven senior business leader, and former management consultant, with 10+ years experience bringing to market new mobile services, strategic partnerships, and innovations in Fintech, AI, OTT Video, and Customer Loyalty. Experienced setting up and leading high performance teams to deploy new services across Southeast Asia, overseeing all aspects of business development, product management, marketing, and operations. Extensive experience leading strategic partnerships and new business development, delivering global best practices, new business models, and driving innovation through innovative technology and marketing partnerships. Effective at influencing and advising executive stakeholders on strategy and delivering results in complex unstructured environments. A versatile and passionate digital and people leader, who has made Singapore Permanent Residence and home for the past 10 years. … see more",
  "contact_info": "Chris’ Profile linkedin.com/in/ctarr Website sgsg.samsung.com (Company Website)"
 },
 {
  "profile_link": "https://www.linkedin.com/in/alexhunte?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAkPc4BkwzNPtUgrts21lZVgodJ1g40bHM",
  "name": "Alex Hunte",
  "information": "Regional Vice President of Sales - Comms, Media & Energy - Asia at Salesforce Industries",
  "location": "Singapore Contact info",
  "company": "Salesforce Brunel University",
  "connections": "500+ connections",
  "about": "Experienced sales leader for enterprise CRM and digital solutions, with deep telecoms domain expertise.I’m currently leading sales for Salesforce Industries' (formerly Vlocity) communications, media and energy verticals across Asia, helping enable digital transformation with industry-specific capabilities built natively on the Salesforce platform. I have 22 years of experience in a range of sales, pre-sales, strategy and business development roles, bringing passion, expertise and a track record of exceeding business goals.SPECIALITIESSolution domains: Digital transformation, Customer Relationship Management (CRM), Customer Experience Management (CEM), omni-channel, self service, order management, product catalog, retail, journey to cloud, social care, chat bots, big data, AI, BSS, charging, billing, IoT, B2B, OTTRoles: sales management, sales executive, pre-sales/sales engineering/solution consulting, business development, strategy development Industries:Telecommunications, utilities, media & entertainment, financial services, high-tech manufacturing … see more",
  "contact_info": "Alex’s Profile linkedin.com/in/alexhunte"
 },
 {
  "profile_link": "https://www.linkedin.com/in/aashish-mehra-75346a?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAARXa8BtZKFeZffvKqc9VqrgEhpu8FYq6g",
  "name": "Aashish Mehra",
  "information": "Helping Organizations leverage Programmable Video (WebRTC), Voice and OTT channels to stay connected with their users",
  "location": "Singapore Contact info",
  "company": "Vonage maharishi dayanand University",
  "connections": "500+ connections",
  "about": "Experienced, “fearless” cold-caller, expert presenter, negotiator and closer. I am passionate about everything that has to do with Customer Engagement, creating differentiated values and differentiated experiences for them. I possess over 10 years of global experience in enterprise IT Cloud & Software sales. I have lived & worked in Singapore over the last 4 years and have built and own relationships with many CxO level executives across South East Asia and India that I believe to be my biggest strength. Key roles handled - New Business Development, Inside Sales, Territory Sales and Account Management. … see more",
  "contact_info": "Aashish’s Profile linkedin.com/in/aashish-mehra-75346a"
 },
 {
  "profile_link": "https://www.linkedin.com/in/owenmcloughlin?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAALLRegB8mS-Y-KfKc5eRDNj7XVWxEtqgD4",
  "name": "Owen McLoughlin",
  "information": "Product | Digital Transformation | Innovation",
  "location": "Singapore Contact info",
  "company": "M1 Limited HEC Paris",
  "connections": "500+ connections",
  "about": "Passionate about product, technology and user experience.",
  "contact_info": "Owen’s Profile linkedin.com/in/owenmcloughlin"
 },
 {
  "profile_link": "https://www.linkedin.com/in/mudrii?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAB7rgIBfalosciTnMiOYRcVCPK2RAlrPpY",
  "name": "Ion Mudreac",
  "information": "Cloud, DevOps/SRE Singtel",
  "location": "Singapore Contact info",
  "company": "Singtel Academia de Studii Economice din București",
  "connections": "500+ connections",
  "about": "LeadershipIf you want to build a ship, don't drum up people to collect wood and don't assign them tasks and work, but rather teach them to long for the endless immensity of the sea.Achieving Near PerfectionA designer knows he has achieved perfection not when there is nothing left to add, but when there is nothing left to take away.Antoine de Saint-Exupéry quotes … see more",
  "contact_info": "Ion’s Profile linkedin.com/in/mudrii Twitter mudrii"
 },
 {
  "profile_link": "https://www.linkedin.com/in/erhuang?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAbmDYBHQalSMbt_uQbbKQYSkWmaXMVmZ8",
  "name": "Erica Huang",
  "information": "Product Management Leadership | Product Growth & Operations Excellence | Tech CEOs Advisory Team",
  "location": "Singapore Contact info",
  "company": "Grab University of California, Berkeley, Haas School of Business",
  "connections": "500+ connections",
  "about": "Customer experience driven and Result-oriented business leader with in-depth experience leading global cross-functional teams and business partners to develop excellence & competitiveness, execute business, product and marketing strategies, accelerate growth and maximize ROI.Successfully launched a range of mCommerce & eCommerce, premium video entertainment services, and both B2C and B2B SaaS products and services to millions of users. Contagious passion and energy to build and develop the best teams and world-class products that impact customer business & consumer daily life. Love to inspire teams and drive toward to a business & product vision and same goal.* Fun KPIs from Erica :Grew Mobile Commerce DAU 40%+, installs 70%+ QOQ and mobile market reach from zero footprint to over 85%. Accelerated 65% of new business revenue growth. Increased e-Commerce new user acquisition 40%, improved revenue stream 125% & operation efficiency 50% and reduce time to market to market 80%.* Specialities : Early product cultivation / evangelization / management, new business & market expansion, user engagement & growth, digital strategy development, market intelligence, partner integration and global cross-functional team management, product portfolio and marketing operation optimization, business ROI maximization and talents scouting & development. * Industry Focus: Mobile & E Commerce, Social Commerce, Consumer Internet, Video Streaming & Entertainment Services, SaaS B2B solutions. Education : UC Berkeley - Columbia MBA. … see more",
  "contact_info": "Erica’s Profile linkedin.com/in/erhuang Twitter mobierica mobimarketer"
 },
 {
  "profile_link": "https://www.linkedin.com/in/anoopmanghat?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAB0h0UBoEOD_T1OrCpkIIw_zjTKvTkcW_M",
  "name": "Anoop Manghat",
  "information": "Sr. Director | Partnerships, Strategy & Biz Dev | Disney Media Networks",
  "location": "Singapore Contact info",
  "company": "The Walt Disney Company National University of Singapore",
  "connections": "500+ connections",
  "about": "Experienced executive with fourteen years of international experience in media and entertainment, consulting and technology focused on strategy, partnerships and business development, sales and general management. Inspired by and seeking further opportunities where my skills across strategic thinking, commercial planning, sales, negotiations and cross-functional leadership can contribute to connecting individuals, enhancing communication through storytelling, empowering communities and driving business value Passionate about democratising access to information and communication by bringing together content, technologies and business models.All opinions are my own. … see more",
  "contact_info": "Anoop’s Profile linkedin.com/in/anoopmanghat Websites turner.com (Company Website) frost.com (Company Website) db.com (Company Website)"
 },
 {
  "profile_link": "https://www.linkedin.com/in/peter-bithos-2477217?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAFaLhcB2L31sow6m1cUPjyy1bdbGVB0d4Q",
  "name": "Peter Bithos",
  "information": "CEO, Asia at SEEK | 13+ yrs in CEO/COO roles in APAC media/tech/telecoms | Start-up Founder | Bain & Co. & Wharton Alum",
  "location": "Singapore, Singapore Contact info",
  "company": "SEEK University of Pennsylvania - The Wharton School",
  "connections": "3,992 followers 500+ connections",
  "about": "Strategy-driven, people-focused CEO/COO across Tech, Digital Media & Telco with 20-years of experience in Asia Pacific across both developed and emerging markets. 13 years CxO experience. Long track record of driving transformational P&L growth in both start-up and multi-billion dollar, complex organizations with thousands of staff. High energy, strong coach and mentor, and excellent manager of large-scale change. Nine+ years of top-tier strategy consulting. Wharton and Bain & Co. alumnus.• Founded and built a leading OTT video service in SE Asia from scratch, growing to 70M+ registered users, ~9M paid and from 0 to 250 employees across 6 countries• Co-led one of the most successful telco transformations in the world (2010-2015), creating ~$6B in market value and taking a struggling and declining #2 to a strong #1 position and market leadership• Delivered transformational revenue growth in mature, start-up, digital and capital-intense businesses from $0 to multi-billion $ scale• Created step-change success and growth across both emerging and developed markets• Built or expanded market positions organically across all P&L roles• Successfully led multi-year business, IT and digital transformations• Track record of identifying, hiring and building diverse, high-performing teams with strong followership• Strong record of stakeholder management in public and private companies, founder businesses, and matrix organisations … see more",
  "contact_info": "Peter’s Profile linkedin.com/in/peter-bithos-2477217 Website hooq.tv (Company Website)"
 },
 {
  "profile_link": "https://www.linkedin.com/in/cgnavares?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAITEQEB_YPydVypgA__arDmmELtfWPOIyM",
  "name": "Carlos García Navares",
  "information": "Head of Sales Development, APAC & EMEA @ Branch | Ex-LinkedIn | TEDx | AIESEC Alum",
  "location": "Singapore Contact info",
  "company": "Branch IQS Barcelona",
  "connections": "500+ connections",
  "about": "Entrepreneur in the Corporate world. I live for Connecting Ideas, ventures and people with drive - Always open to meet interesting people to discuss about:Venture Building & GrowthTech / Saas SalesMonetizationPartnerships & BDInvestment Coaching, Traininng & enablementCulture buildingHuman empowermentNephews/Nieces and how they handle tech devices at 6 better than us.Separately, I drive inmense satisfaction in sharing, enabling and supporting causes I believe in - Some of my pro-bono engagements:Enterprise Sales Forum - Hong Kong 2018Millennial Development Congress - Hong Kong 2017▸ Youth Development seminar (Beijing - China)▸ Youth Development seminar (Switzerland)▸ HRM Asia's Graduate Development Congress - \"Why it pays to engage youth talent for life\" (Singapore)▸ AIESEC's APAC Leadership Congress (Philippines)▸ Youth To Business Forum Singapore - \"How to Build, Develop and Assess your professional network\" (Singapore)▸ Singapore Chinese Chamber of Commerce - \"Digital transformation for SMBs in South East Asia\" … see more",
  "contact_info": "Carlos’ Profile linkedin.com/in/cgnavares Birthday February 18"
 },
 {
  "profile_link": "https://www.linkedin.com/in/winradit-win-kolasastraseni-b233199?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAGmCAsB3R8UEy0Tsbol7q350pcD28MB2uY",
  "name": "Winradit (Win) Kolasastraseni",
  "information": "GM DTC, Taiwan, Hong Kong, South East Asia, GM Thailand at The Walt Disney Company",
  "location": "Singapore Contact info",
  "company": "The Walt Disney Company",
  "connections": "500+ connections",
  "about": "Entrepreneur in the Corporate world. I live for Connecting Ideas, ventures and people with drive - Always open to meet interesting people to discuss about:Venture Building & GrowthTech / Saas SalesMonetizationPartnerships & BDInvestment Coaching, Traininng & enablementCulture buildingHuman empowermentNephews/Nieces and how they handle tech devices at 6 better than us.Separately, I drive inmense satisfaction in sharing, enabling and supporting causes I believe in - Some of my pro-bono engagements:Enterprise Sales Forum - Hong Kong 2018Millennial Development Congress - Hong Kong 2017▸ Youth Development seminar (Beijing - China)▸ Youth Development seminar (Switzerland)▸ HRM Asia's Graduate Development Congress - \"Why it pays to engage youth talent for life\" (Singapore)▸ AIESEC's APAC Leadership Congress (Philippines)▸ Youth To Business Forum Singapore - \"How to Build, Develop and Assess your professional network\" (Singapore)▸ Singapore Chinese Chamber of Commerce - \"Digital transformation for SMBs in South East Asia\" … see more",
  "contact_info": "Winradit (Win)’s Profile linkedin.com/in/winradit-win-kolasastraseni-b233199"
 },
 {
  "profile_link": "https://www.linkedin.com/in/athreyan-sundararajan-8b30872?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAABd3EcB8XMfFbqdRcsnBKh4VKNw-1eIa5g",
  "name": "Athreyan Sundararajan",
  "information": "Vice President Group Marketing - Warner Media India, South East Asia, South Korea at WarnerMedia",
  "location": "Singapore Contact info",
  "company": "WarnerMedia Mudra Institute of Communication Ahmedabad",
  "connections": "500+ connections",
  "about": "Obsessed with the Consumer. Passionate about Content, Story and Characters. Build Great Teams and Future Leaders. Believes rock star brands are created through Consumer Insight Creativity Tech Solutions Learning Cutting Edge Execution.",
  "contact_info": "Athreyan’s Profile linkedin.com/in/athreyan-sundararajan-8b30872"
 },
 {
  "profile_link": "https://www.linkedin.com/in/minakshi-gurani-3b779239?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAgfzLsB05I6h6RV6v9u8fF250P_xAs05W0",
  "name": "Minakshi Gurani",
  "information": "SaaS I B2B I Enterprise Sales",
  "location": "Singapore Contact info",
  "company": "Cloudflare Indian School of Business",
  "connections": "500+ connections",
  "about": "Obsessed with the Consumer. Passionate about Content, Story and Characters. Build Great Teams and Future Leaders. Believes rock star brands are created through Consumer Insight Creativity Tech Solutions Learning Cutting Edge Execution.",
  "contact_info": "Minakshi’s Profile linkedin.com/in/minakshi-gurani-3b779239"
 },
 {
  "profile_link": "https://www.linkedin.com/in/james-miner-38b349?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAM5tsB6FFH_OZfOvqrCDPN7KOnADd35zM",
  "name": "James Miner",
  "information": "CEO at Video Assure, CEO Minerlabs Group",
  "location": "Singapore Contact info",
  "company": "Video Assure",
  "connections": "500+ connections",
  "about": "Digital industry veteran having worked with the original online services in Silicon Valley and Silicon Alley. James moved to Asia in the 90's to lead digital teams for global advertising networks and eCommerce consulting firms. An expert in streaming video and social media, James now heads 2 ventures that are transforming digital streaming customer experiences across the globe. James is avid supporter of the Asian digital industry, moderates many top digital events (IAB, Casbaa, Digital Matters, Sports Matters), and has held industry association Chairmanships at IAB Singapore, and Singapore 4As. James currently serves on the Digital Chapter Executive Committee at SGTECH. APICTA Gold Award - Media and EntertainmentSITF Silver Award - Artificial Intelligence and Big DataBurson-Marsteller Global Award - Citibank Digital Creative Circle Awards - “Best Information Architecture” for Esplanade.comAsia Interactive Awards - “Best Use of Video” Mercedes-Benz E-Class Campaign Reference “I can tell you that getting to know James Miner is well worth the time. I worked with a lot of techies and customer experience folks from my IBM days through Scient and to the present. I know one or two techies who are up to James' level, can't come up with anyone at his level in customer experience. OK, now try to find them both in one body. James can also develop business and sell. Quadruple threat.” Ed Nazarko, VP Financial Services, Datamonitor … see more",
  "contact_info": "James’ Profile linkedin.com/in/james-miner-38b349 Twitter james_miner"
 },
 {
  "profile_link": "https://www.linkedin.com/in/normanpatrick?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAZyynUBu9mIXSUJqps1f5Efkp_Uwa-0DjM",
  "name": "Norman Patrick Barrientos",
  "information": "Director of Marketing Southeast Asia at GoDaddy | Marketing & Strategic Partnerships",
  "location": "Singapore Contact info",
  "company": "GoDaddy De La Salle University",
  "connections": "500+ connections",
  "about": "A strategic marketer with a proven track record in growing new businesses in Asia Pacific within FMCG, Telco, Technology, Media and Entertainment industries developing and implementing strategies, leveraging on marketing and business strategy & creative selling Highly skilled in content marketing solutions, cross platform integrated marketing, brand and business strategy, new business development, brand and business leadership, IP rights monetization and management, facilitating agency and client relations, proven to effectively engage with partners and consumers globallyDeep interest in content, data, marketing technologies and entertainment solutions … see more",
  "contact_info": "Norman Patrick’s Profile linkedin.com/in/normanpatrick"
 },
 {
  "profile_link": "https://www.linkedin.com/in/teckyiangtan1508?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAANrHacBrB7zsjRkqwj6jO9A2Xyagmh1tHc",
  "name": "Teck Yiang TAN",
  "information": "Dynamic Business Leader &Hunter |Solution Sales Expertise | Telco,OTT,Cloud&Security| APAC New Market &Business Growth |",
  "location": "Central Catchment Area, Singapore Contact info",
  "company": "Sinch Deakin University",
  "connections": "500+ connections",
  "about": "As a sales and business development professional with in-depth experience in both in-house leadership and consultancy roles, I have developed a reputation for structuring and negotiating key deals that opened new markets. Underpinning this success is an ability to connect across cultures and build authentic relationships based on a genuine desire to help our customers be more successful. I enjoy the challenge of developing and presenting technology solutions that add value to their offerings and help drive results. I am equally passionate about motivating my multicultural teams, helping them elevate their performance to reach their fullest potential. My specialisations include: ✲IT&T sector - Telco & OTT, Cloud Services and Security (Surveillance including ML based Facial Recognition)✲ Business Development - Sales Leadership & Management ✲ Market Development including New Territory Entry & Go-To-Market Strategy ✲ C-Level Relationship Management ✲ Consultative & Solution Selling ✲ Pipeline Planning & Opportunity Qualification ✲ RFP Management & Proposal Development ✲ Contract Negotiation & Closing ✲ Business Transformations ✲ Multicultural Team Management ✲Feel free to get in touch with me at teckyiang.tan@gmail.com … see more",
  "contact_info": "Teck Yiang’s Profile linkedin.com/in/teckyiangtan1508"
 },
 {
  "profile_link": "https://www.linkedin.com/in/michaeldoliveiro?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAGAA3ABVM429w6xXq2RwC-MZtZUJ8MvLQo",
  "name": "Michael D'Oliveiro",
  "information": "Experienced Cloud Media and SaaS Professional",
  "location": "Singapore Contact info",
  "company": "Kaltura",
  "connections": "500+ connections",
  "about": "I’m passionate about leveraging cloud-based technology and streaming media to help solve my clients' challenges. And deliver great experiences to their end users. My strengths include product management, strategic sales, key account management and a deep understanding of the APAC-ANZ media landscape.Speaker and published author of 'The Streaming Media Guide'. … see more",
  "contact_info": "Michael’s Profile linkedin.com/in/michaeldoliveiro Websites kaltura.com (Company Website) theendoftv.com (Personal Website) Twitter MikeDOliveiro"
 },
 {
  "profile_link": "https://www.linkedin.com/in/andychoimh?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAQYOBEBBbAwLX3yNljW16-rn0qTzD7TF78",
  "name": "Andy Choi",
  "information": "Global Head of Innovation | Venture Builder | Gen Z Community Builder | Design Thinker",
  "location": "Singapore Contact info",
  "company": "Wildcats.io Carnegie Mellon University",
  "connections": "500+ connections",
  "about": "Global Head of Innovation @ Wildcats. We are breaking out the next generation of innovators and creators through training, coaching, and mentorship, and putting them to create next-gen, inspiring, #tooRiskyForCorporate innovation with hungry and bold corporate. Ping me to chat about Gen Z, Innovation, Start-up, UX Design, Product Design & Management, Strategy, and Faith! … see more",
  "contact_info": "Andy’s Profile linkedin.com/in/andychoimh Twitter andychoimh"
 },
 {
  "profile_link": "https://www.linkedin.com/in/antopatterson?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAASJQoUBw3b3HKnA1VPIYiFk6uUN6fSEIIg",
  "name": "Antoinette Renee Patterson (she/her)",
  "information": "Founder & CEO of Safe Space | Social Entrepreneurship | AdTech",
  "location": "Singapore Contact info",
  "company": "Asia Pacific Medical Technology Association (APACMed) Exchange Wire",
  "connections": "500+ connections",
  "about": "I've been a digital native for the last 11 years and was the market lead in various departments; from ad operations to business development. People and networking are part of my favourite things to do so I've represented my hiring companies in various industry events to bring in new business.The current role I'm in consists of strategy, managing client relationships with direct clients and agencies; driving quarterly revenue and partnerships with key stakeholders. I am dedicated and involved in overseeing every aspect of the planning and operational process, from the first stages of a brief, to the campaign optimization, through to the final review and recommendations. My previous background in Operations has also helped in acquiring people management skills where I've managed a team of 4 and developed operational processes for startup companies in ad tech and OTT space.My dream job would be blending my passion for technology with social impact which led me to create a passion project - a mental health counselling app called \"Safe Space\". Digital Marketing Specialties: Media Buying, Digital Planning and Buying, Analytics, Ad Serving, Mobile Attribution Tracking, Partnerships, Supply, Content Marketing, Social MediaProduct Specialties: Project Management, UX (Figma), Product Marketing11+ experience in integrated communications planning, across multiple client categories - Telco, Automotives, FMCG, Entertainment, Government and Travel. … see more",
  "contact_info": "Antoinette Renee’s Profile linkedin.com/in/antopatterson Website safespace.sg (Company Website)"
 },
 {
  "profile_link": "https://www.linkedin.com/in/devdulal?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAKha2ABqLNBirIeCog2HCh1VB6daihixOQ",
  "name": "Dev Das",
  "information": "Director, Digital Strategy and Growth at Adobe",
  "location": "Singapore Contact info",
  "company": "Adobe University of Leeds",
  "connections": "500+ connections",
  "about": "I love working in digital transformation roles. Roles where people, processes, products and platforms merge together to drive holisitic change in the way the company goes to market. Love building teams.For the past decade, I have built and driven growth, commerce and demand generation plays for Adobe, LinkedIn, IBM, SAP, Ogilvy and some select startups. Plays that integrate product, platform and ecosystem network effect with scaled paid media, search, social engagement, demand management and marketing automation to drive traffic, user growth and revenue.I am keen on roles that lie in the intersection of marketing, ecosystems, platforms and products. … see more",
  "contact_info": "Dev’s Profile linkedin.com/in/devdulal Website hackrlife.com (Blog) Email views.news@gmail.com Twitter thelynchpn"
 },
 {
  "profile_link": "https://www.linkedin.com/in/dominic-da-costa-9218486?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAExPykBngxzYI0Z-hzHgIm5ynjZkREk8tg",
  "name": "Dominic da Costa",
  "information": "I help C-Level Executives within the Telco, Media & Technology markets achieve success through business driven transformation & change.",
  "location": "Singapore Contact info",
  "company": "RP International University College London, U. of London",
  "connections": "500+ connections",
  "about": "I work with CxO, SVP & VP level executives to help transform businesses into Digital organisations that are ready to thrive and succeed in the \"new future\".I have successfully helped facilitate the placement of over 500 people into new positions within Telco, Media & Technology organisations.If you operate within Telco, Media or Technology and you're either looking to transform your organisation or your customers business, or you're searching for the next challenge within your own career send me a message to book in a call. My areas of specialization include:Industry 4.0 -Robotic Process Automation, Machine Learning & Big Data Analytics, NFV/SDN, IoT, IPv6, Cloud BSS, Cloud computing, Augmented reality, Cyber Security, Digital Customer Experience, Digital Omni-Channel Systems Implementation, Connectivity, Wearable.Telecommunication -Network Rollout, Spectrum Refarming, CTO Advisory, 5G Advisory, 4G/ VoLTE/ LTE Delivery, IPv6, IP Network Strategy and Rollout, IP Core, EPC, OpenStack, IMS, SAPC, FTTX Rollout and Planning, Radio Planning & Optimisation, NFV/ SDN Strategy & Optimisation, Network Security, Physical Network delivery, LAN/ WAN delivery & management, RAN Planning Advisory, Transport network delivery, IBS Solutions Design and Delivery.Software -BSS/OSS, System Development & Implementation, Cloud BSS, CRM, Inventory Management, Catalogue management, Order Management, Order Orchestration, AEM Development & architecture, Splunk, Jenkins, Java Script, JAVA/ Ruby/ PHP Development, SAP S4 HANA, SAP Public Cloud Delivery, OTT Development, SWIFT, R, Python, OpenShift, Ansible, UX/UI Development, Hybrid Mobile App development, Apache Kafka, Chef, Azure, AWS, Kubernetes, Devops, Data Migration, DWH, Data Visualisation, Solution Architecture, Enterprise Architecture Consulting.Network Virtualization -NFV, NVP, VMware, ESX/ESXi, VSphere, Open vSwitch, OpenStack, Dockers, iSCSI, Open Flow, Hyper Converged Infrastructure, VMWare Cloud on AWS.Management Consulting:Organizational Change Management, Benefits Realization, Business Readiness, Business process transformation, Digital Transformation, Architecture Consulting, RFP Advisory, Vendor Selection – On-boarding Advisory, CXO- Advisory, Agile Coaching, IT Transformation, Organizational Transformation, Performance Coaching. … see more",
  "contact_info": "Dominic’s Profile linkedin.com/in/dominic-da-costa-9218486 Websites rpint.com/ (Company Website) instagram.com/dominicdacosta85/ (Instagram) twitter.com/DDCostaRPI (Twitter) Twitter DDCostaRPI"
 },
 {
  "profile_link": "https://www.linkedin.com/in/james-peel-5533b311?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAJfRk8BtpYdVwKMop3QecIgPF4g2JD7vi4",
  "name": "James Peel",
  "information": "Senior Executive in Sports Media with 20 year’s experience specializing in Digital Transformation",
  "location": "Singapore Contact info",
  "company": "OneFootball Cambridge Judge Business School",
  "connections": "500+ connections",
  "about": "Senior commercial leader & business builder in the digital sports & media markets with 20 year’s experience specializing in digital transformation. Comfortable in early stage & mature businesses & global territory experience across Europe & APAC. Proven track record of aggressively scaling businesses revenue & profitability. Target driven with the ability to drive commercial outcomes in a highly disruptive sector. In depth knowledge of established & emerging markets across APAC & Europe with a track record of new market entry success. Comprehensive network of c-suite relationships globally spanning governance, commercial & rights holders. … see more",
  "contact_info": "James’ Profile linkedin.com/in/james-peel-5533b311"
 },
 {
  "profile_link": "https://www.linkedin.com/in/fbelotsing?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAFToVEB-lvxRbao8XmxKVwQMla2bd5XOjg",
  "name": "francois BELOT",
  "information": "Creative Producer",
  "location": "Singapore Contact info",
  "company": "Bang in Bangkok Burgundy School of Business - BSB",
  "connections": "500+ connections",
  "about": "Francois has a vast knowledge of the global entertainment production and distribution market. As a content development expert, creative, and business development executive since 1995, Francois has been a serial entrepreneur with a wealth of creative experience in the West and Asia at collaborating with different cultures. As a company co-founder, he grew a photo library company from scratch to 85 people, implementing the international reseller network of a Software Development company for VFX, managed the global Sales & Marketing, and participated in the successful buy-out exit. He has set-up production companies in France and Singapore to create, conceptualize, fund, and manage a dozen international Projects in the Movie and Media Industries (Animation, TV Series, Apps & Games, Smart Toys). Francois worked (end-to-end) a EUR 2M fundraising round for a 3D Animation Film Development and planned the Production roadmap with a US Movie Major. Extensive project & production management and sales experience with a trusted network of senior-level decision-makers; highly entrepreneurial and comfortable working independently and cross-functionally within multiple disciplines (Creative, content development, finance, legal, marketing, product development) to execute trans-media content strategy. … see more",
  "contact_info": "francois’ Profile linkedin.com/in/fbelotsing Websites blacklightmovies.com (Company Website) solidanim.com (Company Website) banginbangkok.com/up-chao (Company Website)"
 },
 {
  "profile_link": "https://www.linkedin.com/in/sschaffarczyk?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAH-nQcB1N-bzfrfohkWhq1CROrk539elE4",
  "name": "Sebastian Schaffarczyk",
  "information": "Managing Partner AdStart Media",
  "location": "Singapore Contact info",
  "company": "AdStart Media National University of Singapore",
  "connections": "500+ connections",
  "about": "Highly experienced executive leader and entrepreneur who loves growing teams, designing business models around technology, and scaling companies across industries and cultures. Focused on new product development in context of digital transformation and how operations and delivery of value to customers are fundamentally changing. Track record of developing and implementing winning product and content strategies, building innovative business models around new technology and leading cross-functional and virtual teams who deliver outstanding results.Deep experience in all aspects of initiating and executing successful business partnerships resulting in significant revenue, profit and customer growth.SpecialtiesNew Business Development - Business Modeling - Entrepreneurship - Product Management - Business & Marketing Partnerships - Content Licensing - Market Research/Analysis - Pricing Strategy & Trends - Channel & Go-to-Market Strategies - Competitor Benchmark - P&L Management - Digital Marketing - Leadership … see more",
  "contact_info": "Sebastian’s Profile linkedin.com/in/sschaffarczyk"
 },
 {
  "profile_link": "https://www.linkedin.com/in/avmalt?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAA1de4B0GkKqVUMZvNSXgOghJ1rutOwdZw",
  "name": "Andreas von Maltzahn",
  "information": "Co-Founder at iwonder",
  "location": "Singapore Contact info",
  "company": "iwonder University College London, U. of London",
  "connections": "2,417 followers 500+ connections",
  "about": "• Co-Founder of iwonder, a new OTT video streaming service for factual entertainment (1000+ award-winning documentaries & current affairs) in a Subscription Video on Demand (SVoD) model• Former Chief Business Development Officer at iflix (now WeTV), a video streaming service in emerging markets. Headed up BD, international expansion and strategy• 15+ years of Telecom, Media, Technology (TMT) experience, with over ten years in strategy consulting as well as C-level management experience in media startups• Focus on product and growth, business development, partnerships, growth marketing, business planning, M&A and operations• Worked in over 25 developed and emerging markets in Europe, Asia, Middle East and Africa … see more",
  "contact_info": "Andreas’ Profile linkedin.com/in/avmalt Twitter avmalt"
 },
 {
  "profile_link": "https://www.linkedin.com/in/gianlucac?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAUkloBOGveMURr0Hpyqmf3rR0Z3Y8fIQw",
  "name": "GianLuca Carola",
  "information": "Cloud-native Ecosystem Builder",
  "location": "Singapore Contact info",
  "company": "Biqmind JCM, Computer Science Diploma",
  "connections": "500+ connections",
  "about": "Start-ups, APIs, Digital Transformation, Cloud-Centric Network, SaaS, PaaS, IaaS, Software-Defined Networking, Datacenter, Hybrid IT, Virtualization and Edge Computing.I am a passionate Leader with 20+ years of Information and Communication Technology industry experience; Strategic Business Development, Cloud Sales and Partner Management with Hyper-scale Ecosystem involved. I have a successful track record of international outsourcing projects, integrated ICT services and solutions, cross Europe, Middle East and Asia Pacific.Leadership & Management Skills• Sales Team Management• Alliances and Global Partnering• Channel• P&L responsibility• GTM Strategy• Strategic Project, Program & Portfolio Management• ICT industry AdvisorTechnology Skills• Digital Transformation (APIs)• Cloud Computing• Cloud eXchange• Datacenter Solutions• ITaaS• Hybrid IT (Containers, Networks, Security)• Edge Computing• Mobile Applications Platform• Software-Defined Networking• Internet eXchange• Content Delivery Network• Security (WAF/DNS/DDoS Mitigation) … see more",
  "contact_info": "GianLuca’s Profile linkedin.com/in/gianlucac Website biqmind.com/ (Company Website)"
 },
 {
  "profile_link": "https://www.linkedin.com/in/gregarmshaw?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAd_7cBn05FiL1AwV8GdIdsxcqVyoF-XFk",
  "name": "Greg Armshaw",
  "information": "Evenly distributing the future of TV and enterprise communications.",
  "location": "Singapore Contact info",
  "company": "Brightcove",
  "connections": "5,390 followers",
  "about": "Product and Market entry consultant, OTT TV specialist, strategist and sales leader with in-depth experience of customer focused product development, fiscal management and team leadership. Strong understanding and application experience in leveraging the business benefit of data, the engagement power of great content on social channels and the disruptive influence of mobile.• Consulted by CMOs, Digital Leaders and Startup Founders on the strategies for digital success in Asia• Hands on multi-national experience from the fields of Indonesia, the malls of Philippines to the modern trade of China. Consulted and facilitated digital product innovation programmes across Asia.• Worked with brands such as Hooq, ABS-CBN, Coca-Cola, Globe, GSMA, LINE, L’Oreal, Mastercard, Maxis, Nestle, Smartfren, Tata Communications, Syngenta,A digital optimist he believes in the power of technology to build brands and profit, while acknowledging that it takes discipline and the wisdom of the crowd to make sure the technology serves the community as a whole.Working across Asia since 2006, first from Hong Kong and since 2010, Singapore where he and his family are now resident. Speaker Profile A regular commentator, both in the media and regional seminars and forums, Greg has a strong understanding of the challenges facing businesses trying to grow and market their products within Asia Pacific. He draws from his extensive knowledge of consumer internet use, and his rich experience in media and the market research industry, to discuss the trends and opportunities around mobile business and marketing. Greg is a holistic, adaptive thinker and able to present both a narrow market or business sector-specific perspective, or widen focus to take account of the converging ecosystem of content delivery, supported by the rich pool of case studies from the industry.Posts on Social Media are my own and do not necessarily reflect the position, strategies or opinions of my employer or partner organisations … see more",
  "contact_info": "Greg’s Profile linkedin.com/in/gregarmshaw Twitter Innovasian"
 },
 {
  "profile_link": "https://www.linkedin.com/in/andyjacksonfc11?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAJwrC4BrK0YG6mNk42n0liimd8qirE7SP0",
  "name": "Andy Jackson",
  "information": "VP Media, APAC at Footballco.",
  "location": "Singapore Contact info",
  "company": "Footballco Birmingham University",
  "connections": "500+ connections",
  "about": "A seasoned specialist in all areas of content conception, production, distribution, marketing and commercialisation with a career spanning over 30 years in Europe, the US, Australia and Southeast Asia with extensive experience in the sport and technology sectors. Successfully embraced and mastered the digital media revolution developing a background in traditional magazine craft into modern, multiplatform, multimedia content expertise.At home in both B2B and B2C environments with a proven track record of managing global brands and new launches with equal success and enthusiasm.Leads from the front, delivers on promises and consistently builds successful, driven and award-winning teams.For 12 years led the global expansion of the FourFourTwo brand to Australia, Asia, USA from Sydney, Singapore and London. Left following the transition of the brand from Haymarket to Future Plc.Joined Perform Group in 2018 as it re-branded to DAZN relocating back to Singapore as VP Strategy for Asia with DAZN Media before transitioning to Football Co in December 2020 as VP Media for APAC. … see more",
  "contact_info": "Andy’s Profile linkedin.com/in/andyjacksonfc11 Websites dazn.com (Company Website) goal.com (Company Website) Twitter Jacko442"
 },
 {
  "profile_link": "https://www.linkedin.com/in/patmulles?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAARrT98B9owEcnF_Z2T-4slC-udnsCIKZ3o",
  "name": "Patricia Mulles",
  "information": "Global Partnerships at She Loves Data | Data and Insights-Driven Storyteller | Ecosystem Builder | Transformation Leader",
  "location": "Singapore Contact info",
  "company": "She Loves Data Ateneo de Manila University",
  "connections": "500+ connections",
  "about": "Pat has 20+ years of experience in media and technology (SkyCable, CBS Interactive, Samsung Content and Services), leading high performing international teams in organisational change, go-to-market strategies, brand direction, strategic partnerships, and ecosystem-building, as well as in digital transformation initiatives that rely on customer data to create differentiated customer experiences leading to growth and profits.A builder and marketer of innovative platforms, apps and their commercial ecosystems, Pat profiles a pioneering spirit that is highly adaptable to dynamic environments in both corporate and startup settings.She has inspired teams in: • Go-to-Market strategies, global integrated marketing, brand stewardship and content marketing for internet services, mobile and AR/VR devices, social video content and OTT services (mig33, Vuclip now Viu, and Samsung entertainment, art (Masterpieces) and education (KidsTime) platforms, among others). • Product Development and Systems Integration for telecom services, customer platforms, mobile and smart TV apps. • Data-Driven Customer Experience and single view of the customer initiatives, for both B2B (IBM, Oracle, Microsoft, Cisco at CNET Direct) and D2C (at Samsung, ThumbMOB and SkyInternet) brands. • Strategic Partnerships, Sales Strategy and Operations, and P&L Management, for media products and services, systems integration services and enterprise software.• CSR and Diversity, Equality and Inclusion (DEI) initiatives for MNCs and non-profit organisations (Samsung, Procter & Gamble, She Loves Data), as well as change management projects that led to culture transformation. Pat is also an advocate of human advancement through art science and education, and in her spare time mentors student entrepreneurs, and women who aspire to be leaders in technology. … see more",
  "contact_info": "Patricia’s Profile linkedin.com/in/patmulles Twitter PatMulles"
 },
 {
  "profile_link": "https://www.linkedin.com/in/claude-b-7ba224124?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAB6lGX4BY2_EdBdMhJAru1g_xhwxwO2V198",
  "name": "Claude B",
  "information": "Looking for Senior Engineers and Sales Directors in Programmatic Advertising and Video",
  "location": "Singapore Contact info",
  "company": "Freelance",
  "connections": "500+ connections",
  "about": "Results driven Business Development Executive with successful experience in SaaS, Sales, Business Development, and Account Management in Digital Advertising, Programmatic Technologies and Platforms. OTT/CTV/Programmatic with experience and broad agency/client connections across all major verticals.Industry: software-as-a-service (SaaS), fintech, technology, financial services, non-profit, start-ups Digital Media - Diverse experience in Display, Mobile, Video, Rich and Programmatic Media, Big Data Ad Tech - Strong experience of SaaS, Ad Serving, Native, SSP, DSP, Analytics, with a focus on Display and Video ad types. … see more",
  "contact_info": "Claude’s Profile linkedin.com/in/claude-b-7ba224124"
 },
 {
  "profile_link": "https://www.linkedin.com/in/alanting-yc?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAABQmCgBj1nzPBidMv_LMFhCN1jUT6wbTGE",
  "name": "Alan Ting",
  "information": "CDTO | Innovation | Strategy | Digital Business | Leadership",
  "location": "Singapore Contact info",
  "company": "NTUC LearningHub Murdoch University",
  "connections": "300 connections",
  "about": "Technology and Innovation leader that create new digital values and assets. International fellow (FCIM) chartered marketer and technology advisor.A dynamic and results-oriented innovative pathfinder with good regional tacit knowledge, IT experience and more than 15 years in managing alliances, matrix organization, e-commerce operation and digital business unit. Strong track record of performance in achieving revenue, profit, operational excellence, customer satisfaction and business growth. Experience in greenfield, brownfield and ESG projects.Have a passion for innovation, technology and all things Digital. Build a high-performance team and provide strategic intend, identify trends and drivers and Go To Market strategy. Lead and build innovation capital and capability to increase sales and service offering resulting in overall business profitability. Driven and deliver positive returns in both tangible and intangible results that ensure stewardship and commands distinct values for our prospective customers.Build and foster networks with local and overseas innovation ecosystems. Participate in speaking, mentoring and roundtable engagement internationally. Build successful relationships with decision-makers, seizing control of critical problem areas, and delivering on customer commitments. Identify M&A opportunities, new technology capabilities and integrate into the client organization via transformation journey and framework (ADKAR, BSC, SCQA and MEDDIC). Form strategic alliances with major technology partners and worked with Silicon Valley companies on cutting edge product and integrate capabilities to the client organization. Lead and motivate diverse cultures, nationalities and bridging expertise across functional teams to achieve organizational goals. Total Projects value won and managed - over SGD 200 millionProject Team Size - 80 Partnership Level - Tier 1 Partnership Region - Worldwide … see more",
  "contact_info": "Alan’s Profile linkedin.com/in/alanting-yc Websites pdpc.gov.sg (Portfolio) ns.sg/nsp/portal/site/mha/shop-at-emart (Portfolio)"
 },
 {
  "profile_link": "https://www.linkedin.com/in/jcjubin?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAABKRMB01Y8vPHBdn892iWEAP3t_xjMDyY",
  "name": "Jean-Christophe JUBIN",
  "information": "High tech companies in Telecom, Broadcast and IoT, we are your Sales team in Asia, from leads to closing.",
  "location": "Singapore Contact info",
  "company": "Stepin2Asia",
  "connections": "500+ connections",
  "about": "‣ You are an innovative company in the field of IoT, Telecom or Broadcast Technology ?‣ You want to scale your sales in Asia / APAC ?Oᴜʀ sᴀʟᴇs ᴛᴇᴀᴍ ʟᴏᴄᴀʟɪᴢᴇᴅ ɪɴ 10 ᴄᴏᴜɴᴛʀɪᴇs ɪs ʜᴇʀᴇ ᴛᴏ ʜᴇʟᴘ ʏᴏᴜ ɢʀᴏᴡ ʏᴏᴜʀ ʙᴜsɪɴᴇssWe have a physical presence in :‣ Singapore, Indonesia, Thailand, Malaysia, Vietnam, Myanmar, Laos, Cambodia, Taiwan, Hong-Kong‣ Australia & New Zealand🚀 𝐅𝐫𝐨𝐦 𝐥𝐞𝐚𝐝 𝐠𝐞𝐧𝐞𝐫𝐚𝐭𝐢𝐨𝐧 𝐭𝐨 𝐜𝐥𝐨𝐬𝐢𝐧𝐠, 𝐰𝐞 𝐝𝐫𝐢𝐯𝐞 𝐚𝐧𝐝 𝐚𝐜𝐜𝐞𝐥𝐞𝐫𝐚𝐭𝐞 𝐲𝐨𝐮𝐫 𝐬𝐚𝐥𝐞𝐬 𝐢𝐧 𝐭𝐡𝐨𝐬𝐞 𝐜𝐨𝐮𝐧𝐭𝐫𝐢𝐞𝐬.‣ We are a team of seasoned (Senior) business developers all experts in IoT, Telecom and Video nurturing our dense network with local actors (TV & Telco operators, governmental and regulating bodies, system integrators,).‣ We already have developed customer intimacy with the decision makers of most of your targets across the region.‣ We are your sales force in APAC and will help you to implement your sales strategy, generate leads and close deals.‣ We regularly bring 6 to 7 figure deals with our existing customers.👉🏻 ᴀsᴋ ᴏᴜʀ ᴄʟɪᴇɴᴛs !𝐓𝐞𝐥𝐞𝐜𝐨𝐦 : Orange/VO | Mozark | 123 Multimedia𝐁𝐫𝐨𝐚𝐝𝐜𝐚𝐬𝐭 / 𝐎𝐓𝐓 : Mirada | WildMoka | IVS | Anevia | Worldcast𝐈𝐨𝐓 : Astrocast | Opencell | Edgewayʟᴇᴛ’s ɢᴇᴛ ɪɴ ᴛᴏᴜᴄʜ ᴛᴏᴅᴀʏ :🌐 stepin2asia.com📱65 9068 5242📧 jc.jubin@stepin2asia.com … see more",
  "contact_info": "Jean-Christophe’s Profile linkedin.com/in/jcjubin Twitter JCJubin"
 },
 {
  "profile_link": "https://www.linkedin.com/in/johnkotsaftis?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAMTQwB_skVqXnRIxMTFOQwnnffXT44fEE",
  "name": "John Kotsaftis",
  "information": "Digital Media Consultant",
  "location": "Singapore Contact info",
  "company": "ValorMedia Harvard University",
  "connections": "500+ connections",
  "about": "Executive with a successful track record and highly diverse geographic experience in both emerging and developed markets. Most of my experience has been in scaling up new technology and media businesses. … see more",
  "contact_info": "John’s Profile linkedin.com/in/johnkotsaftis"
 },
 {
  "profile_link": "https://www.linkedin.com/in/varoon-raghavan-8638834?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAADXQQsBu0YXQC25SrP7J_W5UzUAMj609k8",
  "name": "Varoon Raghavan",
  "information": "Chief Operating Officer and Co-founder at Princeton Digital Group",
  "location": "Singapore Contact info",
  "company": "Princeton Digital Group Indian Institute of Management, Lucknow",
  "connections": "500+ connections",
  "about": "I am the Chief Operating Officer and Co-founder of Princeton Digital Group (PDG), a Singapore-headquartered pan-Asian data center developer and operator. PDG is backed by Warburg Pincus and Ontario Teachers' Pension Plan. We are in 4 countries (China, Singapore, India and Indonesia) and are actively expanding our presence in other countries in the region.Before PDG, I was at the Tata Group where I held leadership positions in sales and product management, engineering, operations and corporate development delivering value creation in growth, start-up and turnaround situations. I have lived and worked in Singapore, India, the US and the UK. … see more",
  "contact_info": "Varoon’s Profile linkedin.com/in/varoon-raghavan-8638834 Websites princetondg.com (Company Website) princetongv.com (Personal Website)"
 },
 {
  "profile_link": "https://www.linkedin.com/in/alexjs?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAD0JS8B99cZI81s36KmiFlkEy1J6vkdgno",
  "name": "Alex Smith",
  "information": "Customer Success Lead, Microsoft Azure Asia Pacific at Microsoft",
  "location": "Singapore Contact info",
  "company": "Microsoft Royal Holloway, University of London",
  "connections": "4,379 followers 500+ connections",
  "about": "My speciality is to drop in to any situation and quickly build technical leadership, regardless of the discipline involved. Thriving in complex environments with a range of unusual challenges, I want to apply this where I can provide significant impact, innovation and continuous improvement for both myself, a team, and the wider organisation. … see more",
  "contact_info": "Alex’s Profile linkedin.com/in/alexjs Websites alexsmith.org (Personal Website) alexsmith.org/cv/ (CV) Twitter alexjs"
 },
 {
  "profile_link": "https://www.linkedin.com/in/olivermills?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAALOYsBIl5tNHUtQ_JUKyVtHzxut9HhHFs",
  "name": "Oliver Mills",
  "information": "Regional Director SE Asia at Intertrust Technologies Corp",
  "location": "Singapore Contact info",
  "company": "INTERTRUST TECHNOLOGIES INTERNATIONAL CORPORATION LIMITED The Open University",
  "connections": "500+ connections",
  "about": "Expertise in IT, OTT, IPTV, Computer Security, IoT and Mobile Application Security, targeted advertising, Content Acquisition, DRM and content protection, Application and key protection, video, music and multimedia on all forms of devices.Specialties: Extensive experience in many forms of IT and Mobile Security and device management.Development and licensing of rights management systems, IP and technology. Working to establish new ways to enhance consumer entertainment and information.WhiteCryption https://www.intertrust.com/products/application-security/ (Cryptanium Key and code security, hardening, white-box crypto and code obfuscation for mobile apps: Mobile Wallet, In Car App, Healthcare app etc.)ExpressPlay uDRM - The easiest way to protect any media delivered over the Internet using cloud-based Marlin, FairPlay, Widevine, Adobe or PlayReady with transactional watermarking if requiredExpressplay Audience : Privacy enabled horizontal platform for user understanding and mobile ad targeting), This converts shared and contextual consumer data into the knowledge that media buyers need to place ads with greater precision and improve their audience intelligence. Over 2 Billion profiles matched.ExpressPlay Ads: A dynamic ad insertion solution for media service providers that works in conjunction with ExpressPlay Audience to offer personalized, verified, and secure targeted ad insertion capabilities.Expressplay CA - Cardless low-cost CAS solution for delivering protected content to STB’s and Smart TV’sKiora Media - Enabling delivery of premium movies for environments with limited or no internet connections: plane, train, bus, hotel or remote village. … see more",
  "contact_info": "Oliver’s Profile linkedin.com/in/olivermills"
 },
 {
  "profile_link": "https://www.linkedin.com/in/bhuvan9?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAC1LrgBTmDZwQS4tWCUEj9Ztdygrt8Gv3E",
  "name": "Bhuvan Asthana",
  "information": "Human of Haas",
  "location": "Singapore Contact info",
  "company": "Conviva University of California, Berkeley, Haas School of Business",
  "connections": "500+ connections",
  "about": "APAC Business & Partnership Specialist. Launched Conviva in Asia & growing/learning everyday, HOOQ/Singtel, launched first Telco CRM based Digital Advertising tool (Vserv), India's First Mobile Payment service (Oxigen), India's own mobile messenger (Hike), led strong partnerships with Telcos, ISPs, Publishers, Digital Technology and Business Enterprises...& still learning....Consultative Solution Selling,Partnership & Alliance Development,Corporate & Retail Sales,Big Data & Real-time Data,Business Development,Account Management,New Product Development,Advertising Technologies,Business Operations,Vendor Management,Marketing & Communications,Usage & Retention,Ad-Operations,Project Management,international sales Strategy,Social Media,Online Marketing,Search Engine Optimization, Key Account Management,Digital Commerce,Media Sales,Consumer Internet,Mobile VAS,Online Sales,Modern Trade,Media Marketing,Business Analysis,Hunter,Media Buying,Real Time Bidding,Digital Marketing, SaaS, PaaS, Product Management,Social Work,IT/Telecom Sales,Start up Environments,New Team Development, Operational Efficiency,Sales Support,Business Process,Customer Experience,Ad-Exchange,Leadership, Data Analysis,Business planning,Product Lifecycle Management,Market Assessment,Competitive Analysis,Cloud Computing, Strategy consulting, Research, Analytics, Market Research,Budgeting,Client Services,Business Intelligence, Data Scientist, Customer Life cycle management, Telco relationship, strategic alliance, technology, Value Proposition (Offer, Promotion, Service, Price, Bundle), Product Portfolio Management, Segmentation, Market Research, Value Added Services (Data, Voice, SMS), Loyalty & Churn, Tariff & Analysis, Business Case & Budgeting, Billing Solutions (Banking, IN, Convergent Platforms), Mobile Money & International Remittance, Mobile Marketing & Mobile Advertising, Handsets & CPE’s, Vendor Negotiation & Management, Brand & Marketing Communications, Strategic Partnership with OTT's, WEB, APP Eco-system, optimization … see more",
  "contact_info": "Bhuvan’s Profile linkedin.com/in/bhuvan9 Twitter bhuvan9 Birthday June 9"
 },
 {
  "profile_link": "https://www.linkedin.com/in/vishsada?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAARj3dkBuXeUc5ThfiZ6tlwZWT4Su64Qmos",
  "name": "Vish Sadananda",
  "information": "Director, Buyer Partnerships and Strategy at Smaato",
  "location": "Singapore Contact info",
  "company": "Smaato",
  "connections": "500+ connections",
  "about": "Hello & welcome to my LinkedIn profile page. The reason I am here is to connect with new, exciting and interesting professionals from all walks of life, from various fields within many diverse industries. I love my profession and the people I work with. I am experienced in digital media advertising sales on online, mobile, social, gaming, apps, activation and sales inventory management. My experience also entails marketing strategy, ROI plan on customized activation solutions, identifying new streams to increase revenue and interfacing/maintaining an on-going, productive long term relationships at all levels of the media agencies/customer’s organization. I'm highly energetic with an ability to adapt to a constantly changing environment and a range of differing cultures with strong people management and leadership skills, especially problem solving and conflict resolution.Do drop me a word on:Email vis@outlook.sg | Skype live:vis_105I'll love to hear from you on anything digital/programmatic or just to connect. … see more",
  "contact_info": "Vish’s Profile linkedin.com/in/vishsada"
 }
]