[
 {
  "google_info": "Lex Fridman - AI Researcher - Massachusetts Institute of ...",
  "profile_link": "https://www.linkedin.com/in/lexfridman",
  "name": "Lex Fridman",
  "information": "AI researcher. Podcast host.",
  "location": "Cambridge, Massachusetts, United States Contact info",
  "company": "Massachusetts Institute of Technology (MIT)",
  "connections": "500+ connections",
  "about": "Research in human-centered AI and deep learning at MIT and beyond in the context of autonomous vehicles and personal robotics. I'm particularly interested in understanding human behavior in the context of human-robot collaboration, and engineering learning-based methods that enrich that collaboration. I received my BS, MS, and PhD from Drexel University where I worked on applications of machine learning, computer vision, and decision fusion techniques in a number of fields including robotics and human sensing. Before joining MIT, I was at Google working on machine learning for large-scale behavior-based authentication. … see more",
  "contact_info": "Lex’s Profile linkedin.com/in/lexfridman Website lexfridman.com (Personal Website)"
 },
 {
  "google_info": "Dave O'Callaghan - Managing Partner - Vation Ventures ...",
  "profile_link": "https://www.linkedin.com/in/daveo4",
  "name": "Dave O'Callaghan",
  "information": "Connecting Innovators. Family. Friends. Board Member. Faculty Member. Advisor. Speaker. Leader. Experience Enthusiast.",
  "location": "Denver, Colorado, United States Contact info",
  "company": "Vation Ventures University of Cincinnati College of Business",
  "connections": "500+ connections",
  "about": "Currently the Managing Partner of Vation Ventures. Also an Executive Affilitated Faculty at the Daniels College of Business of the University of Denver.",
  "contact_info": "Dave’s Profile linkedin.com/in/daveo4 Websites occapital.net (Company Website) facebook.com/coacho14 (Company Website) Twitter CoachO14 Birthday January 30"
 },
 {
  "google_info": "Neil Kane - Summary of CEO & Board/Advisory Roles - History ...",
  "profile_link": "https://www.linkedin.com/in/neilkane",
  "name": "Neil Kane",
  "information": "Executive | Startup CEO | Entrepreneur | Director | Innovator \"Achieving success through innovation\"",
  "location": "Detroit Metropolitan Area Contact info",
  "company": "History The University of Chicago Booth School of Business",
  "connections": "500+ connections",
  "about": "\"I've never been fully qualified for any job that I've had, but I have always achieved success.\"​ Degrees in technology and business, coupled with professional experience as a founder and in sales, higher education and the arts, have allowed me to see opportunities where others don't. Persistence, and a high degree of impatience, ensure that results are achieved on my watch. Some people say I can see around corners. * Entrepreneur/executive/innovator with 25 years of general management, sales, marketing and investment experience in environments ranging from nanotechnology to advanced materials to consumer products. * Acknowledged leader in technology commercialization (tech transfer) with extensive start-up as well as big company experience (IBM and Microsoft). * 10 year track record of raising venture capital, angel financing, strategic investments and government grants. * Program administrator and instructor for undergraduate and executive MBA-level university classes in entrepreneurship, innovation and emerging technologies. * Experienced public speaker, writer and dealmaker. * Contributor to Forbes.com on topics related to entrepreneurship, innovation and leadership. * Co-author of The Innovator's Secret Formula. Recognition* Excellence in entrepreneurship by the National Science Foundation* Named a Technology Pioneer by the World Economic Forum* Twice invited to testify in Congress on the subject of technology commercialization. Specifically, the U.S. House of Representatives Committee on Science and Technology, Subcommittee on Research & Science Education.* Named a \"Mover and Shaker\" by Frost & Sullivan. * Runner-up in Wall St. Journal's Innovation Awards* IBM Golden Circle* IBM President's Award* Led Michigan State University's undergraduate entrepreneurship program to a Top 25 national ranking in The Princeton Review.* Faculty member and instructor in entrepreneurship, innovation, product development, blockchain and emerging technologies. I teach in both the undergraduate and executive MBA programs. Specialties* Innovation* Entrepreneurship* Venture capital* Startups* Blockchain* Early-stage company formation* Author / blogger / columnist* Technology transfer and tech commercialization* Business development* Higher education* Leadership* Government grants and SBIR awards* Technology incubation* Nanotechnology* Barbecue sauce* Synthetic diamond* Rubik's Cubes. … see more",
  "contact_info": "Neil’s Profile linkedin.com/in/neilkane Website illinoispartners.com/ (Company Website) Twitter neildkane"
 },
 {
  "google_info": "Megan Bowen - Chief Customer Officer - Refine Labs | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/meganwhitebowen",
  "name": "Megan (White) Bowen",
  "information": "Chief Customer Officer at Refine Labs - We're Hiring | B2B Demand Acceleration & Revenue Optimization",
  "location": "New York, New York, United States Contact info",
  "company": "Refine Labs",
  "connections": "15,713 followers 500+ connections",
  "about": "\"I've never been fully qualified for any job that I've had, but I have always achieved success.\"​ Degrees in technology and business, coupled with professional experience as a founder and in sales, higher education and the arts, have allowed me to see opportunities where others don't. Persistence, and a high degree of impatience, ensure that results are achieved on my watch. Some people say I can see around corners. * Entrepreneur/executive/innovator with 25 years of general management, sales, marketing and investment experience in environments ranging from nanotechnology to advanced materials to consumer products. * Acknowledged leader in technology commercialization (tech transfer) with extensive start-up as well as big company experience (IBM and Microsoft). * 10 year track record of raising venture capital, angel financing, strategic investments and government grants. * Program administrator and instructor for undergraduate and executive MBA-level university classes in entrepreneurship, innovation and emerging technologies. * Experienced public speaker, writer and dealmaker. * Contributor to Forbes.com on topics related to entrepreneurship, innovation and leadership. * Co-author of The Innovator's Secret Formula. Recognition* Excellence in entrepreneurship by the National Science Foundation* Named a Technology Pioneer by the World Economic Forum* Twice invited to testify in Congress on the subject of technology commercialization. Specifically, the U.S. House of Representatives Committee on Science and Technology, Subcommittee on Research & Science Education.* Named a \"Mover and Shaker\" by Frost & Sullivan. * Runner-up in Wall St. Journal's Innovation Awards* IBM Golden Circle* IBM President's Award* Led Michigan State University's undergraduate entrepreneurship program to a Top 25 national ranking in The Princeton Review.* Faculty member and instructor in entrepreneurship, innovation, product development, blockchain and emerging technologies. I teach in both the undergraduate and executive MBA programs. Specialties* Innovation* Entrepreneurship* Venture capital* Startups* Blockchain* Early-stage company formation* Author / blogger / columnist* Technology transfer and tech commercialization* Business development* Higher education* Leadership* Government grants and SBIR awards* Technology incubation* Nanotechnology* Barbecue sauce* Synthetic diamond* Rubik's Cubes. … see more",
  "contact_info": "Megan’s Profile linkedin.com/in/meganwhitebowen Birthday February 13"
 },
 {
  "google_info": "Brenda L. Berkelaar, PhD - Austin, Texas, United States ...",
  "profile_link": "https://www.linkedin.com/in/berkelaar",
  "name": "Brenda L. Berkelaar, PhD",
  "information": "Consultant. Researcher. Affiliated Faculty. Signature Focus: Integrating technology, information, and people to build organizational capacity and value",
  "location": "Austin, Texas, United States Contact info",
  "company": "Self Employed Purdue University",
  "connections": "500+ connections",
  "about": "Agile research professional and data-driven problem-solver with 20+ years consulting and academic experience. Demonstrated record of consistent, creative, in-depth, integrative analysis and agile project management. Broad-based qualitative/quantitative expertise. Analytics fluent. Skilled communicator able to translate complex concepts to diverse audiences across sectors, functions, and disciplines. Award-winning, highly ranked speaker; published author; proven coaching and management results face-to-face and online.Signature focus: Integrating technology, information, and people to build organizational capacity and value … see more",
  "contact_info": "Brenda L.’s Profile linkedin.com/in/berkelaar"
 },
 {
  "google_info": "Jessica Manning - NIAID Cambodia / Science Attaché ...",
  "profile_link": "https://www.linkedin.com/in/jessicamanningmd",
  "name": "Jessica Manning",
  "information": "National Institutes of Health (NIH): Intramural Research Program (IRP)",
  "location": "Cambodia Contact info",
  "company": "National Institutes of Health (NIH): Intramural Research Program (IRP) Harvard School of Public Health",
  "connections": "500+ connections",
  "about": "Jessica Elizabeth Manning is an infectious diseases physician-scientist and field epidemiologist residing in Cambodia where she leads NIAID's field sites and laboratories devoted to vector-borne disease research and emerging pathogens. She has also served as Science Attaché at the US Embassy Phnom Penh since 2017.Since 2008, she has lived and worked in Asia and Africa with a focus on clinical and translational research of dengue, malaria, and other mosquito-borne diseases. Specifically, her current research focuses on: 1) how the human immune response to mosquito saliva can be harnessed into vaccine and biomarker development and 2) how metagenomic next generation sequencing of novel and known pathogens can impact public health in developing countries. … see more",
  "contact_info": "Jessica’s Profile linkedin.com/in/jessicamanningmd"
 },
 {
  "google_info": "Barney Pell - Venture Partner - Radical Ventures | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/barneypell",
  "name": "Barney Pell",
  "information": "AI expert, entrepreneur and investor in world-changing ventures.",
  "location": "San Francisco, California, United States Contact info",
  "company": "Radical Ventures University of Cambridge",
  "connections": "500+ connections",
  "about": "I'm an active start-up investor and advisor with over 200 investments. I enjoy helping bring advanced technology and big ideas into real applications and markets that change people's lives. I am currently a Fellow in the Creative Destruction Laboratory, one of the world's top start-up accelerators, an angel investor and VC with my own fund and syndicate, World Changing Ventures, and Venture Partner at Radical Ventures. I also serve as board member or advisor to world-changing startups including: Streamlit, Ecoation, and Ionomr. I have been active in startup companies as founder, executive and advisory roles for over 20 years. I was Founder and CEO of Powerset, a natural language search engine that Microsoft acquired. I then stayed on with Microsoft as search strategist and evangelist for Bing, Microsoft's new consumer search engine, and later as architect and general manager for Bing's Local/Mobile Search team. While at Microsoft, I led the company's long-range planning for semantics and knowledge and co-founded Bing's Knowledge Graph and Cortana, Microsoft's conversational assistant. Before starting Powerset, I was at Mayfield VC as an Entrepreneur in Residence.I was also co-founder of Moon Express, a start-up developing a commercial lunar lander; LocoMobi, a leader in smart cities and intelligent transportation systems, and Associate Founder of Singularity University. I was a founding investor and then Chairman of the Science Advisory Board for Figure Eight, a leader in human-in-the-loop machine learning, until successful acquisition by Appen and an early advisor to LinkedIn. Earlier startups included StockMaster.com, a leading online financial content provider and Whizbang! Labs, a leading innovator of web-based information extraction agents. I have also been a long-time AI research leader. I managed an 85-person AI R&D organization at NASA. Highlights included flying the first AI system in deep space (on the Deep Space One mission), the first spoken dialog system in space, and supporting the Mars Exploration Rovers mission.Specialties: AI, Machine Learning, NLP, search, e-Commerce, software agents, knowledge management, data mining, information extraction, forms processing, planning and scheduling, robotics, space exploration, financial services, intelligence, government IT, strategic planning, mergers and acquisition, decision analysis, Parking, Space. … see more",
  "contact_info": "Barney’s Profile linkedin.com/in/barneypell Websites barneypell.com (Personal Website) qpme.com (Company Website) moonexpress.com (Company Website) Twitter barneyp Birthday March 18"
 },
 {
  "google_info": "Rick G. - Senior Director, Market Strategy - Lumeris | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/rickgoddard",
  "name": "Rick G.",
  "information": "Value-Based Care Strategist and Healthcare Executive",
  "location": "Greater Chicago Area Contact info",
  "company": "Lumeris Rush University",
  "connections": "500+ connections",
  "about": "Executive business strategist with strong analytical, communication and relationship building skills. Extensive experience leading complex healthcare corporate strategy, product, analytics, and operational initiatives within diverse environments, including leading health systems and mid-sized private companies, to support organizational and stakeholder growth. … see more",
  "contact_info": "Rick’s Profile linkedin.com/in/rickgoddard"
 },
 {
  "google_info": "Julie Kimball Keating - VP, Digital Media and Marketing ...",
  "profile_link": "https://www.linkedin.com/in/jkkeating",
  "name": "Julie Kimball Keating",
  "information": "VP, Digital Media and Marketing at Havas Edge",
  "location": "Wellesley Hills, Massachusetts, United States Contact info",
  "company": "Havas Edge iPEC Coaching",
  "connections": "500+ connections",
  "about": "Successful strategic digital media and marketing leader driven by solving customer needs, a track record of building high-growth engagements, hiring and coaching team members, and identifying new revenue streams. A trusted advisor that builds strong internal and external relationships and creates solutions to deliver and manage multi-million dollar investments from Fortune 500 accounts. … see more",
  "contact_info": "Julie’s Profile linkedin.com/in/jkkeating"
 },
 {
  "google_info": "Pat Iyer MSN RN LNCC - National Speakers Association ...",
  "profile_link": "https://www.linkedin.com/in/patiyer",
  "name": "Pat Iyer MSN RN LNCC",
  "information": "National Speakers Association Authors Group co-host:",
  "location": "Fort Myers, Florida, United States Contact info",
  "company": "University Of Pennsylvania",
  "connections": "500+ connections",
  "about": "Pat is an experienced author, podcaster, editor, and ghostwriter who loves to work with others to share their knowledge and expertise. Pat has edited or written over 800 chapters, books, online courses, case studies or articles. She excels in repurposing content and assists experts to create online courses from their content. Pat also coaches legal nurse consultants and shares her 31 years of experience in legal nurse consulting in her books, articles, courses and Legal Nurse Podcast. Keywords: editing, developmental editor, ghostwriting, business coach, legal nurse consultant … see more",
  "contact_info": "Pat’s Profile linkedin.com/in/patiyer Websites legalnursebusiness.com (www.legalnursebusiness.com) LNCAcademy.com (www.LNCAcademy.com) patiyer.com (www.patiyer.com) Twitter patiyer"
 },
 {
  "google_info": "Ross Randall - Director of Technology - Lamar County School ...",
  "profile_link": "https://www.linkedin.com/in/rossgrandall",
  "name": "Ross Randall",
  "information": "Director of Technology at Lamar County School District",
  "location": "Hattiesburg, Mississippi, United States Contact info",
  "company": "Lamar County School District University of Southern Mississippi",
  "connections": "500+ connections",
  "about": "Accomplished Technology Director with strong background in project and personnel management. Successful in development, execution and completion of large scale projects involving a multitude of stakeholders. Experience in developing budgets and managing yearly fiscal obligations. Strong contract negotiation skills and excellent vendor rapport. Positive, outgoing and able to lead others with direction and shared vision. Involved in state level organizations with a focus on improving teaching and learning by incorporating 21st century skills. … see more",
  "contact_info": "Ross’ Profile linkedin.com/in/rossgrandall Website twitter.com/ross_randall (Twitter) Twitter Ross_Randall"
 },
 {
  "google_info": "Benjamin Farmer - Partner - Bain & Company | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/benjaminsfarmer",
  "name": "Benjamin Farmer",
  "information": "Partner at Bain & Company",
  "location": "Boston, Massachusetts, United States Contact info",
  "company": "Bain & Company Dartmouth College - The Tuck School of Business at Dartmouth",
  "connections": "333 connections",
  "about": "Accomplished Technology Director with strong background in project and personnel management. Successful in development, execution and completion of large scale projects involving a multitude of stakeholders. Experience in developing budgets and managing yearly fiscal obligations. Strong contract negotiation skills and excellent vendor rapport. Positive, outgoing and able to lead others with direction and shared vision. Involved in state level organizations with a focus on improving teaching and learning by incorporating 21st century skills. … see more",
  "contact_info": "Benjamin’s Profile linkedin.com/in/benjaminsfarmer"
 },
 {
  "google_info": "Richard Stamets - Senior Vice President Business ... - LinkedIn",
  "profile_link": "https://www.linkedin.com/in/richardstamets",
  "name": "Richard Stamets",
  "information": "Senior Vice President Business Development at Thimble",
  "location": "New York City Metropolitan Area Contact info",
  "company": "Thimble University of Pennsylvania - The Wharton School",
  "connections": "500+ connections",
  "about": "High-energy, Results-Focused, Leader, Mentor, Driven to Improve...I am a leader and influencer who contributes and makes improvements that yield significant and positive results to the company and team around me. I am an optimistic person who believes that having a solid objective, supported by well thought-out strategies and timely tactics, along with persistence and grit will often help an organization reach and surpass its goals. I'm an avid learner and actively seek out knowledge and information on how to constantly improve and drive results. My background combines diverse, transferable skills in Executive Leadership, Underwriting, Sales and Distribution Management with a common theme of leveraging technology and building successful teams and client relationships to drive results. I'm passionate about growing personally and professionally, while improving my abilities to lead and contribute to the company, teams around me and our clients. I attained AU and CPCU designations early in my career and also had the privilege of attending the Wharton School's Insurance Executive Leadership program. … see more",
  "contact_info": "Richard’s Profile linkedin.com/in/richardstamets Website thimble.com (Company Website) Twitter rstamets"
 },
 {
  "google_info": "Matt Ocko - Co-Managing Partner - DCVC | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/mattocko",
  "name": "Matt Ocko",
  "information": "Co-founder, Co-Managing Partner at DCVC (co-founder w/ @Zackbogue)",
  "location": "Palo Alto, California, United States Contact info",
  "company": "DCVC Yale University",
  "connections": "500+ connections",
  "about": "Matt Ocko, with three decades of experience as a technology entrepreneur and VC, in the US and globally, is co-Managing Partner and co-founder of DCVC (Data Collective). Matt’s current investments on behalf of DCVC span from computational drug discovery and synthetic biology to geospatial and space access platforms, robotics, applied AI, anti-terror systems, and large-scale enterprise platforms including quantum computers.In addition to large IPO outcomes, many of Matt’s prior investments were acquired to become core capabilities of companies like Illumina, Cisco, Google, IBM, Amazon/AWS, VMware, Salesforce, and Akamai. His venture investments prior to DCVC include Zoom (ZM), Fortinet (FTNT), D-Wave Systems, Uber (UBER), AngelList, Xensource (CTRX), and Facebook (FB). Matt founded and was VP of R&D of Da Vinci Systems, a pioneering e-mail software vendor with over 1 million users world-wide prior to its acquisition.Matt holds a degree in Physics from Yale University, and he is an inventor on over 50 granted or in-process patents in areas as diverse as computer systems virtualization, fraud detection, and AR. Matt has been active in helping develop China’s venture capital and technology regulatory framework for two decades. He still writes code and builds robots for fun with his kids, but admits to liking Erlang better than Clojure, and Fischertechnik better than Lego Mindstorms. … see more",
  "contact_info": "Matt’s Profile linkedin.com/in/mattocko Website dcvc.com (Company Website) Twitter mattocko"
 },
 {
  "google_info": "Aditya Regulagedda - Quantitative Management Associate ...",
  "profile_link": "https://www.linkedin.com/in/adityareg",
  "name": "Aditya Regulagedda",
  "information": "Quantitative Management Associate at Bank of America | CFA Level II Candidate",
  "location": "New York City Metropolitan Area Contact info",
  "company": "Bank of America Cornell University",
  "connections": "500+ connections",
  "about": "I am Quantitative Associate at Bank of America under the Global Risk Analytics line of business. Currently, I perform Model Execution and Reporting in loss forecasting along with back-testing for the $50B Consumer Vehicle Lending portfolio. I most recently graduated from Cornell University, with an M.Eng in Financial Engineering. Previously, I completed my B.Tech in Electronics and Communication Engineering in May 2016 from National Institute of Technology Tiruchirappalli, a premier technological institute in India.Due to my passion and aptitude in applied mathematics, statistics and algorithmic thinking, my ambition is to pursue a career in Quantitative Finance. My key strengths include statistical modeling and data analysis, simulation and programming, problem solving and number crunching.As a team player, I am highly accommodating, yet competitive and result-oriented. I have worked in different industries with a variety of teams and have always managed to positively influence results and build a strong network in the process. … see more",
  "contact_info": "Aditya’s Profile linkedin.com/in/adityareg"
 },
 {
  "google_info": "Nathan Baker - UW-PNNL Distinguished Faculty Fellow ...",
  "profile_link": "https://www.linkedin.com/in/nathanandrewbaker",
  "name": "Nathan Baker",
  "information": "Laboratory Fellow at Pacific Northwest National Laboratory - PNNL",
  "location": "Richland, Washington, United States Contact info",
  "company": "University of Washington University of California San Diego",
  "connections": "500+ connections",
  "about": "Demonstrated experience in building cross-institutional public-private partnerships; leading diverse scientific organizations; and building multi-disciplinary research teams in applied mathematics, data science, and computational biology.Nathan Baker, PhD is a Laboratory Fellow in the Physical and Computational Sciences Directorate at Pacific Northwest National Laboratory (PNNL) and a UW-PNNL Distinguished Faculty Fellow with the Department of Applied Mathematics at University of Washington. His previous roles at PNNL have included Division Director, Business Sector Manager, Group Manager, and Initiative Lead. He was also a Visiting Professor in the Division of Applied Mathematics at Brown University as well as faculty member at Washington University in St. Louis with roles that included Associate Professor (tenured) of Biochemistry and Molecular Biophysics and Director of the Biophysics PhD program. His research interests include the development of new algorithms in applied mathematics and data science to support applications in chemistry, biology, and other domains. Current research projects include the APBS software suite (http://www.poissonboltzmann.org) which provides computational methods for modeling solvation in biomolecular systems as well as the development of new methods for uncertainty quantification. His research is primarily funded by the US National Institutes of Health and the Department of Energy. Dr. Baker is a member of the Washington State Academy of Sciences, Fellow of the American Association for the Advancement of Science (AAAS), and a former Alfred P. Sloan Research Fellow. … see more",
  "contact_info": "Nathan’s Profile linkedin.com/in/nathanandrewbaker Websites scholar.google.com/citations?user=L9dwKyUAAAAJ (Google Scholar profile) orcid.org/0000-0002-5892-6506 (ORCID profile) nwquantum.com (Northwest Quantum Nexus)"
 },
 {
  "google_info": "Richard Bistrong - Company Owner - Front-Line Anti-Bribery ...",
  "profile_link": "https://www.linkedin.com/in/richardbistrong",
  "name": "Richard Bistrong",
  "information": "FCPA | Ethics | Compliance | Anti-Bribery | Consultant | Keynote Speaker | Author",
  "location": "New York City Metropolitan Area Contact info",
  "company": "Front-Line Anti-Bribery LLC University of Virginia",
  "connections": "500+ connections",
  "about": "As quoted in the Financial Times, The New York Times, Forbes, CNBC, and The Wall Street Journal, I now share my journey (both in-person and virtually) from commerce to corruption to compliance, where I bribed foreign officials, cooperated with international law enforcement & went to prison. Having been a member of the OECD Secretary General's High-Level Advisory Group on Integrity and Anti-Corruption, I share my front line experience for the benefit of those who confront overseas corruption risk in the field & for those compliance professionals tasked with helping them to manage that risk. My clients include brands as diverse as the Volkswagen Group, Microsoft, Kraft-Heinz, Takeda, Airbus, and Mastercard among numerous global Fortune 100 and 500 multinationals. My consultancy, Front-Line Anti-Bribery, LLC is based on my unique experience which includes 10+ years as an International Sales Executive & an extended period of covert cooperation with U.S. & UK law enforcement. I elevate that perspective through my presentations and workshops to bring value to current anti-bribery compliance challenges, speaking to the real-world emotions, temptations & rationalizations that are not always discussed or addressed by compliance and business leaders. Thus, my perspective and experience enhances and amplifies existing ethics and compliance efforts, initiatives, and programs.I ask:Is compliance viewed as inhibiting success by your international business teams? In other words, are compliance, business strategy & incentive compensation properly aligned?Do your front line business teams view compliance as a \"bolt-on\" set of policies, rules & procedures, where they might think that they are in the middle of competing corporate objectives between the pressure to succeed and the pressure to comply?Are your forward based business teams properly trained and sensitized to the real-world identification of red-flags, risks & early warnings of bribery activity & corruption? By sharing my experience & perspective regarding as to how bribery is confronted at the front lines of business, I bring value to current anti-bribery efforts. Hearing my first-hand account, executives & compliance personnel gain a \"clear-eyed\" behavioral view of how bribery is rationalized in the field of overseas business to help mitigate that risk with the goal of keeping everyone successful and safe.For more information, please e-mail me: Richard@richardbistrong.com … see more",
  "contact_info": "Richard’s Profile linkedin.com/in/richardbistrong Website richardbistrong.com (Company Website) Twitter RichardBistrong"
 },
 {
  "google_info": "Poojitha Pamidimukkala - Sr. Software Development Engineer ...",
  "profile_link": "https://www.linkedin.com/in/poojithapamidimukkala",
  "name": "Poojitha Pamidimukkala",
  "information": "Sr. Software Development Engineer at AMD",
  "location": "Santa Clara, California, United States Contact info",
  "company": "AMD Georgia Institute of Technology",
  "connections": "500+ connections",
  "about": "I have 3+ years of experience in 3D Graphics architecture, proficient in C++, architecture modeling, computer architecture and python scripting.",
  "contact_info": "Poojitha’s Profile linkedin.com/in/poojithapamidimukkala"
 },
 {
  "google_info": "Steven Hatch - AWS Senior Manager, Software Development ...",
  "profile_link": "https://www.linkedin.com/in/hatch",
  "name": "Steven Hatch",
  "information": "AWS Senior Manager, Software Development (Amazon FinSpace) at Amazon",
  "location": "New York City Metropolitan Area Contact info",
  "company": "Amazon Rutgers University - Newark",
  "connections": "500+ connections",
  "about": "* Amazon technology leader delivering complex, mission critical services and customer experiences at scale globally* Experience leading teams in software development, machine learning, computer vision, product/program management and operations * Team building (hiring), mentor, career growth and development* Certified Amazon Trainer (Behavioral and Technical Interviewing)* Multiple US Patent holder* Co-founder of two technology start-up companies (prior to Amazon)* Practitioner of Lean and Agile Methodologies … see more",
  "contact_info": "Steven’s Profile linkedin.com/in/hatch Websites hatch.org/ (Blog) hatch.org/blog/index.xml (RSS Feed) audible.com/ (Company Website) Twitter shatch"
 },
 {
  "google_info": "Alwyn K. - Sr. Director Learning Operations - ADP | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/alwynklein",
  "name": "Alwyn K.",
  "information": "Award winning senior Learning and Development leader. A CPTD and CPT who thrives on innovative strategies that enhance learning & improve performance.",
  "location": "New York City Metropolitan Area Contact info",
  "company": "ADP University of Johannesburg",
  "connections": "500+ connections",
  "about": "Award winning, purpose driven senior learning and development leader with over 20 years experience in Learning & Development. Particular success in learning and development strategy and operations, from instructional design, learning delivery, measurement and analytics, to leadership development, human performance improvement and change management. Chief Learning & Development Officer of the Year SA in 2014 - Click on image below for detailsProven ability to start-up, develop and maintain learning and performance teams, manage and coach teams across multiple locations, ensuring high quality learning outcomes with strong strategic alignment and customer needs realization. A regular conference presenter and broad industry volunteer, a believer in being at the leading edge of learning technology and performance thinking. Certified Professional in Learning and Performance (CPLP) with the Association for Talent DevelopmentCertified Performance Technologist (CPT) with the International Society for Performance ImprovementCertified Talent Development Reporting Consultant (C-TDRC) with the Center for Talent Reporting The views expressed on this platform are entirely my own!! … see more",
  "contact_info": "Alwyn’s Profile linkedin.com/in/alwynklein"
 },
 {
  "google_info": "Julie Hollek - Sr. Data Science Manager - Mozilla | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/juliehollek",
  "name": "Julie Hollek",
  "information": "Sr. Data Science Manager at Mozilla -- I'm hiring!",
  "location": "Austin, Texas Metropolitan Area Contact info",
  "company": "Mozilla The University of Texas at Austin",
  "connections": "500+ connections",
  "about": "Award winning, purpose driven senior learning and development leader with over 20 years experience in Learning & Development. Particular success in learning and development strategy and operations, from instructional design, learning delivery, measurement and analytics, to leadership development, human performance improvement and change management. Chief Learning & Development Officer of the Year SA in 2014 - Click on image below for detailsProven ability to start-up, develop and maintain learning and performance teams, manage and coach teams across multiple locations, ensuring high quality learning outcomes with strong strategic alignment and customer needs realization. A regular conference presenter and broad industry volunteer, a believer in being at the leading edge of learning technology and performance thinking. Certified Professional in Learning and Performance (CPLP) with the Association for Talent DevelopmentCertified Performance Technologist (CPT) with the International Society for Performance ImprovementCertified Talent Development Reporting Consultant (C-TDRC) with the Center for Talent Reporting The views expressed on this platform are entirely my own!! … see more",
  "contact_info": "Julie’s Profile linkedin.com/in/juliehollek"
 },
 {
  "google_info": "Gary Travis - CEO/Founder - BloomingBound | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/garyltravis",
  "name": "Gary Travis",
  "information": "I Help Solopreneurs Grow To 30k Engaged Followers In 12 Months Or Less While Building Multiple Income Streams | Founder of BloomingBound.com | Sharer Of Thoughts 💭",
  "location": "Greater Chicago Area Contact info",
  "company": "BloomingBound",
  "connections": "286,953 followers",
  "about": "Award winning, purpose driven senior learning and development leader with over 20 years experience in Learning & Development. Particular success in learning and development strategy and operations, from instructional design, learning delivery, measurement and analytics, to leadership development, human performance improvement and change management. Chief Learning & Development Officer of the Year SA in 2014 - Click on image below for detailsProven ability to start-up, develop and maintain learning and performance teams, manage and coach teams across multiple locations, ensuring high quality learning outcomes with strong strategic alignment and customer needs realization. A regular conference presenter and broad industry volunteer, a believer in being at the leading edge of learning technology and performance thinking. Certified Professional in Learning and Performance (CPLP) with the Association for Talent DevelopmentCertified Performance Technologist (CPT) with the International Society for Performance ImprovementCertified Talent Development Reporting Consultant (C-TDRC) with the Center for Talent Reporting The views expressed on this platform are entirely my own!! … see more",
  "contact_info": "Gary’s Profile linkedin.com/in/garyltravis Website bloomingbound.com (Company Website) Twitter Higher_Ech"
 },
 {
  "google_info": "Steve Kann - Partner - Bridgewater Capital Corporation ...",
  "profile_link": "https://www.linkedin.com/in/stephenkann",
  "name": "Steve Kann",
  "information": "Capital Markets Advisor, Investor, Amazon #1 Best Selling Author",
  "location": "Myrtle Beach, South Carolina, United States Contact info",
  "company": "Bridgewater Capital Corporation George Mason University",
  "connections": "500+ connections",
  "about": "I've been a business development professional and entrepreneur my entire career, primarily in the capital markets. In my experience, business development - making value-creating things happen - is \"connecting dots\" and I happen to have more dots than most. This comes from my having always had a passion for people and networking, which has allowed me to develop a large personal network across multiple industries in the United States and internationally (my contacts are as diverse as Fortune 500 executives, entertainers, private equity and venture capital professionals, European family offices and hundreds of entrepreneurs). To the people who know me it seems that there is no one on the planet I don't know or can't get a hold of in a phone call or two. I've spent 30 years building the relationships that allow me to know the one call to make. This has allowed me to originate and close hundreds of millions of dollars in business personally in my career and set up countless partnerships and joint ventures between products/services/technologies and customers/channel partners/investors. I've been an Executive Producer of an independent feature film and co-founded several companies in this way.Much of my biz dev efforts have occurred in the investment banking/capital markets space, where I've connected company \"dots\" to investor \"dots\" totaling $100 million (including IPOs, PIPEs, private placements, and reverse mergers) and to acquirer \"dots\" for another $200 million. Relationships in this industry and my deep understanding of the microcap stock space has led to stints as an equity analyst, producing annual returns of more than 50% on my picks over 14 years.Whatever you're marketing and whoever you're marketing to, I have the relationships that will accelerate that process. I look forward to providing value to you and your company. Series 79, 62, 63 and 24 licenses.Check out some of my original songs at www.broadjam.com/jamsmackStrengths are in deal origination, understanding and distilling complex transactions, equity analysis. … see more",
  "contact_info": "Steve’s Profile linkedin.com/in/stephenkann Websites microcapmagic.com (Microcap Magic Book) paulsoninvestment.com (Company Website) Twitter SteveKann Birthday August 4"
 },
 {
  "google_info": "Anthony Lye - Executive Vice President and General Manager ...",
  "profile_link": "https://www.linkedin.com/in/anthonylye",
  "name": "Anthony Lye",
  "information": "Executive Vice President & General Manager Public Cloud at NetApp, Member Board of trustees, Bath University",
  "location": "San Mateo, California, United States Contact info",
  "company": "NetApp University of Bath",
  "connections": "6,110 followers 500+ connections",
  "about": "I am an experienced leader, technologist and market disrupter. I have a motivation to effect change and drive growth. Thirty years in development, product management, marketing, sales, general management, board member, investor and CEO within the technology industry both on premise and for the last 17 years in the cloud. I have led small and large companies, divisions and departments, small and large teams both locally and globally through growth, decline, acquisition, transformation and turnaround. I have acquired 22 companies and sold 3. I have lived and worked on 3 continents and ran businesses through good times and bad!Experience managing product releases, new product introductions, capital budgets, IT projects, balance sheets, capital raises and cap tables. Deep industry knowledge and global experience in cloud IaaS, PaaS and SaaS. I have a detailed business and product understanding of CRM, HR, ERP and Supply Chain. Experience as executive sponsor and member of steering committees supporting customer transformations in blue chip customers. Considered a thought leader and visionary in the cloud, mobile and CRM industry. A recipient of numerous industry awards and author of many white papers and articles. Speaker at many industry eventsInvestor and advisory board member in a number of companies and venture funds. … see more",
  "contact_info": "Anthony’s Profile linkedin.com/in/anthonylye Website cloud.netapp.com (Company Website) Twitter ADL Birthday April 22"
 },
 {
  "google_info": "Brad Barbera - Founder and Chief Enabler of Strategic ...",
  "profile_link": "https://www.linkedin.com/in/bradbarbera",
  "name": "Brad Barbera",
  "information": "Helping purpose-driven startups, SMEs, and nonprofits to strategically innovate and drive toward mission fulfillment.",
  "location": "Boise, Idaho, United States Contact info",
  "company": "Pi Innovation LLC The University of Chicago Booth School of Business",
  "connections": "500+ connections",
  "about": "Brad is the author of \"Keep Innovation Simple - Lead with Clarity and Focus in a World of Constant Change,\" soon to be expanded to a second edition with even more Brussels sprouts jokes and footnotes than ever before. In addition to researching and writing, Brad is a speaker, strategic storyboarder, consultant, trainer, and coach for innovative executives. He helps businesses and nonprofits to create and execute effective strategies, systematize their innovation efforts, and nurture a culture of innovation that will drive success in fulfilling their missions. Whether a startup or a multi-national, a commercial business or a nonprofit, Brad can help you find the insights you need to create new products and services, achieve success in the marketplace, and operate as efficiently and effectively as possible. And, hopefully, have a little fun in the process. Or a lot.Find out more at http://www.bradbarbera.com … see more",
  "contact_info": "Brad’s Profile linkedin.com/in/bradbarbera Websites BradBarbera.com (Company Website) gfi.org/ (Nonprofit) Twitter Innov8Liberty"
 },
 {
  "google_info": "Monica Samal, PhD Nanotechnology, MBA Marketing - Senior ...",
  "profile_link": "https://www.linkedin.com/in/drmonicasamal",
  "name": "Monica Samal, PhD Nanotechnology, MBA Marketing",
  "information": "Senior Principal Scientist",
  "location": "Apex, North Carolina, United States Contact info",
  "company": "www.lnindtech.com",
  "connections": "283 connections",
  "about": "Experienced Postdoctoral Researcher/Scientist/Asst. Professor with a demonstrated history of working in the higher education industry. Skilled in Energy Storage, Nanomaterials, Spectroscopy, Nanofabrication, Quantum Dots, and Device Fabrication. Dedicated research professional with a Doctor of Philosophy (PhD) focused on Nanotechnology from Gachon University, South Korea. … see more",
  "contact_info": "Monica’s Profile linkedin.com/in/drmonicasamal"
 },
 {
  "google_info": "Dipak Shah - Founding Board Member Southern California ...",
  "profile_link": "https://www.linkedin.com/in/dipakshah",
  "name": "Dipak Shah",
  "information": "CEO | Entrepreneur | Investor | BoD",
  "location": "Laguna Niguel, California, United States Contact info",
  "company": "Private Directors Association® UC Irvine",
  "connections": "500+ connections",
  "about": "Accomplished, innovative Financial and Technology (FINTECH) SaaS leader with 30+ years of experience in Technology, Engineering, Sales and Investment Banking. Experience leading corporate, entrepreneurial, mid/stage and start-up business ventures. Success developing, leading and growing organizations from inception to IPO or sale that ranged from $40M-$750M. Leads with integrity, collaboration, transparency & performanceFocused on increasing top and bottom line growthBuilding top notch teamsOperational efficiencyCapital efficiencyAbility to raise fundsBuilding products that provide a solution to a problemDelivering high quality products/services for sustainable growthRestructuring companies to position for IPO/sale/growth“Out of box” analytical thinker“Rainmaker” – makes deals happen … see more",
  "contact_info": "Dipak’s Profile linkedin.com/in/dipakshah Twitter Dipakcshah"
 },
 {
  "google_info": "Jin Chang - Northwestern University - Kellogg School of ...",
  "profile_link": "https://www.linkedin.com/in/jinjchang",
  "name": "Jin Chang",
  "information": "Operations Leader | Strategist | Change Driver Through Voice of the Customer",
  "location": "Minneapolis, Minnesota, United States Contact info",
  "company": "Bluestem Brands, Inc. Northwestern University - Kellogg School of Management",
  "connections": "500+ connections",
  "about": "I am a change leader and have been described by one of my HR partners as “the athlete” because of my functional versatility. Throughout my career, I have been asked to take on positions that require me to drive transformative change by creating strategies, redesigning processes, implementing new systems and redesigning organizational structures. The companies I have worked for have valued my results and asked me to repeat them across completely unrelated functions.My diverse background includes leadership roles (Vice President or Director) in the following functions:• Customer Care – Call Center Operations, Workforce Management• Supply Chain – Inventory, Drop Ship Operations, Logistics, Vendor Operations, Quality Assurance• Strategy – Strategic Planning, Trend Analytics, Customer Insights• Finance – Financial Planning & Analysis, Decision Support• Marketing – Marketing Effectiveness, Customer Research, Digital MarketingThis breadth of experience has made me adept at leading cross-functional teams to drive initiatives from start to completion.I am passionate about listening to the customer and the voice of the customer through the employee to create a better customer experience.I am energized by managing large teams, having led teams as large as 2,000 employees, and motivating them through transparency and empathy to achieve their highest potential. … see more",
  "contact_info": "Jin’s Profile linkedin.com/in/jinjchang"
 },
 {
  "google_info": "Shelby Estevez - Account Strategist - Technology, Telecom ...",
  "profile_link": "https://www.linkedin.com/in/shelbyestevez",
  "name": "Shelby Estevez",
  "information": "Account Strategy - Tech, Telecom, Media",
  "location": "New York City Metropolitan Area Contact info",
  "company": "AlphaSense James Madison University",
  "connections": "500+ connections",
  "about": "I am a change leader and have been described by one of my HR partners as “the athlete” because of my functional versatility. Throughout my career, I have been asked to take on positions that require me to drive transformative change by creating strategies, redesigning processes, implementing new systems and redesigning organizational structures. The companies I have worked for have valued my results and asked me to repeat them across completely unrelated functions.My diverse background includes leadership roles (Vice President or Director) in the following functions:• Customer Care – Call Center Operations, Workforce Management• Supply Chain – Inventory, Drop Ship Operations, Logistics, Vendor Operations, Quality Assurance• Strategy – Strategic Planning, Trend Analytics, Customer Insights• Finance – Financial Planning & Analysis, Decision Support• Marketing – Marketing Effectiveness, Customer Research, Digital MarketingThis breadth of experience has made me adept at leading cross-functional teams to drive initiatives from start to completion.I am passionate about listening to the customer and the voice of the customer through the employee to create a better customer experience.I am energized by managing large teams, having led teams as large as 2,000 employees, and motivating them through transparency and empathy to achieve their highest potential. … see more",
  "contact_info": "Shelby’s Profile linkedin.com/in/shelbyestevez"
 },
 {
  "google_info": "Dr. Heather Ivy, DO - Resident Physician on the Council of ...",
  "profile_link": "https://www.linkedin.com/in/heatherivydo",
  "name": "Dr. Heather Ivy, DO",
  "information": "Resident Physician on the Council of Communication at American Academy of Dermatology",
  "location": "Roswell, Georgia, United States Contact info",
  "company": "American Academy of Dermatology Oklahoma State University Center for Health Sciences",
  "connections": "384 connections",
  "about": "Dr. Heather Ivy is a resident physician, specializing in Dermatology. She also has her Masters in Physical Therapy. Dermatologists specialize in the medical and surgical aspects of diseases of the skin, hair, and nails. She is passionate about leadership development and patient advocacy.",
  "contact_info": "Dr. Heather’s Profile linkedin.com/in/heatherivydo"
 }
]