[
 {
  "profile_link": "https://www.linkedin.com/in/nurul-wahyu-abdul-rahman-a1b70792?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABOuqPcBQCOqBRonetC-r3lqvyhEsTulcaY",
  "name": "Nurul Wahyu Abdul Rahman",
  "information": "OTT Product Development",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro",
  "connections": "150 connections",
  "about": "Passionate in the broadcasting industry and experienced in New Media, particularly with video. I love consuming content, and am knowledgeable about general entertainment. Good with details and adept at creating management-level reports. I’m a quick, flexible learner and can adapt easily to changes. … see more",
  "contact_info": "Nurul Wahyu’s Profile linkedin.com/in/nurul-wahyu-abdul-rahman-a1b70792 Birthday January 4"
 },
 {
  "profile_link": "https://www.linkedin.com/in/valerie-lim-47221b7a?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABDDFdYB2T9sBL-G3ZIj9fG29qO5lgxZM9s",
  "name": "Valerie Lim",
  "information": "AVP, OTT Product Development at Astro",
  "location": "Malaysia Contact info",
  "company": "Astro Monash University Malaysia",
  "connections": "259 connections",
  "about": "Valerie is a management executive with working experience in media broadcasting, telecommunications and oil and gas industries. Strong general management qualification in business value proposition, project development, budgeting/finance, change management, process improvement, target operating model and solution road mapping. She is also PMP and Scrum Master certified with ability to learn and adapt to dynamic environment in a short period of time. Fluent in Malay and proficient in English. … see more",
  "contact_info": "Valerie’s Profile linkedin.com/in/valerie-lim-47221b7a"
 },
 {
  "profile_link": "https://www.linkedin.com/in/amanda-loong?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAextYIB4Ii6HQ6ijfsqhItrPM3cxOl2H5U",
  "name": "Amanda Loong",
  "information": "Product Development Specialist at Maxis",
  "location": "Kaiang, Selangor, Malaysia Contact info",
  "company": "Maxis Asia Pacific Institute of Information Technology",
  "connections": "379 connections",
  "about": "Comes from IT background, have over 10 years of experience in IT, product development, business process and project management with proven track record of successfully managing small to large projects from start to finish. Skilled in cultivating positive relationships with all levels of management; particularly adept at communicating with clarity and diplomacy to individuals from diverse cultural and organizational backgrounds. Specialties:Possess strong background in telco billing system, product development lifecycle and retail management's IT processes & infrastructure. Knowledgeable and possess technical skill in database language and programming (SQL, PL/SQL), UNIX Shell Scripting, System Design tools such as Rational Rose (UML) and Visio, ITIL language and System Development Life cycle.Award: Awarded with CEO award on July 2017 in recognition for my contribution in webe digital. … see more",
  "contact_info": "Amanda’s Profile linkedin.com/in/amanda-loong Birthday December 10"
 },
 {
  "profile_link": "https://www.linkedin.com/in/nicoleyean?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAB69QLcBwRPS9ZR92wYRB9ZyK6ofNDcYC8c",
  "name": "Nicole Yean",
  "information": "Business Development Associate - OTT/Media at Maxis",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Maxis Monash University Malaysia",
  "connections": "500+ connections",
  "about": "I'm curious and passionate about how people think and behave in all things marketing. Constantly on my feet and always looking for opportunities to grow.",
  "contact_info": "Nicole’s Profile linkedin.com/in/nicoleyean"
 },
 {
  "profile_link": "https://www.linkedin.com/in/benmin?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAADCqPIBGMGGcPbzFfKxalXwuhgCN7L2vM4",
  "name": "Benjamin B.",
  "information": "Head - Employee Digital Experience",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "PETRONAS Digital Sdn Bhd Universiti Teknologi Malaysia",
  "connections": "500+ connections",
  "about": "Exploring opportunities to expand my career growth and encountering new challenges with esteem organizations. More than 16 years of working experience within Telecommunication, Oil and Gas and Information Technology organizations. Dealing with technology and Business to Consumer (B2C) applications heavily that requires high understanding of both worlds to meet a common goal. Have held multiple leadership, technical and coordination roles across my career. As a digital experience designer and product owner; delivering the best experience and journey for the users are the main priorities; serving as the voice of the user in the design process while ensuring the objective of the business is kept and met. … see more",
  "contact_info": "Benjamin’s Profile linkedin.com/in/benmin Website facebook.com/akubeejays (Personal Website) Birthday June 30"
 },
 {
  "profile_link": "https://www.linkedin.com/in/andrew-smith-5b862b1a4?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAC_Kd5wBRtb_MzqA_o9D5eSmIYhjeguGTGg",
  "name": "Andrew Smith",
  "information": "Technical Director at eCyber Cloud",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "eCyber Cloud Boston University",
  "connections": "500+ connections",
  "about": "More than 20 years of experience in IT, Enterprise System Architecture and Regional Project Implementation. Technical Director experts in Financial, Payment, OTT/IPTV, Digital Media domains. Experience in Cryptocurrency Exchange & Blockchain Technology. We are a team of over 50 professionals working around the globe crafting Live/VOD delivery solutions to help people like you, your organization and even your countries, in a secure, efficient and decentralized way.Specialising in large-scale IT and AV implementations, eCyberCloud is customer-led solutions provider. We combine highly agile process management and delivery, technical expertise and a consultative customer focussed approach to deliver complex business solutions to our customers. Differentiating ourselves through a focus on customer collaboration and providing innovation through our leading technology partners, in-house design, project management and decades of combined expert knowledge.As the Technical Director, my mission is to work together with the Management Team and lead the technical implementation of eCyberCloud’s vision.Responsibilities:- Serve as Key Technical Guru on the Group Strategic Management Board.- Sourcing, hiring and training of eCyberCloud Global Development Team.- Chief Technical Architect of eCyberCloud's system and solutions.- Manage technical partner relationships and development projects.- Serve as key trouble-shooter for technical challenges across the platform.- Architect and Implement Public/Private Chain Enterprise Solutions … see more",
  "contact_info": "Andrew’s Profile linkedin.com/in/andrew-smith-5b862b1a4 Birthday December 15"
 },
 {
  "profile_link": "https://www.linkedin.com/in/mohammad-ali-5518339?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAG5ek0BqW0oMnUfRBq8c9QC6A86D4ZlyDU",
  "name": "Mohammad Ali",
  "information": "SAVP, OTT & Media Platform Lead at Astro",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro Lahore University of Management Sciences",
  "connections": "500+ connections",
  "about": "Experience in mentoring and managing cross functional teams that requires continuous evaluation and improvements. With over a decade of experience in software industry, I have in depth knowledge of a lot of tools and technologies, some of them are as follows:Project Management tools such as Jira and Bitrix24Cloud system architecture based on Amazon Cloud Services (AWS), Microsoft Azure and Google Cloud Services (GCS)Video analysis, transncoding, packaging and formatting tools FFMPEG, Bento4VOD encoding platforms Bitmovin and HybrikConfiguration and setup live Stream Encoding in HLS or DASH with Elemental and WowzaConfiguration and setup live stream Elemental Delta originsAkamair, EdgeCast, CloudFront, CloudFlare and StackPath CDNsGitlab and code managementREST APIs and micro-service architecturePHP frameworks such as Codeignitor, Zend, Symphony and LaravelNodeJS frameworks MEAN/MERN and MEVNPython frameworks .NET Technologies C#, WPF, WCFFrontend technologies such as Angular and ReactJSMessage and work queues like BeanstalkREDIS and MemcacheMYSQL, PostgreSQL and MSSQLFFMPEG, Bento4 and HandbrakeAWS, Dolbey Hybrik and bitmovin for cloud encodingAds Server SpotX and Google AdsExpertise in Server Side Ads Insertion (SSAI) as well As Client Side Ads Insertion (CSAI)Elemental and Wowza for live encoding, origin and catchupStudio grade content protection with DRM … see more",
  "contact_info": "Mohammad’s Profile linkedin.com/in/mohammad-ali-5518339 Website tv2u.com (Company Website) Birthday April 8"
 },
 {
  "profile_link": "https://www.linkedin.com/in/sanmeshthakur?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAFTAJIBJddAMh8UMlNoXCMQXHy__Cv0N4I",
  "name": "Sanmesh Thakur",
  "information": "OTT | VOD | Partnerships | Telecom | Monetization | Digital",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Viu Symbiosis Institute Of Business Management",
  "connections": "500+ connections",
  "about": "Experienced Professional of Business Development with a demonstrated history of working in the internet industry. Skilled in Business Development, Growth Partnerships, Content Monetization, VOD & OTT space, Content & Media Distribution, Mobile Payment integrations, Emerging Markets Business and Value-Added Services (VAS). Strong sales professional with a MBA in Marketing from Symbiosis Institute Of Business Management. … see more",
  "contact_info": "Sanmesh’s Profile linkedin.com/in/sanmeshthakur"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ashutosh-s-482a7714?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAMBYOIBPGpM-jtcUepCXPqdPy_8fuuJ60M",
  "name": "Ashutosh S.",
  "information": "Tech Manager, Solution Architect,Product Development, Integration & SA -Cloud- AWS, Azure, Telecom, IT, OTT, IPTV,STB, CDN",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro",
  "connections": "500+ connections",
  "about": "15+ years of experience in Telecom, Software Development & Service Delivery, End to End Product Deployment, Project Management, Technical Pre Sales .Worked with leading telcos & media companies- Ericsson, Huawei, Samsung, Nvidia, Reliance Jio, Airtel, Proximus Belgium. Leaded Europe, LA, APAC regions for Cloud PRODUCT Line for Telco & Media Domain Strong understanding of various Cloud software solution stacks (AWS, Azure) including compute, orchestration, infrastructure management, as well as storage and networking solutionsProven hands-on knowledge of Cloud computing, Cloud deployment & Cloud migration AWS Cloud Certified- Architect SAA C02AWS Cloud Certified- PractitionerAZ-900: Microsoft Azure Fundamentals DP-900 : Microsoft Azure Data FundamentalsExpertise – In AWS services such as Amazon Elastic Compute Cloud (EC2), Amazon Simple Storage Service (S3), Amazon Simple DB/RDS databases, AWS Identity and Access Management (IAM), etc.Managing technical engagements with partners and customers, this includes participating in on-site visits with prospective customers, understanding customer requirements, and proposing and delivering packaged offerings, and delivering custom solution engagements.Rich experience in AWS cloud, Azure cloud, End-to-End Platform deployment, LTE-eMBMS, OTT ,IPTV, IOT ,DTH,STB,CDN, integration ,Deployment coordination, UAT,Testing and operations.-Pioneered at managing large and complex projects or multiple components of a large project involving more than one company’s product; efficiently communicated with internal / external clients to determine specific requirements and expectations.-Exposure to Product Development Lifecycle, Software Development Lifecycle, coordinating with cross-functional ,cross-continent teams ,Agile and Scrum development practices.-Preparation of technical documentation ,RFP response, solution Outline and Estimation Plans-Exp in Requirement discussion & finalization with business & technical teams-Exp in Integration of various VAS applications /Platform products-Exp in Vendor management ,Resource planning , Risk Mng and Project coordination-Exp in E2E project delivery- Development ,Integration ,Deployment coordination ,UAT & Operations in vertical of Telecom and Multimedia : LTE, eMBMS ,Big Data Analytics, Google Analytics , AWS , Devops, Recommendation solution , Gaming, GPU, Android , IPTV,OTT & CDN ,STB , Hotel TV , IOT,CCTV,Smart City … see more",
  "contact_info": "Ashutosh’s Profile linkedin.com/in/ashutosh-s-482a7714 Birthday November 18"
 },
 {
  "profile_link": "https://www.linkedin.com/in/naeemark?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAJiX6sBoVlEMFddNh_g1s69vnCkwoMjRTM",
  "name": "Naeem Arshad",
  "information": "Senior Software Engineer at AirAsia",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "AirAsia University of the Punjab",
  "connections": "500+ connections",
  "about": "A versatile and Innovative IT professional with a commitment offering vast experience leveraging software engineering and DevOps methodologies to deliver highly effective and creative solutions to business and technology challenges. Highly organised with strong capacity to prioritise workload, delegate deliverable, and steer project completion within established deadlines.Specialties: System Design, NodeJS, Java, Python, AWS, GCP … see more",
  "contact_info": "Naeem’s Profile linkedin.com/in/naeemark Twitter naeemarkk"
 },
 {
  "profile_link": "https://www.linkedin.com/in/anshuman78?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAEFaaoBdiuOmpCxIWFQP4pYEnS9r6muCZg",
  "name": "Anshuman Singh",
  "information": "SAVP, OTT Product Delivery at Astro",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro Universiti Sains Malaysia",
  "connections": "500+ connections",
  "about": "* Over 19 years in media and entertainment segment,* Global exposure, worked in Malaysia, Australia, France, USA, UK, Japan,* Engineering management, Product Management, Technical Presales,* End to end Cloud TV & Media Architecture, Consulting, Customer Engagements & Systems Integration,* Technical/solution architecture of large scale TV/ OTT deployment/transformation,* Driving Content & Media Strategy inside-out, Marketing and Go to Market, E2E Delivery,* Enterprise Architect specializing in large scale Video Infrastructure,* Management and Business Transformation consultant with CxO level engagements,* Setting up a new Sales/Presales Practice/Engineering/Operations/GTM Strategy in Startup Mode,* 4G, 5G applications, LTE Broadcast,* Driving Strategic Partnerships, M&A evaluations, Joint GTM/Teaming agreements, * Consultative Selling, Engagement/Account Management, * TV as a service model, Cloud OTT TV development and Content delivery strategies,* Management of diverse mid & large size engineering and support teams,* Certified Business Sustainability Assessor, … see more",
  "contact_info": "Anshuman’s Profile linkedin.com/in/anshuman78 Birthday June 5"
 },
 {
  "profile_link": "https://www.linkedin.com/in/chinkokng?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAKWh4gBL8pZ2hsHYkGOnuiSE333Yzyb8yE",
  "name": "Chin Kok Ng",
  "information": "Technical | API | Product Development | Solution Architect",
  "location": "Subang Jaya, Selangor, Malaysia Contact info",
  "company": "AIA Malaysia Universiti Malaya",
  "connections": "478 connections",
  "about": "With vast experience, knowledge and technical skills in ICT Telecommunication industry. Assigned to different positions and responsibilities from Software Development, Solution Architect, Project Management, Product Technical Research and Development. Actively doing research and development for big data implementation such as Apache Flink, Hadoop, Hive, Sqoop etc. Enthusiastic into Machine Learning, Agile methodologiesSpecialties:Technical Product Development, Solution Architect, MySQL, MSSQL, Big Data, IoT, webRTC, OTT VoIP Mobile Development (Native and Hybrid Angular, Ionic, HTML5), API development HTTP Protocol (JSON, SOAP, XML), RESTful API, … see more",
  "contact_info": "Chin Kok’s Profile linkedin.com/in/chinkokng Website yes.my (Company Website) Twitter Chinkokng"
 },
 {
  "profile_link": "https://www.linkedin.com/in/vivek-karande-83359422?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAS2lKcBtQZ4TBnY9BsKPKP4fStHKgNHdQ4",
  "name": "Vivek Karande",
  "information": "Senior Full Stack Developer [vtkarande@gmail.com,601136092610]",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro Savitribai Phule Pune University",
  "connections": "500+ connections",
  "about": "Currently working as Senior Software Developer at Astro, Kuala Lumpur.Astro Malaysia Holdings Berhad (Astro) is Malaysia’s leading content and consumer company in the TV, OTT, radio, digital, and commerce space with growing ASEAN presence. The company serves 23 million individuals in 5.7 million households, or 76% of Malaysian households, who are watching Astro content on all screens and on-demand, be it TV, laptop, tablet, and phone.My role is to work as a developer on Astro SMS Gateway.Skills:• Languages - Dot Net Technologies Stack.• Frameworks - Windows, Microsoft Azure & .NET Framework class library.• Web Technologies - Web Services ( Rest and SOAP)• Web Designing Languages - HTML5, JavaScript, Jquery, & Angular JS.• Revision control systems – Perforce, GitHub• Tools - JetBrains dotpeek (.NET Decompiler and Assembly Browser)• Databases - MS SQL, My Sql, Oracle, DaynamoDB, & Mariadb.• Concepts - Data Structures and Algorithms, OOP, Multithreading, Operating System, Agile, Scrum.• Operating systems - Windows• Other Technologies - XSLT, JSON, XML.• Domain Knowledge - Telecom, Identity Management , Human Resource System. … see more",
  "contact_info": "Vivek’s Profile linkedin.com/in/vivek-karande-83359422"
 },
 {
  "profile_link": "https://www.linkedin.com/in/emilyna-ramli?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAGcfasBwD-ZyBR5Ra2IEJ6mMkyItcMu-4o",
  "name": "Emilyna Ramli",
  "information": "Project Manager | Go-To-Market | Product Development | Customer Experience",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Digital Nasional Berhad MSc. in Information Management",
  "connections": "345 connections",
  "about": "Expert professional in business development, planning and executing business strategies, developing new market channels and building strong relationships with strategic business owners, business partners and industry leaders. Vast experience in product development, product marketing and branding. Superb understanding of business sense and strategies. High-tech background, with telecommunications and digital platform in relation to business and customer’s needs. … see more",
  "contact_info": "Emilyna’s Profile linkedin.com/in/emilyna-ramli"
 },
 {
  "profile_link": "https://www.linkedin.com/in/mohd-fadzley-hud-abd-halim-18827341?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAjCdDgBUm1AgmF3uskN_hOm7NmQTJmos5M",
  "name": "Mohd Fadzley Hud Abd Halim",
  "information": "Android Developer at REV Media Group",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "REV Media Group L&G Twintech Institute of Technology",
  "connections": "111 connections",
  "about": "Experienced Mobile Application Developer. Skilled in Android and iOS Development. Coming soon - Flutter. Currently involved in OTT service mobile application development. Have developed and published multiple Fintech applications and etc.",
  "contact_info": "Mohd Fadzley Hud’s Profile linkedin.com/in/mohd-fadzley-hud-abd-halim-18827341 Birthday July 5"
 },
 {
  "profile_link": "https://www.linkedin.com/in/khedir-yaakub?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAY0ntYBOV7eXHgSmTnTkdhTuKukOu_sXdY",
  "name": "Khedir Yaakub",
  "information": "Regional Head Marketing & Business Development at Forest Interactive",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Forest Interactive British Malaysian Institute (UniKL)",
  "connections": "500+ connections",
  "about": "I'm diverse and well-versed in international business development with over 18 years of experience in mobile Industry covering South East Asia and worldwide. I am well acquainted with local mobile operators and content providers and have experience in managing and deploying successful mobile content of services covering Malaysia, Thailand, Iraq, Egypt, Greece, Kenya, and South Africa. … see more",
  "contact_info": "Khedir’s Profile linkedin.com/in/khedir-yaakub Birthday July 28"
 },
 {
  "profile_link": "https://www.linkedin.com/in/michael-min-san-liew-8409875?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAEIt_ABDip9sMCLkesdAG5DCI30X_Hwwf4",
  "name": "Michael Min San Liew",
  "information": "Product Development Director at webe digital",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "webe digital Western Michigan University",
  "connections": "500+ connections",
  "about": " Pioneer in the digitalization of telco business which covers the customer journey areas of IJOIN, IUSE, IENGAGE, and IFINANCE for a newly start up digital operator in Malaysia. Responsible to rollout Postpaid, SME, and Prepaid business in webe digital. Acquired 400,000 postpaid subscribers after the nine months of commercial launch and registered the highest gross activation for postpaid in the industry. Launched SME business in the shortest timeframe of three months. Developing the UniFi OTT mobile app for TM WiFi service, digital wallet, and mobile products and services.  Pioneer in the setting up of the prepaid business in Ooredoo in Myanmar. The first telco to launch data plan and OTT services in Myanmar.  Liaise in Mandarin language with Chinese IT consultants, developers, and programmers on the mobile product requirement gathering and user acceptance troubleshooting and testing with both Huawei (for Ooredoo Myanmar project) and Whale Cloud Technology Co Ltd (formerly known as ZTE) for webe digital Malaysian project. … see more",
  "contact_info": "Michael Min San’s Profile linkedin.com/in/michael-min-san-liew-8409875"
 },
 {
  "profile_link": "https://www.linkedin.com/in/rajat-sharma-2bb49a30?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAZ6ji8BZrGBAM4hx75r9vGgfAbxWQDzrTM",
  "name": "Rajat Sharma",
  "information": "Senior Software Engineer|| JAVA|| Spring Boot || AWS ||Cloud||Microservices ||Rest ||Dev Ops|| SQL, Python|Solutioning.",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Amdocs Shaheed Bhagat Singh College",
  "connections": "500+ connections",
  "about": "Currently Working in Amdocs as senior software engineer for one of the Pay-Tv Client in Malaysia.Domain Knowledge:- Order Management, Product Catalog, Fulfillment, Self Service Portal, CRM. Experiencesworked as a Senior Java developer cum Scrum master for Enterprise Application in Telecom industry.worked as a Java developer for Consumer Application in Telecom industry. worked as a Java developer for Dealer Sales Portal in Telecom industry. worked as a Full Stack developer for Content Management Portal in Telecom industry. Skills:• Languages - Java and Java based Technologies Stack.• Frameworks - Spring, Spring-boot, Hibernate.• Backend Stack- Elastic Search, Kafka and Micro-services.• Web Technologies - Web Services ( Rest and SOAP)• Cloud - Knowledge in AWS Solution Architect.• IDEs – Eclipse.• Revision control systems – Perforce, SVN.• Build and Test tools - Maven.• Databases - MySql, Oracle , Elastic Search for Searching.• Concepts - Data Structures and Algorithms, OOP, Multithreading, Operating System, Agile, Scrum.• Operating systems - Windows, Linux.• Other Technologies - JSON, XML.• Domain Knowledge - Telecom (Mobile, TV, Broadband), Digital Self Service Portal, Order Management, CRM,OTT Platform … see more",
  "contact_info": "Rajat’s Profile linkedin.com/in/rajat-sharma-2bb49a30"
 },
 {
  "profile_link": "https://www.linkedin.com/in/anna-soon-51b54618?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAOjq2cBzIEcTPvAIu0o3EnoI6Sx-nsAa80",
  "name": "Anna Soon",
  "information": "Chief Content Officer, International Business / Consultant at TRIO OTT",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Beijing Film Academy",
  "connections": "500+ connections",
  "about": "-Content Specialist for all media platforms (Free To Airs, Pay TV, IPTV, OTT, Mobile).-Excel in building and managing new media platforms in any given territories or markets.-Excellent industry global networking, strong language ability and sharp in identifying winning content ideas, strategies and win-win partnership. -Strong negotiator, pleasant, creative with down-to-earth approach. … see more",
  "contact_info": "Anna’s Profile linkedin.com/in/anna-soon-51b54618"
 },
 {
  "profile_link": "https://www.linkedin.com/in/liaqatfayyaz?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAGLINwBOm667vhJY6h5640SppNv9z3W-UY",
  "name": "Liaqat Fayyaz",
  "information": "Chief Technology Officer (ASX:TV2) | Entrepreneur | OTT Streaming | Solution Architect | Low Latency Streaming | Sports",
  "location": "Perth, Western Australia, Australia Contact info",
  "company": "tv2u International University of Wales Trinity Saint David",
  "connections": "500+ connections",
  "about": "An engineer at heart and a people leader by default, for the last two decades, I've solved many real-life customer problems. Eight years of those two decades, I've spent as a CTO leading technology and product teams. I've co-founded two tech companies and have taken various ideas from inception to successful market delivery. Multiple times, I've established technical strategy and roadmaps for organisations of various sizes and have been involved in the scale-up and delivery of multimillion dollars complex solutions. These products range from Digital Signage Systems to Embedded applications, Microcontrollers to decoders, OTT (over-the-top) Platforms to Complex Mobile Apps, to name a few. Well versed with Agile and traditional methods of delivery, I've improved efficiency and quality of my teams' delivery resulting in substantial ROI increases. I'm passionate about high performing teams, great organisational culture, new ways of working, and efficient and sustainable delivery. … see more",
  "contact_info": "Liaqat’s Profile linkedin.com/in/liaqatfayyaz Website tv2u.com (Company Website) Birthday December 31"
 },
 {
  "profile_link": "https://www.linkedin.com/in/mosoahmed?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAIs4NYBYxJdhx9Zecjtnsbs0H8ddOG1ExQ",
  "name": "Mosaad Ahmed",
  "information": "Full Stack Developer, Live Video Streaming & VOD Expert",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Beyond Apps Group Bachelor’s degree in English arts & literature, Tanta University",
  "connections": "500+ connections",
  "about": "I am a software developer with 8+ years of experience in software development solutions and OTT live video streamingI have excellent experience in frontend and backend development using many different techniques, tools, frameworks, mobile, And SEO friendly web solutions.I am an expert in all application life cycle development using OOP and MVC to create large scale applications with localization and internationalization.I use OOP, OOD, SOLID, and TDD to get high-quality projects.I have 5 years of experience working on OTT live streaming, VOD, and video advertising software.I always up to date with new technology so I can create perfect, fast, easy, and stable solutions for my clients in e-commerce, news portals, videos، education, and other fields.General Skills: • An agile methodology using the scrum framework. • Git, SVN, NPM, Composer, Nuget, brew and Rest API. • Windows, Mac, and Linux platforms and servers. • Server administration, CloudFlare, Apache, Nginx, IIS, Varnish, and ssh. • Intermediate Knowledge of Java, NoSQL Databases, ruby, and python. • Adobe PS, VStudio, SublimeText, Eclipse, Atom, PHPStorm, and Netbeans IDE. • AWS Cloud.Frontend Skills: • HTML5, XML, CSS, JavaScript, Ajax, JSON, JQuery and Bootstrap Framework. • Angularjs, Emberjs, Bower, Gulp, Less, typescript, And Saas. • intermediate knowledge of NodeJS, ReactJs and React Native.Backend Skills: • Asp.net MVC, C#, Web API, and MS SQL Server. • PHP, MySQL Database. • Laravel, Codeigniter, and CakePHP web frameworks. • Java Spring and Android. • Basics of Python and Ruby • Basics of Swift and Objective-C language for iOSOTT Media Skills: • Live Streaming using Wowza and NGINX. • working with FFMPEG library. • HTML5, VideosJs, JW and Flow player, etc... • OpenSDK, GoCoder, and OBS. • very Good Experience with WebRTC, RTMP, HLS, DASH, RTSP, MP4, H.264, AAC, etc..Future Skills working on it: • C++, .Net Core, Big Data, and ML. … see more",
  "contact_info": "Mosaad’s Profile linkedin.com/in/mosoahmed Website jorri.net (Personal Website) Twitter mosoahmed Birthday November 11"
 },
 {
  "profile_link": "https://www.linkedin.com/in/logendrankrishnan?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAADLGUMBr6LNTxAq0jU5EOuRtEyVZfnErOs",
  "name": "Logendran Krishnan",
  "information": "Business Development Professional",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Apigate University of Ballarat",
  "connections": "500+ connections",
  "about": "🔹 I consider myself as an energetic and results-oriented 18 years+ experience in developing businesses across South East Asia through effective communication & strategic plans.For the past 15+ years of my employment, I have received :✔️Internal fast track promotions for 4 times; i.e Assistant General Manager (2011-2012) ⇇ Content Manager (2010-2011) ⇇ Content Management Executive (2003-2011) ⇇ Senior Support Operator (2002-2003)My main contributions and tasks I have undertaken as below--- for HUAWEI Technologies (MALAYSIA), SAM Media Sdn. Bhd, Apigate Sdn. Bhd & M3 Technologies (Asia) Berhad🔸Introduced – mobile payment ecosystem for OTT mobile app with Axiata Opcos🔸Launched – mobile games i.e from Tencent, Netease & Garena with Axiata Opcos by collaborating with diverse working teams.🔸Influenced – a well maintained business relationships with mobile carriers across Asia through strategic business planning, risk management and contingency planning.🔸Modernized & directed – Carrier Billing (DOB/DCB) solution integration and deployment with operators in the region.Main Skills & Expertise includes :◾Business Development ◾Business Management◾Team Management ◾Social Media Marketing Management◾Public Relations◾Creative Problem-Solving … see more",
  "contact_info": "Logendran’s Profile linkedin.com/in/logendrankrishnan"
 },
 {
  "profile_link": "https://www.linkedin.com/in/shamberong?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABLc7C8Bg0FjQZNOCVugszZzOM_ljeKfneY",
  "name": "Muhamed Zulkhairilishamuddin",
  "information": "Experienced & Technologist in HBBTV, OTT, Smart TV, Hybrid TV & Digital TV",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro Multimedia University",
  "connections": "500+ connections",
  "about": "Wide experience in developing successful platform/applications specialized for a New TV Technology. Strong understanding of operations for complex DTV infrastructure (VoD , HbbTV , OTT, MPEG / DVB). Experienced in manage, develop & deploy a New TV Technology such as apps for DIGITAL TV, Smart TV platform, Connected TV & Hybrid Broadcast Broadband TV (HbbTV).Previously heavily involved in Digital TV transformation project at Media Prima Berhad. Lead core development, testing, deployment of Hybrid Broadcast Broadband TV (HbbTV). Develop features in HbbTV engines as the standards evolve. Make sure these interactive TV engines suit to all range of digital TV platforms and architectures. Strong relationships with TV manufacturer for digital TV ecosystem testing through internal and external QA testing.Proficient SEO Strategist, SEO/SEM, Developers and ex-Head of Design with 11+ years of Web Development/Marketing (SEO) and computer business experience. Search Engine Optimization (SEO), Web Measurements/Analytics/Quality Assurance and Google Api are recent technologies used. Dynamic hands-on SEO strategist who designs and implements successful online marketing programs that provide valuable solution that maximize program profits, ranking, and increases consumer traffic driving business growth, for companies in the Media Prima Company (TV3,NTV7,8TV,TV9) AND Malaysia Premier Tonton.com.my site.Currently with Astro as Assistant Vice President, OTT Principal Engineer. Now handling new project for Astro, TVaaS OTT Satellite Hotspots for CE. Previously involved with multinational & multiplatform OTT product across Asia such as TRIBE (Indonesia, Philippines & Thailand), Astro GO, Njoi Now, and Astro Go for SmartTV. End to end responsibility for managing Astro Local & International OTT operation, support & projects.I'm welcome for any new opportunities. If you require any further information or any assistance, please email me at shamberong@gmail.com. Lets Connect! … see more",
  "contact_info": "Muhamed’s Profile linkedin.com/in/shamberong Twitter shamberong Birthday June 12"
 },
 {
  "profile_link": "https://www.linkedin.com/in/mmuhamadamirzaidi?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAACQh2ckBG4SaSAt7C9p7qmJ1zf49LvHFNdA",
  "name": "Muhamad Amir Bin Zaidi",
  "information": "Platform Designer - UX at Ace Resource Advisory Services Sdn Bhd",
  "location": "Dengkil, Selangor, Malaysia Contact info",
  "company": "Universiti Teknologi MARA",
  "connections": "500+ connections",
  "about": "I am a forward-thinking designer, highly skilled in planning and implement new system designs, optimize existing user interface design to meet business goals and objectives.Involved in system development for over-the-top (OTT) media service named Gimee and develop an attendance system using the QR Code to manage daily employee attendance last year. Recently finished the Core App for Cooperative system design.I can work independently without oversee, or lead a team when the need arises, very passionate about designing, and loves to explore new things! Plus, I have a strong eye for detail and the tenacity to never quit on something until it is perfect.Let's get in touch! … see more",
  "contact_info": "Muhamad Amir’s Profile linkedin.com/in/mmuhamadamirzaidi Website behance.net/mmuhamadamirzaidi (Portfolio) Birthday October 22"
 },
 {
  "profile_link": "https://www.linkedin.com/in/sahil-chaddha-734143b5?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABhnOFgBo_E4v7eeFUY0JReEMPiK4nsPVsE",
  "name": "Sahil Chaddha",
  "information": "Head, Software Engineering at PETRONAS",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "PETRONAS Digital Sdn Bhd Amity University Noida",
  "connections": "500+ connections",
  "about": "OTT Consultant during day.IOT Developer at night.~~~ Github : https://github.com/sahilchaddha~~~ NPM : https://www.npmjs.com/~sahilchaddha … see more",
  "contact_info": "Sahil’s Profile linkedin.com/in/sahil-chaddha-734143b5 Website sahilchaddha.com (Personal Website)"
 },
 {
  "profile_link": "https://www.linkedin.com/in/manjula-fernando-97993a9?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAG9d-0BaQwkgLagjJvdWa1SAsdHrV2IUC0",
  "name": "Manjula Fernando",
  "information": "Consultant- Digital TV & OTT | Head-Int'l Data & Networks,Managed Services,International Business at Axiata Group Berhad",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Axiata University of Moratuwa",
  "connections": "500+ connections",
  "about": "Highly versatile Telecommunication, IT and Business consulting professional having a 14+ years of experience spanning across full sphere of International Telecommunication Business including ISP, CDN, Data Services, Transmission Core, IPX, OTT/Cloud/Big Data Services, Enterprise Services and Wholesale with a proven track record in delivering value to the organization and also to customers, who also possess a well-balanced techno-commercial academic and strong consulting professional background with hands-on experience throughout the value chain of the technology business. … see more",
  "contact_info": "Manjula’s Profile linkedin.com/in/manjula-fernando-97993a9"
 },
 {
  "profile_link": "https://www.linkedin.com/in/knut-haug-72a7b5?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAeNNIBRJRw1IPgdlSgTrDNZMa9IutgF0A",
  "name": "Knut Haug",
  "information": "Business Development Manager, APJ",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Nokia Krigsskolen (KS)",
  "connections": "500+ connections",
  "about": "I am a seasoned international sales and business development professional within software solutions and products. My experience includes work in both market leading companies and start-ups, where I have successfully managed everything from market entries and retail strategies to SME-, large enterprise-, telco- and government sales. Consistently meeting or exceeding targets.The solutions I have covered span across IT-security, analytics and telco BSS/OSS, including Big Data solutions with advanced analytics, machine learning and AI.I enjoy being a leader of people and processes and try to bring enthusiasm, energy and fun to the table. I ensure to make complex concepts understandable to anyone, and articulate compelling value to the customers.The last 13 years I have been covering the APAC Telco market in various roles based out of Kuala Lumpur, Malaysia. I am comfortable presenting to large audiences and well experienced in meeting with C-level, building strong relationships with customers at all levels. … see more",
  "contact_info": "Knut’s Profile linkedin.com/in/knut-haug-72a7b5"
 },
 {
  "profile_link": "https://www.linkedin.com/in/aizatsadiq?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAYMSq8BjnWzZB6heMlTQEo1BBWDEH6d4V0",
  "name": "Aizat Sadiq",
  "information": "OTT Delivery, Quality Assurance and Support",
  "location": "Shah Alam, Selangor, Malaysia Contact info",
  "company": "Al Jazeera Media Network Universiti Tenaga Nasional",
  "connections": "423 connections",
  "about": "Experienced Assistant Vice President with a demonstrated history of working in the broadcast media industry. Skilled in Value-Added Services (VAS), Product Management, and Business Support System (BSS). Strong operations professional with a Master focused in Business Administration from Universiti Tenaga Nasional. … see more",
  "contact_info": "Aizat’s Profile linkedin.com/in/aizatsadiq"
 },
 {
  "profile_link": "https://www.linkedin.com/in/harith-gautaman-ramasamy-79b84025?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAVI-GcBgBQ8xMwdLHR9qmxeBcFMZZ1Yfd8",
  "name": "Harith Gautaman Ramasamy",
  "information": "Director of Learning and Development at TechKnow Solutions Sdn. Bhd.",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "TechKnow Solutions Sdn. Bhd. KDU University Malaysia",
  "connections": "1,484 followers 500+ connections",
  "about": "TECHKNOW SOLUTIONS SDN. BHD (TKS)July 2018 – Present• Founder & Co- Founder | Director of Learning and Development With more than 5 years of managerial positions and with learning and development experiences in the Broadcast & Media industry. Gautaman has extensive experiences in driving business strategic initiatives: • He embraces content creation and delivery solutions to new screens in new ways that transcend traditional broadcasting.• He develop a holistic learning framework with a focus on the measurable impact on the business.• He provides technology and commercial solutions to Broadcast & Media companies.ASTRO MALAYSIA April 1997 – February 2019 (22 years)• Head |Techno-Knowledge Management (TKM) - Aug 2015 – Mar 2019 (3 yrs 8 mth)Gautaman as Head of TKM, worked across many broadcast engineering departments and with stakeholders to ensure that, the training developed by the organization meets the needs of each function and is aligned with the goals of the business. For 2017 Bonus Paper Write-up for Content Compliance; *As part of our efforts in realizing Digitalization, we TKM team have developed a pool of technical expertise to up-skill and support the changing broadcast landscape.• Supervisor |Quality Compliance (QC) - Oct 2010 – Aug 2015 (4 yrs 7 mth)Gautaman was in the Quality Assurance department as a Supervisor. His assignments, establish new standards like HD, HD3D, UHD 4K as per the International Telecommunication Union (ITU) Broadcast Standardization Sector. In this position, he was also looking after a team of editors and oversee the content editing process & workload across all platform/channels, Malay, Chinese, Indian & Sports.• Engineer |Playout And Recoding System (PARS) - Apr 1997 – Oct 2010 (13 yrs 7 mth)Gautaman has been in the broadcast media for more than 20 years, nearly half of those as a TV broadcaster. He is familiar with Playout Automation for local channels and regional playout channels in a shift operations. As an engineer, his task is to ensure that the highest quality of transmission is maintained at all times by achieving 99.98% On-Air availability and ensure zero operational errors. He was also passionate about developing training courses in Broadcast Technology for engineers, and Broadcast Operations for non-technical people. To add to his accomplishment, he has also awarded the “Best In House Trainer” for 2008, 2009,2010, 2011 by Astro HR. … see more",
  "contact_info": "Harith Gautaman’s Profile linkedin.com/in/harith-gautaman-ramasamy-79b84025 Websites techknowsolutions.com.my/ (Company Website) content-technology.com/asiapacificnews/?p=4693 (Blog) Birthday May 18"
 },
 {
  "profile_link": "https://www.linkedin.com/in/prashan-narainan-428a0283?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABHEt-ABSqYqGvqqg6IJ82LkerBOHLth4S0",
  "name": "Prashan Narainan",
  "information": "Senior Associate Business Development and Digital at Astro Arena",
  "location": "Klang, Selangor, Malaysia Contact info",
  "company": "Astro Arena Universiti Malaysia Sabah",
  "connections": "484 connections",
  "about": "I'm a proven leader with experience in building a high performing team, driving result and lean problem solving. I have been able to leverage my strong communication, collaboration, and analytical skills to find success throughout my career.Colleagues know me as an innovative thinker that bring a new idea to most discussion and meetings. My way of thinking also tends to foster the ongoing dialogue between the group that I'm a part of, to ensure every person can add to the pool of meaning and that, as the group, we make the best decisions possible. … see more",
  "contact_info": "Prashan’s Profile linkedin.com/in/prashan-narainan-428a0283 Birthday January 2"
 },
 {
  "profile_link": "https://www.linkedin.com/in/sushil-chhillar-7aa50b55?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAuk2rIBR-cPhW2bgYny5yE-RSnFKSVQ1Bo",
  "name": "Sushil Chhillar",
  "information": "Head OTT (APAC) at ADA",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "ADA DY Patil University",
  "connections": "500+ connections",
  "about": "I am passionate about advertising of all types and exploring the different ways how meaningful advertising solutions can help the Brands resolve their Business Issues and help them in increasing their ROI.In my entire media career, i have been actively involved in understanding the issues faced by the brands across categories and how different advertising mediums like Radio, TV, Digital can be used in a more innovative way to resolve them.Currently entrusted in ADA with the responsibility of utilizing all my previous customer facing experience and create a unique, meaningful, data driven OTT / AVOD solutions for the Brands across South East Asia using ADA telco data assets … see more",
  "contact_info": "Sushil’s Profile linkedin.com/in/sushil-chhillar-7aa50b55 Birthday August 15"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ayhan-ilik-a1293124?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAUe624BwoQ4AJNSIWX7xa1C6nuSJIraPlw",
  "name": "Ayhan ILIK",
  "information": "CEO",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Ayaxia Technologies, Solutions and Consulting Istanbul Technical University",
  "connections": "500+ connections",
  "about": "PROFILE SUMMARY:I am a senior technology and telecoms executive, most recently CEO at Ayaxia Technologies, Solutions and Consulting, after earlier roles including CEO of Virgin Mobile Malaysia (Virgin Group), General Manager of Turk Telekom Europe (Turk Telekom Group), Country Manager of Ortel Mobile Germany (Telefonica Group) and Managing Director of Ay Yildiz Europe (Telefonica Group). I have a very strong track-record of starting-up and building businesses, leading successful turnarounds of underperforming operations and driving transformational change. My principal skills / experience include company leadership with full P&L ownership, developing & implementing new commercial strategies, building / leading / mentoring great teams, entering new markets, achieving market share dominance, successfully integrating newly acquired operations, launching new products / services, managing digitization, driving technology, disruption and innovation, and sales / marketing / product / technology and financial leadership. I have the energy and vision to successfully start-up, build and transform businesses and put them on a healthy, sustainable and profitable path.LEADERSHIP EXPERIENCE:Senior Executive in Global Business | Transformation Leader | Visionary Strategist | Turnaround Expert | Change Manager | Disruptive Innovator | P&L OwnerINTEREST AREAS:Technology | Telecommunications | MVNO | Industry 4.0 | Digital | Robotics | IoT | PaaS | SaaS | E-Commerce | FinTech | Blockchain | CryptoAssets | AI | Big Data | Mixed Reality (Virtual and Augmented Reality) | 3D Printing | Cyber Security | Face/Voice Recognition | Cloud Computing | Quantum ComputersLOCATION:I am a German national based currently in Kuala Lumpur / Malaysia with work/residence permits for Europe, Malaysia and Turkey … see more",
  "contact_info": "Ayhan’s Profile linkedin.com/in/ayhan-ilik-a1293124"
 },
 {
  "profile_link": "https://www.linkedin.com/in/sadra-shokouhi-1397649a?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABUc9b0BlisC0vsOEdFsfPt7INlr0LlxSac",
  "name": "Sadra Shokouhi",
  "information": "VP engineering | Entrepreneur | Tech Lead",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "hashthink University of Malaya",
  "connections": "500+ connections",
  "about": "Deeply driven to Creatively Creating Creative Creations. #Coding #machine_learning #NLP #AI #AWS #NodeJS #BlockChain #Ubuntu #PHP #Python #Javascript #Angular #Docker #CryptoCurrencies #UserProfilling #Entreprenuership #ProductDevelopment #Wordpress #datascience #Analytics #threejs #3D #AR #VR10+ years of hands-on enterprise software and product/idea development.Medical, Blockchain, Startups, Real-estate and e-commerce are few industries I have been part of in Southeast Asia, Australia, Germany, UK, CanadaTaught to dream, think, analyse and aim and facts are the valid yardsticks.Rather stay in Techno-preneurship than pure blind software dev. \"absolute\" is wrong in any term! huge believer in relativity … see more",
  "contact_info": "Sadra’s Profile linkedin.com/in/sadra-shokouhi-1397649a Birthday July 9"
 },
 {
  "profile_link": "https://www.linkedin.com/in/gadellev71?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAB19rUBI56T_1YZcLLt31H25RIqSEh0qzQ",
  "name": "Adelle Gregory",
  "information": "Head of Digital Services",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Maxis Universiti Malaya",
  "connections": "500+ connections",
  "about": "An accomplished Senior Digital Services Executive with the vision, insights and substantial experience to strategically plan, direct and implement to capitalize on emerging business opportunities. Areas of expertise:• Builder – Creator of organizational capabilities essential for implementing strategic initiatives—from partnership and acquisition evaluation, due diligence and integration and delivery.• Strategy - as well as communicating strategic initiatives to multiple stakeholders. Energetic, hard-worker and self-driven leader bringing entrepreneurial spirit and out-of-the-box thinking, even in large organisations.• Partnerships - Significant acquisition development and negotiation experience spanning partners across multiple geographies and at different stages of business.• Leadership – Is currently a member of the Senior Leadership Team at Maxis and is a proven leader adept at building teams to conceive and execute complex partnering and delivery involving cross-functional stakeholders with competing priorities. … see more",
  "contact_info": "Adelle’s Profile linkedin.com/in/gadellev71"
 },
 {
  "profile_link": "https://www.linkedin.com/in/khah-wai-cheah-63b51493?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABPU248BO87jtv4TL9TOnY5J26I1YYLPR6U",
  "name": "Khah Wai Cheah",
  "information": "Business Development Manager at Onwards Media Group Pte Ltd",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Onwards Media Group Pte Ltd",
  "connections": "500+ connections",
  "about": "The company, Onwards Media Group, is a streaming solution built OTT Platform for broadcasters, distributors and content owners to stream live & video on demand /audio across web, mobile & smart TV.Websitehttps://www.onwardsmediagroup.com. HQ Office located at SingaporeSpecialties OTT Platform, Video Streaming, Live Streaming, Video On Demand, Transcoding, Monetization, Audio, Online Video Platform, Mobile Live Broadcasting. … see more",
  "contact_info": "Khah Wai’s Profile linkedin.com/in/khah-wai-cheah-63b51493"
 },
 {
  "profile_link": "https://www.linkedin.com/in/fairos?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABSypZMBoAiuCHFh4ilBliNmqOpTATmtSng",
  "name": "Fairos Fedora",
  "information": "Fintech & Digital Marketing",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Alhijrah Media Corporation ( TV Alhijrah ) Liverpool John Moores University",
  "connections": "500+ connections",
  "about": "I'm currently a Digital Product Architect with more than 9 years of experience in Digital Media especially in e-Commerce platform development (Digital Business). As a Certified Digital Marketing Specialist, I have a wide knowledge and experience in managing eCommerce platforms, social media (Facebook & IG) platforms, Google Ads, WordPress, Joomla, and other platforms as well.Also specialize in Media Broadcasting & Digital Business including working experience in Video On Demand, Interactive Application & Fintech (e-wallet. e-card, digital payment solutions for banking industries)Interested to know more? Drop me an email to fairos@gmail.com … see more",
  "contact_info": "Fairos’ Profile linkedin.com/in/fairos Twitter fairosfedora"
 },
 {
  "profile_link": "https://www.linkedin.com/in/juliana-low-08009a5?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAADm7OABP1JyC4NNDu4qZvn0inmXcDUeww4",
  "name": "Juliana Low",
  "information": "Head of Content & Programming - Malaysia at viu.com",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Vuclip Inc. Institute of Public Relations Malaysia",
  "connections": "500+ connections",
  "about": "Experienced Head Of Content & Programming in the OTT Streaming space with a demonstrated history of working in the internet industry. Skilled in Digital Strategy, Content Marketing, Business Development, Marketing Strategy, and Digital Marketing.",
  "contact_info": "Juliana’s Profile linkedin.com/in/juliana-low-08009a5 Twitter justju7"
 },
 {
  "profile_link": "https://www.linkedin.com/in/fawad-hussain-80124032?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAbMQIEBrDyA60ojz1-zVtIsk4HspMob0qw",
  "name": "Fawad Hussain",
  "information": "Senior Solutions Architect at Amazon Web Services (AWS)",
  "location": "Petaling Jaya, Selangor, Malaysia Contact info",
  "company": "Amazon Web Services (AWS) International Islamic University",
  "connections": "500+ connections",
  "about": "Analytical and highly technical hands-on Digital Architect and Developer with a strong ability to engage IT teams, learn new systems, analyze data, manage large-scale technical issues, and optimize site architecture. IT leader who bridges the gap between business and technology with solutions that transform technology into usable services while maintaining solution and architectural integrity. Thrives on challenge and works well under pressure, with technical expertise to learn new environments quickly, locate inefficiencies in code, and provide quick solutions with project management skills that drive a quality software development process forward. Displays a natural ability for the provision of quick resolutions to problems. Highly effective communicator who will adopt varied communication techniques required to suit the audience. Adept at providing a support service to business, as well as experienced in the management of teams, and can build effective rapport and client trust.Architecture:Digital services including Direct Operator Billing, Digital Distribution, Internet of Things, OTT/Digital partnerships, etcDevelopment:• Java, BPEL, Oracle Service Bus, Databases PL/SQL, C#, Node.js, etcOperations:• BSS OperationsCertified SOA Professional with hands on experience in SOA services design, architecture and development. IASA Foundation Certified with good experience in Solution Architectures and IT Blueprint creation to keep Business and IT aligned to achieve company goals.Certified TMForm Business Development Manager and have understanding of the following TMForum Frameworks gained through online and on-site trainings• Business Process Framework (eTOM)• Information Process Framework (SID)• Application Process Framework (TAM)Certified TOGAF 9.0Certified Business Technology Strategy (IASA) … see more",
  "contact_info": "Fawad’s Profile linkedin.com/in/fawad-hussain-80124032 Birthday January 13"
 },
 {
  "profile_link": "https://www.linkedin.com/in/gopintheran-ponnudurai-40278a26?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAV0QcIBuxliLOLiLo6bgShgf8h361Mdefs",
  "name": "Gopintheran Ponnudurai",
  "information": "Product Owner | Certified ScrumMaster® (CSM®) | Media Specialist",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro University of East London Cass School of Education and Communities",
  "connections": "500+ connections",
  "about": "My interest and experience in media/broadcasting industry for more than 10 years, has taken me from content to technology. I am always striving to bring 100% to the work that I do with the following values:An agile mindset: I have always displayed my careful approach to operation process by do some research and having an agile mindset on my decisions. At iflix, I frequently have a quick stand-up sessions with the stakeholders and team to understand on upcoming challenges and to solve an issue. In addition, I had the opportunity to implement new workflows and improvise the workflows along with the needs for the business to grow. It shows my approach used in implementing new decisions are agile and scale able in the future.A passionate learner on new development on process improvisation: Everything I have engaged in so far has all been driven by my keen interest in content / broadcasting / OTT services. Even as a Senior Associate (VOD) in Astro, I made sure to dedicate some part of my day to learn new processes from other departments whether its Creative or Broadcast Engineering. It is this passion that has driven every one of my career decisions thus far.I look forward to connecting with you! … see more",
  "contact_info": "Gopintheran’s Profile linkedin.com/in/gopintheran-ponnudurai-40278a26 Website facebook.com/inther.gopi (Personal Website) Birthday March 6"
 },
 {
  "profile_link": "https://www.linkedin.com/in/matthewdurai?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAu5CXYBhiHnaiFgCJ2TzfP9YTNc9Z1ELxs",
  "name": "Matthew Durai",
  "information": "Digital Media | Hiring | ex Shopee",
  "location": "Malaysia Contact info",
  "company": "ZAG Media University of Nottingham",
  "connections": "500+ connections",
  "about": "Digital media and e-commerce practitioner with experience operating in a variety of strategy, commercial and marketing oriented roles. In that time, I have led execution of numerous projects, deals and partnerships across South East Asia. Relentless optimist seeking to cut through complexity and go above and beyond for causes that matter. … see more",
  "contact_info": "Matthew’s Profile linkedin.com/in/matthewdurai"
 },
 {
  "profile_link": "https://www.linkedin.com/in/nur-liyana-717201a1?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABWQssMBsFsrB5Etxi5srNuQiCXvKJ4DGC0",
  "name": "Nur Liyana",
  "information": "Manager, City Integrated Solution, Product & Innovations at TM ONE",
  "location": "Petaling Jaya, Selangor, Malaysia Contact info",
  "company": "TM ONE Multimedia University",
  "connections": "500+ connections",
  "about": "Digital media and e-commerce practitioner with experience operating in a variety of strategy, commercial and marketing oriented roles. In that time, I have led execution of numerous projects, deals and partnerships across South East Asia. Relentless optimist seeking to cut through complexity and go above and beyond for causes that matter. … see more",
  "contact_info": "Nur’s Profile linkedin.com/in/nur-liyana-717201a1"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ridhuansidek?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAJsdPMBcUipANSjH91cYh184sxhTOMUxMA",
  "name": "Ridhuan Sidek",
  "information": "Digital Builder, Marketing & Design Leader",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "PETRONAS INSEAD",
  "connections": "500+ connections",
  "about": "I believe Convergence and User Centricity will drive new value creation for businesses and progress. I lead organizations in navigating today’s fast paced digital economy and enterprise transformation with a passion for marketing, digital, people, design and CX for Fortune Global 500® companies and leading brands. Experienced senior management leader in marketing communications, user centered design practice, product management, digital strategy in media, financial services, telecoms, oil & gas, FMCG and creative services sector. Versed at spearheading business leadership roles, marketing, digital transformation and building digital products, ecosystem with a multi-disciplinary digital and design strategy. My playground is the intersection of creativity, technology and culture. Excelling in cross functional leadership roles. ►For Consulting, Speaking or other opportunities > ridhuansidek@me.comSpecialities: - Marketing Communications & Brand Management, Consumer Strategy & Sales.- Digital Strategy, User Centered Design and Transformation Management. - E-Commerce, Product Management, Customer Experience. - Media & Content Strategy and Management, Advertising and Ad-tech.- General Management, Functional and Business P&L role. - Developing, mentoring and coaching talents and teams. … see more",
  "contact_info": "Ridhuan’s Profile linkedin.com/in/ridhuansidek Website ridhuansidek.com (Personal Website) Email ridhuansidek@me.com Twitter RidhuanSidek"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ee-lyn-wong-1721621?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAzUGYB1rBnmyxdSo-wQlFiZQqO9pm1mAc",
  "name": "Ee-Lyn Wong",
  "information": "Head Of User Experience at Hong Leong Bank Berhad",
  "location": "Shah Alam, Selangor, Malaysia Contact info",
  "company": "Hong Leong Bank Berhad University of South Australia",
  "connections": "500+ connections",
  "about": "• Recent 3 years of experience managing product and project implementation of mobile banking app, other apps and Open API for the Bank.• 15 years of proven track record in telecommunications industry managing project implementation for fraud, credit and revenue management/assurance. • International project experience and collaboration with other subsidiary offices in UK, US and India … see more",
  "contact_info": "Ee-Lyn’s Profile linkedin.com/in/ee-lyn-wong-1721621"
 },
 {
  "profile_link": "https://www.linkedin.com/in/dngai?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAADshzYBRBTuWUT8pd2PBx7s1VXGiXA-FFg",
  "name": "Desmond Ngai",
  "information": "Astro OTT | WebTVAsia Pioneer | Streaming Entertainment Creator Economy | Digital APAC",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro Stanford University",
  "connections": "8,387 followers",
  "about": "• Recent 3 years of experience managing product and project implementation of mobile banking app, other apps and Open API for the Bank.• 15 years of proven track record in telecommunications industry managing project implementation for fraud, credit and revenue management/assurance. • International project experience and collaboration with other subsidiary offices in UK, US and India … see more",
  "contact_info": "Desmond’s Profile linkedin.com/in/dngai Website astro.com.my (Company Website) Twitter desmondngai Birthday October 3"
 },
 {
  "profile_link": "https://www.linkedin.com/in/zuraidah-agusi-74a42b178?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAACoQ4GoBRCEFV-ws6CcKBCmiClQdD0-rTS4",
  "name": "Zuraidah Agusi",
  "information": "QA Lead at CTOS Data Systems Sdn Bhd",
  "location": "Banting, Selangor, Malaysia Contact info",
  "company": "CTOS Data Systems Sdn Bhd Universiti Kuala Lumpur",
  "connections": "61 connections",
  "about": "Experienced Senior Test Engineer with a demonstrated history in Quality Assurance field. Skilled in Verification and Validation (V&V), Test Management, Test Planning, Regression Testing, and Test Cases.Familiar with various QA Methodologies such like Agile and Waterfall Strong engineering professional with a Bachelor's degree focused in Electronics from Universiti Kuala Lumpur. … see more",
  "contact_info": "Zuraidah’s Profile linkedin.com/in/zuraidah-agusi-74a42b178 Email ZuraidahAgusi.ZA@gmail.com"
 },
 {
  "profile_link": "https://www.linkedin.com/in/saimatkong?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAdlwCgBidf68C8Tc-A29xZxvbJjNmiKTrQ",
  "name": "Simon Kong",
  "information": "Head of Technology at Limpopo Technology Sdn Bhd",
  "location": "Petaling Jaya, Selangor, Malaysia Contact info",
  "company": "saimatkong.com Asia Pacific University of Technology and Innovation (APU / APIIT)",
  "connections": "500+ connections",
  "about": "Simon has over 15 years of experience in technology and IT consultancy. He is passionate about technology where his analytical skills and practical experience can be utilised effectively in providing exceptional value for business organizations. He has excellent interpersonal, communication, relationship management & project management skills.He has solid experience and understanding of the cloud infrastructure with hands-on expertise on Amazon Web Services (AWS), Microsoft Azure & Google Cloud Platform (GCP). He’s also dedicated to continuously discovering, evaluating, and implementing new technologies to maximize development efficiency.Technical Proficiency:HTML, PHP, ASP, ASP.net, VB, VB.net, C++, C#, Java, JavaScript, Kotlin, Node JS, Android, iOS, React Native, Firebase, MySQL, MSSQL, Redis, JSON, XML, Wordpress, Magento and more.More about Simon: -- Passionate about Technology - Dare to dream big and bold enough to achieve the unthinkable - Loves: Family, Technology, Travels, Photography, Badminton … see more",
  "contact_info": "Simon’s Profile linkedin.com/in/saimatkong Website blog.saimatkong.com (Blog) Twitter saimatkong Birthday July 10"
 },
 {
  "profile_link": "https://www.linkedin.com/in/limson-k-micheal-6b36625a?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAyOH2cBvN4LLCeKSlir_Lt-69XyQlrIEq8",
  "name": "Limson K Micheal",
  "information": "Technical Delivery Manager | Astro Go at Astro",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro ER & DC IT",
  "connections": "500+ connections",
  "about": "Managing the technology delivery for Astro Go OTT apps development, integrations and enhancements. Also work with various external/ Internal teams to develop and deliver high quality OTT services to the end users and to ensure Service Support and Service Delivery processes are in place to meet business needs• Responsible for the end-to-end delivery of application development, testing and implementation that will or can affect the overall customer user experience.• Oversee client/customer/vendor relationship to ensure that we met or exceed Astro Go users expectations.• Oversee the product statement of work (SOW) enhancements, development and release management processes.• Validate OTT products design with the product managers to ensure that the design satisfies the business requirements document.• Work with internal QA to plan testing activities to identify build quality, user interface and bugs prior to releases.• Facilitate Deep Dive sessions between 3rd party, Vendors, technology and business partners in the evaluation, selection and application of new and emerging tools and techniques.• Manage the project scope, delivery, Quality of deliverables.• Analyzing and establishing delivery priorities working with program teams/business partners• Coordinating system development and infrastructure support during analysis, development and testing phases• Interface with Business and product management to negotiate and insure scope lock down. … see more",
  "contact_info": "Limson’s Profile linkedin.com/in/limson-k-micheal-6b36625a Email limsonmca@gmail.com Birthday January 2"
 },
 {
  "profile_link": "https://www.linkedin.com/in/wanmuz?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAKs2HUBxgE3oBAVCr3RQqdJUfdii_ZWlVA",
  "name": "Wan Muzaffar Wan Hashim",
  "information": "CEO, Co-Founder at Anak2u Sdn Bhd",
  "location": "Selangor, Malaysia Contact info",
  "company": "Anak2U University of Lille 1 Sciences and Technology",
  "connections": "500+ connections",
  "about": "Mobile product manager.Experience in development and delivery of mobile application. 4 years experience in product development, QA, of mobile applications: m-commerce, mobile payment integration, mobile app for OTT solution.Bilingual in French and English. … see more",
  "contact_info": "Wan Muzaffar’s Profile linkedin.com/in/wanmuz Website backpackers-zone.com (Blog) Twitter wanmuz Birthday February 6"
 },
 {
  "profile_link": "https://www.linkedin.com/in/aminmohd?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAALc-rgB1qx0cvp2LDuDmEZQX_XEEag_u6k",
  "name": "Mohd Amin",
  "information": "Head of GTM Digital Services & Innovation Acceleration at Maxis",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Maxis National University of Singapore / NUS",
  "connections": "500+ connections",
  "about": "✔ Certified IASA Architect and Scrum Master✔ Accredited Amazon Web Services Technical & Business Professional✔ Management training from National University of Singapore (NUS) Business School✔ 12+ years of professional software development in multi tier, distributed J2EE systems✔ More than 10 years in the IT delivery/project management, including P&L responsibility, settingup of business units, strategic direction, planning and running of IT projects✔ 10+ years of solution architecture work across industries such as telecoms, logistics and education✔ Successfully setup and manage software delivery teams in multiple organisations✔ 7 years specializing in telecoms, integration of VAS, charging, rating and billing solutions to operators in New Zealand, Australia, Indonesia, UK, Germany, Hungary, Romania, Albania, Malta, Kuwait, Saudi Arabia✔ 3 years of logistics experience specialising in EDI (EDIFACT, X12), shipping line, 3rd party logistics and 4th party logistics in addition to express logistics end to end integration … see more",
  "contact_info": "Mohd’s Profile linkedin.com/in/aminmohd Twitter princeamin"
 },
 {
  "profile_link": "https://www.linkedin.com/in/jeffreyhalimsetiawan?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAXi1yABTXjNkgt8EPyh2YshosS3_S-_-20",
  "name": "Jeffrey Hermanto Halimsetiawan",
  "information": "Mobile Engineer Lead",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro National Taiwan University of Science and Technology",
  "connections": "500+ connections",
  "about": "Jeffrey is a hard worker and very passionate about technology. He received his Bachelor of Informatics degree of Informatics Engineering from Institut Teknologi Sepuluh Nopember, Surabaya, Indonesia in 2011. Good academic performance gave an opportunity for him to get master study scholarship at the Department of Computer Science and Information Engineering, National Taiwan University of Science and Technology, Taipei, Taiwan and received his Master of Science degree in 2013. His enthusiasm in technology and leadership capability made him selected as a Microsoft Student Partner Lead for East Java region, Indonesia until May 2011. He is also the Co-Founder and Developer of a start-up game studio named Aksara Studio. He has more than 10 years mobile application development experience such as Java ME, Windows Mobile, Windows Phone, Blaast, iOS, Android Native, Unity, and also React Native. Because of his technical expertise and contributions to Nokia Developer community, he was selected as Nokia Developer Champion from April 2012 to August 2014. Currently, he is also a Scrum Master Certified (SMC®) professional. In order to upgrade his skill and capability to the next level, he decided to join HappyFresh.com, the first and fastest-growing online grocery platform in South East Asia, from August 2015 to May 2016 as Senior Software Engineer - Mobile. Then, he accepted offer from AiryRooms.com, one of the fastest-growing online hospitality services in Indonesia, to build their mobile apps as Mobile Engineer Lead. In May 2017, he took another opportunity from Astro.com.my to be part of its early Software Engineering team. He is eager to learn about product development, software development process and system at start-up company.Specialties: Mobile Apps Development (Android), Game Development, Software Development … see more",
  "contact_info": "Jeffrey Hermanto’s Profile linkedin.com/in/jeffreyhalimsetiawan Websites aksarastudio.com (Company Website) tutorialpemrograman.wordpress.com/ (Blog) about.me/jeffrey.halimsetiawan (About Me) Twitter 7effrey"
 },
 {
  "profile_link": "https://www.linkedin.com/in/tee-haw-b658b51?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAABPkz0BB0rH0YAopB2uS7jQuPVCzuMuCUU",
  "name": "Tee Haw",
  "information": "Head of Sales & Business Development APAC | Paessler AG",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Paessler AG Staffordshire University",
  "connections": "500+ connections",
  "about": "A very energetic and motivated full ownership individual with 20+ years of experience in IT, Global Telco into Digital Transformation space. Experienced in various technology management, sales management leadership, business development and Operation lead. Experienced with strong hunter strategy and mindset especially in New Logos / Growth market Globally acquisition with highly professional approach. Result oriented and good team lead! Focus, Challenge and Determine is my way to move forward. … see more",
  "contact_info": "Tee’s Profile linkedin.com/in/tee-haw-b658b51 Website tatacommunications.com/ (Company Website) Birthday May 11"
 },
 {
  "profile_link": "https://www.linkedin.com/in/tiiben?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAA57VToBqEBdeckSWXb3aHFakgcW5FVrR3U",
  "name": "Tiibenvel M.",
  "information": "Head of Marketplace at Delivery Hero Malaysia(foodpanda)",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "foodpanda",
  "connections": "500+ connections",
  "about": "Growth enabler for high performance businesses.",
  "contact_info": "Tiibenvel’s Profile linkedin.com/in/tiiben"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ajatshatrusingh?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAZ2POMBZ4a80jWL8k43RdphSCsAFS0IEno",
  "name": "Ajatshatru Singh",
  "information": "AVP Cloud Solution Architect || 3X AWS || 1X Azure Certified",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro",
  "connections": "500+ connections",
  "about": "A customer oriented, multitask professional with excellent analytical and logical skills with rich experience of over 8 years.Delivering high quality products in tight timelines. Implementing agile work culture across the teams and different units for the projects. Experience in managing and working with multicultural teams and IndividualsExperienced in multiple Industry domains as travel, meta aggregation, media, Payments, E-Commerce and supporting Middleware Applications. Currently, helping the organisation build Engineering Solutions while managing the team among in-house and third party professionals to drive the projects to completions. All the while ensuring cost and delivery timelines of the project. Working closely with the senior management in planning, Implementation and budgeting of the projects and planning the workforce and gathering and creating Functional and Non Functional project requirementsMost importantly, enabling the team to bond, grow, Innovate and come up with Ideas and solutions and nurturing champions among them, while aligning them with the company future vision as well. … see more",
  "contact_info": "Ajatshatru’s Profile linkedin.com/in/ajatshatrusingh Birthday February 28"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ganeshmahendranathan?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABDyJUMBOg60lvDvbvBsKNuQNHWj7Lz0138",
  "name": "Ganesh Mahendranathan",
  "information": "Head of Innovation at RHB Banking Group | We're Hiring!",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "RHB Banking Group Stanford University Graduate School of Business",
  "connections": "500+ connections",
  "about": "Entrepreneur, consultant and design thinking leader with a strong professional foundation as an auditor and strategy consultant. He has proven success in delivering innovation and driving incremental value across start-ups, scale-ups, innovation consulting firms and the government. He has been invited to speak on innovation and start-ups at conferences (Wild Digital SEA, KL Startup Summit, Grooves Work Technology Summit, Cyberjaya Startup Summit, Beyond4Fest, YSEALI Entrepreneur Bootcamp) and tertiary institutions (University of Nottingham, Asia School of Business and UCSI University). He seeks to bring his experience in-house to larger organizations to create value through heightened productivity and increased customer satisfaction. … see more",
  "contact_info": "Ganesh’s Profile linkedin.com/in/ganeshmahendranathan"
 },
 {
  "profile_link": "https://www.linkedin.com/in/tamilhselvankuppan?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAINxpoB-I9LEwT9n-gAPrvtHSmPrHOrHyg",
  "name": "Tamilhselvan K.",
  "information": "Group Chief Technology Officer at MBits Digital Sdn Bhd. MVNO, MOBILE VIDEO ON DEMAND OTT and SMART CONNECTIVITY ( BROADBAND, IOT)",
  "location": "Shah Alam, Selangor, Malaysia Contact info",
  "company": "MBits Digital Sdn Bhd Federation University Australia",
  "connections": "500+ connections",
  "about": "Digital Solutions for Communication, Connectivity and Collaboration.",
  "contact_info": "Tamilhselvan’s Profile linkedin.com/in/tamilhselvankuppan Birthday July 31"
 },
 {
  "profile_link": "https://www.linkedin.com/in/mchak?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAN6-B4BmaZ42CBBuI0798kt1saQj1LIatc",
  "name": "Chakarawarthy M, MBA",
  "information": "CEO | Co-Founder | Entrepreneur | Doctoral Candidate",
  "location": "Malaysia Contact info",
  "company": "RC Engineering & Construction National University of Malaysia (UKM)",
  "connections": "500+ connections",
  "about": "Experienced Project Manager with a demonstrated history of working in the broadcast media industry. Specialize in Digital broadcast systems relate to OTT (Over-The-Top), Video On Demand (VOD), DTH and IPTV. Have 10 years solid experience in project management and platform development. Managed multimillion Ringgit projects for Astro including OTT, VOD, Enterprise Media Storage system, Digital Media Ingest, Editing & Compliance system, Broadcast business system, Diva Archive & StorageTEK Library, Content Management & Metadata System, Network & Firewall system. … see more",
  "contact_info": "Chakarawarthy’s Profile linkedin.com/in/mchak Birthday April 12"
 },
 {
  "profile_link": "https://www.linkedin.com/in/hilda-shamsul-bahri-7b67758b?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABMoIToBWcpOczF2k1xX20d4bvd1JH5iJrc",
  "name": "Hilda Shamsul Bahri",
  "information": "SAVP, Head of Brand and Communications, Malaysia OTT at Astro",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro HELP University",
  "connections": "500+ connections",
  "about": "An experienced Team Lead in driving Brand Storytelling, Strategic Communications, Social MediaActivation, & Digital Marketing initiatives, with a demonstrated history of working intelecommunications industry. Currently the lead storyteller and digital marketeer for unifi, with astint in Agile Methodology and Design Thinking. … see more",
  "contact_info": "Hilda’s Profile linkedin.com/in/hilda-shamsul-bahri-7b67758b"
 },
 {
  "profile_link": "https://www.linkedin.com/in/updesh?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAQBYgYBh9i8ItfCRcQfcpDRDKuu4U4_900",
  "name": "Updesh Singh",
  "information": "Director of Technology - South East Asia",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Ideal Systems (Singapore) PTE LTD University of Hertfordshire",
  "connections": "500+ connections",
  "about": "Media solutions architect and innovator with over 20+ years of experience in broadcast systems, studio production systems, specialist networking for video and audio , backend media business systems, OTT, digital transformation and media supply chain management. New found passion for avant-garde streaming , cloud media platforms & innovative media production techniques. … see more",
  "contact_info": "Updesh’s Profile linkedin.com/in/updesh Website idealsys.com (Company Website) Birthday June 13"
 },
 {
  "profile_link": "https://www.linkedin.com/in/remykhoo?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAK1qhABfdrOBHVlUW6aQzhZLFWiap2uyHE",
  "name": "Remy Khoo",
  "information": "VP, E-Commerce, Partnerships & Payments at Astro",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro",
  "connections": "500+ connections",
  "about": "Business leader with 18 years of experience driving revenue growth via digital, innovation, strategy, partnerships and new business development",
  "contact_info": "Remy’s Profile linkedin.com/in/remykhoo"
 },
 {
  "profile_link": "https://www.linkedin.com/in/william-lo-465b8715?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAMzDc0BZLWIOy1avmZgk7r5jUs7bREP_Tg",
  "name": "William Lo",
  "information": "Assistant Vice President, Digital Marketing at Astro",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro Monash University",
  "connections": "256 connections",
  "about": ".",
  "contact_info": "William’s Profile linkedin.com/in/william-lo-465b8715"
 },
 {
  "profile_link": "https://www.linkedin.com/in/jariheinonen?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAcfN0B0J5mBhXCRkXNoZLD_T-hMV5yOYE",
  "name": "Jari Heinonen",
  "information": "Head of Business development at FastForward.ai",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "FastForward.ai",
  "connections": "500+ connections",
  "about": "Jari is an experienced entrepreneur and startup specialist From Finland with extensive background working and living in countries across Asia. He has a long history developing and driving growth for multiple companies across market verticals. Key focus is helping them to establish new go-to-market strategies and to grow the business to the next level. He brings a Finnish hardworking and transparent mindset to multi culture environments.Jari is available for,• Advisor roles in international growth companies • Active company board roles • Helping startups to enter Asian markets• Assisting companies in building business plans• Advising and supporting non-profit organizations• Helping companies with change management processIn the startup industry,Jari can help to build, grow and lead the business and operations, enabling the company to increase its value, to scale and to build a healthy and sustainable business. As an adviser for board or management team,Jari can help• To identify the best approach to support strategic objectives• To advice how to build a performing team to support your business• To help in the change management process• Coaching the team to achieve KPI’s and targets• Identify the right market strategy and help to execute Lead-by-example leadership style,Drives the team to perform and support the company strategy in aggressive and optimum way. Understanding the cultural aspects and working closely with people ensures end-to-end satisfaction internally and externally. … see more",
  "contact_info": "Jari’s Profile linkedin.com/in/jariheinonen Twitter heinja_jari"
 },
 {
  "profile_link": "https://www.linkedin.com/in/that?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAYnklkBMfqVSOXw7QGltM2xxIl-wFzMSvY",
  "name": "Tha Toe Htoon",
  "information": "Lead Solution Architect | Tech & Product Advisor",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro London Metropolitan University",
  "connections": "500+ connections",
  "about": "Tech entrepreneur who understand well on product, technology and customer behavior. Hands-on technical leadership experience in video platforms, e-commerce ecosystems, content delivery, software development and product management.",
  "contact_info": "Tha Toe’s Profile linkedin.com/in/that"
 },
 {
  "profile_link": "https://www.linkedin.com/in/jeyaganesh-visvanathan-5a863571?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAA84sBABf0aprZq7lYy2CYoxrKOYfaGHupg",
  "name": "Jeyaganesh Visvanathan",
  "information": "Head Of Solutions at MSA Resources",
  "location": "Greater Kuala Lumpur Contact info",
  "company": "MSA Resources",
  "connections": "500+ connections",
  "about": "Experienced Solutions Architect with a demonstrated history of working in the telecommunications industry. Skilled in Sales, Fibre Optic, Submarine Cable Network, Data Center, Management, Ethernet, and Service Delivery. Strong administrative professional with a B.Sc. (Hons) Computer Science focused in Internet Technology from Staffordshire University. … see more",
  "contact_info": "Jeyaganesh’s Profile linkedin.com/in/jeyaganesh-visvanathan-5a863571 Website gtoo.net.my (Company Website) Birthday November 24"
 },
 {
  "profile_link": "https://www.linkedin.com/in/imjesswong?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAApa9-IBOWDqyqCS78-jvlLXe3HURe3YkQI",
  "name": "Jessica Wong",
  "information": "foodpanda",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "foodpanda The University of Manchester",
  "connections": "500+ connections",
  "about": "Jess is a progressive thinker and agile marketing & commercial professional with a strong track record of improving brand performances & market share.She is passionate about delivering best practice results through first-class measurable campaigns. She worked as a consultant for various local & regional startups across the healthcare, beauty & fashion, hospitality, and fintech industries.She currently manages the Pick-Up segment in foodpanda Malaysia. … see more",
  "contact_info": "Jessica’s Profile linkedin.com/in/imjesswong"
 },
 {
  "profile_link": "https://www.linkedin.com/in/sucheese?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAARZM28BcDOY0kUusA5TvMt4inVtIflRL-Y",
  "name": "Suchee Ng",
  "information": "People Powered Property Platform | NLP Practitioner",
  "location": "Petaling Jaya, Selangor, Malaysia Contact info",
  "company": "MHub",
  "connections": "500+ connections",
  "about": "I adore deep conversation over coffee/cakes. Often, I wonder how the future could be if AI has taken over all operational jobs from us.",
  "contact_info": "Suchee’s Profile linkedin.com/in/sucheese"
 },
 {
  "profile_link": "https://www.linkedin.com/in/prakashsayini?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAABDvmwBa4BlJbFMgxVTmpVGJerMdtEXTXk",
  "name": "Prakash Sayini",
  "information": "Digital Transformation Leader, New Business Growth Hacker, Products & Services, API Economy & Ecosystem : Ex-Deloitte, Ex-Vodafone, Ex-Nokia, Ex-Siemens. Start-up founder",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Axiata Indian Institute of Management Bangalore",
  "connections": "500+ connections",
  "about": "Seasoned and accomplished industry and digital business transformation leader having 25 years of hands-on global end-to-end experience (12 years in APAC region) comprising of 17 years in management consulting and functional leadership roles. In the last 6 years, been working on organisation level digital transformation programs involving strategy and operations at Axiata Group, Vodafone India and Deloitte, mainly building 2-sided digital business platforms and IoT solutions with new commercial business models leading to revenue generation. Overall worked in several areas in various roles comprising of R&D, Pre-sales, Business development, Partner alliances, Developer ecosystem building, and Innovation.Lived and worked in Singapore (covering APAC), Finland, USA, Australia, India, Germany and Malaysia and did business in more than 20 countries. Have had the opportunity to work for Deloitte, Vodafone, Nokia, Nokia Siemens Networks, Siemens Communications, and National University of Singapore (erstwhile Centre for Wireless Communications)An out of the box thinker with a penchant and ability to individually take initiatives to solve complex issues in converging business environments and ecosystems; whether driving consumer centric cohesive innovations across segments or creating digital strategy for clients and organisations leading to developing end-to-end solutions in line with business challenges and industry trends.A public speaker in close to 100 technology and business conferencesAlso have entrepreneurial experience having own start-ups and providing mentor-ship and coaching for new start-ups.Specialties:Organisational Digital Transformation - Telco & Non-TelcoAPI Management & Monetization E2E Digital & IoT SolutionsDirect to Consumer Digital Content EcosystemBusiness DevelopmentNew Business ModelsPartnerships & AlliancesStartups & InnovationsNew Products and SolutionsApps Ecosystem & EconomyMulti-sided PlatformsMobile Networks … see more",
  "contact_info": "Prakash’s Profile linkedin.com/in/prakashsayini"
 },
 {
  "profile_link": "https://www.linkedin.com/in/navinwathan?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAgD2wBuc8J9LfVeg44c-SQ0V8NH7XPm-4",
  "name": "Navin Wathan",
  "information": "Senior Advisory Consultant at Amazon Web Services",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Amazon Web Services Imperial College London",
  "connections": "500+ connections",
  "about": "I am a business leader with over 15 years experience in inspiring teams to build great product and a loyal customer base within the B2B and B2C spaces. Equally, I'm a die-hard hands-on engineer that cannot stop learning and playing with technology, new or established. … see more",
  "contact_info": "Navin’s Profile linkedin.com/in/navinwathan"
 },
 {
  "profile_link": "https://www.linkedin.com/in/manas-dutta-32060087?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABJrucgBpKN3M2Rt1ZZGR3WWYgp7SHc69Q8",
  "name": "Manas Dutta",
  "information": "Technology Consultant V | Lead Solution Architect - Analytics",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "DXC Technology Symbios Institute of Computer Studies and Research",
  "connections": "500+ connections",
  "about": "Result-driven technology enthusiast with around 10+ years of experience in Media domain, Cloud computing, big data and analytics platform, software development lifecycle.Have worked in multi and hybrid cloud platform. Known to thrive in stressful and ambiguous environments where scope and timeline changes are constant and looking forward to work in an organization where my knowledge will be use for the growth of the organization and to grow with the organization … see more",
  "contact_info": "Manas’ Profile linkedin.com/in/manas-dutta-32060087 Birthday July 28"
 },
 {
  "profile_link": "https://www.linkedin.com/in/kingsley-warner-7607b310?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAJA53gBqQM9ONK_78jKZ1sb7o-mOtzKXf8",
  "name": "Kingsley Warner",
  "information": "Country Manager / VIU Malaysia",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "VIU Malaysia UNSW",
  "connections": "500+ connections",
  "about": "An entrepreneurial Media & Technology Executive with 18 years experience in Australia & SEA markets, building and scaling Direct to Consumer digital platforms - OTT, Pay-Tv, Digital Media and Telecommunications.",
  "contact_info": "Kingsley’s Profile linkedin.com/in/kingsley-warner-7607b310"
 },
 {
  "profile_link": "https://www.linkedin.com/in/eleanorchoong?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAi61EQBf8L7bl6fRm57x9R_P_Ri597Pvf8",
  "name": "Eleanor Choong",
  "information": "Head, Sunway XFarms",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Sunway XFarms",
  "connections": "500+ connections",
  "about": "Entrepreneur at heart, I'm always thinking about creative ways to develop businesses, collaborate with people across regions and improve the statue quo.",
  "contact_info": "Eleanor’s Profile linkedin.com/in/eleanorchoong Birthday October 14"
 },
 {
  "profile_link": "https://www.linkedin.com/in/wansyahirah?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABOJHxwBZvcCt5ob_jzivoOj9G1jup5ECsE",
  "name": "Wan S.",
  "information": "Product Management in Telecommunications, Media, Technology (TMT) and Fintech",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Huawei Technologies Universiti Teknologi MARA",
  "connections": "500+ connections",
  "about": "I am a TMT and fintech product management aficionado with APAC regional experiences. An avid reader on TMT and self improvements. Love new challenges and the chance to pioneer new products. I have a track record as:* Product management for Malaysia first high speed broadband (unifi) and IPTV. * Product & project management for several digital products (entertainment apps and fintech) for Asia Pacific regional telecommunications companies. … see more",
  "contact_info": "Wan’s Profile linkedin.com/in/wansyahirah"
 },
 {
  "profile_link": "https://www.linkedin.com/in/evangelyn-piramila-poovan-40563638?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAfspcUBGZgIeUMM8WlvkYzjBo6LiPoQ2v4",
  "name": "Evangelyn Piramila Poovan",
  "information": "Manager Digital Data Analytics at Philip Morris International",
  "location": "Selangor, Malaysia Contact info",
  "company": "Philip Morris International Multimedia University",
  "connections": "500+ connections",
  "about": "Senior-level professional experience with more than 15 years in digital medium ( website & mobile applications) ranging from software development, job recruitment, online media & publishing, OTT services industry. Experienced in core business such as software development , project management, product management, operations & process management , marketing & analytics services, strategic planning & execution, budget planning , training & development , communication & stakeholder management.Results-oriented achiever with excellent track records for identifying opportunities for accelerated growth.Managed the entirety of Digital Analytics & Marketing landscape, strategizing digital monetization through data driven and activation, whereby have reporting directly to Chief of Digital & Marketing Officer and Chief of Innovation Officer besides Vice President of Digital Product Management. Organization’s digital analytics & marketing subject matter expert.Certified by Harvard Business School on Business Analytics & Big Data for Executive as a highly analytical decision maker and result-oriented.Certified Enterprise Data Analyst and Online Marketing Certified Professional ( OMCP) personnel.Strong leader and coach with motivational management style and reputation for building and retaining highly motivated team. Managed a team size up to 15 people consists of analysts, digital marketing specialist, project managers, designers and product managers. … see more",
  "contact_info": "Evangelyn Piramila’s Profile linkedin.com/in/evangelyn-piramila-poovan-40563638 Email premila14@yahoo.com"
 },
 {
  "profile_link": "https://www.linkedin.com/in/shahidaazad?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAA9SuekBQQrey4PBA7hLUZ46od7UtKU-Qpw",
  "name": "Shahida Azad Jamaludin",
  "information": "Associate Director, Marketing & Partnership at Viu",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Viu Universiti Teknologi MARA (UiTM)",
  "connections": "500+ connections",
  "about": "Experienced and accomplished marketing and branding professional with over 14 years of experience in OTT, digital media and broadcast industryMission-oriented. Developed and successfully launched several entertainment streaming platforms.Original & Innovative. Experienced content creator in driving brand awareness and high user engagement. Acquiring & developing original contents included.Delivers results. Demonstrated track record in strategizing, developing and executing marketing plans with the focus on GA (Gross Add), Churn & Retention of TV and Broadband to drive leadership in market share. People person. Accustomed to merging cross-functional team that evolves ideas to bring together brand goals, objectives and consumer needs. International. Launched platforms for various audiences in Malaysia, Singapore, and IndonesiaThink & Act. Fluent with analytics and translating data into actionFamily. Mother to an amazing 8-year-old who is currently obsessed with Star Wars, Fortnite and Roblox … see more",
  "contact_info": "Shahida Azad’s Profile linkedin.com/in/shahidaazad Website singtel.com/cast (Company Website)"
 },
 {
  "profile_link": "https://www.linkedin.com/in/mohd-shazali-md-yunus-b7072253?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAtRugQBTZ_MpMPYxRxZu5dJGa8wyP_OMCE",
  "name": "Mohd Shazali Md Yunus",
  "information": "Digital Technoprenuer",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "GlobalAd Technology Sdn Bhd Universiti Putra Malaysia",
  "connections": "500+ connections",
  "about": "Mohd Shazali Bin Md Yunus, has vast experience in Project Management, IT and Business Operation focusing on Information Technology covering Telecommunication Industry, Banking System, Financial System, Utilities System, Telco Billing System, CRM System, Telco Digital Platform, Telco Content Product & Marketing Development. His substantial experience was garnered during his tenure with Celcom (10 Years) with last position as General Manager Heading Marketing & Product Development for Add-On OTT, Maxis (11 Years) Coopers & Lybrand Management Consultancy (now known as PwC for 5 Years), Maybank (1 Year) and IBM (1 Year). His tertiary education was in Computer Science from (UPM), Information Technology BSc (Hons) from University of Hertfordshire (Inti University College Malaysia), Master of Business Administration MBA from University of Hertfordshire (Inti University College Malaysia). He also serves as a member of board of directors for several companies doing business offering in IT, Digital Content Technology, Telecommunication Products and Services.Key Experience Highlight:ERP - SAP Supply Chain, Sales Distribution, Service Management, Warehouse ManagementHead of Biz Apps PMOBilling System - BSCS, KenanFX, MNP, MVNO, CRLMHead of BIling CPIESTransformational Action Group - Sales Distribution, Billing & Credit ManagementRenoir Key TaskforceIT Transformation, BSS Program Management - CRMHead of IT BSS PMOCelcom International Toastmaster ClubVice President Membership 2014Advance Communicator Bronce (ACB)Commpetent Leader (CL)Creative Dream InternationalMobile Apps E-FranchiseLeader, Minister Club 2013 … see more",
  "contact_info": "Mohd Shazali’s Profile linkedin.com/in/mohd-shazali-md-yunus-b7072253"
 },
 {
  "profile_link": "https://www.linkedin.com/in/haleyliy?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAA5vwsIBaLmodIRxf4T-ZkJwrDvTFvSDsfI",
  "name": "Liyana-Haley T. A.",
  "information": "Monster of Content 🏆 10 International Broadcast Awards & 1 Local Award recipient for creating disruptive TV content 📺 🔸 Senior Content Producer 🔥⚡ Sharing the power of entertainment in media (Broadcast, Digital, OTT)",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "PETRA Entertainment",
  "connections": "1,094 followers",
  "about": "Mohd Shazali Bin Md Yunus, has vast experience in Project Management, IT and Business Operation focusing on Information Technology covering Telecommunication Industry, Banking System, Financial System, Utilities System, Telco Billing System, CRM System, Telco Digital Platform, Telco Content Product & Marketing Development. His substantial experience was garnered during his tenure with Celcom (10 Years) with last position as General Manager Heading Marketing & Product Development for Add-On OTT, Maxis (11 Years) Coopers & Lybrand Management Consultancy (now known as PwC for 5 Years), Maybank (1 Year) and IBM (1 Year). His tertiary education was in Computer Science from (UPM), Information Technology BSc (Hons) from University of Hertfordshire (Inti University College Malaysia), Master of Business Administration MBA from University of Hertfordshire (Inti University College Malaysia). He also serves as a member of board of directors for several companies doing business offering in IT, Digital Content Technology, Telecommunication Products and Services.Key Experience Highlight:ERP - SAP Supply Chain, Sales Distribution, Service Management, Warehouse ManagementHead of Biz Apps PMOBilling System - BSCS, KenanFX, MNP, MVNO, CRLMHead of BIling CPIESTransformational Action Group - Sales Distribution, Billing & Credit ManagementRenoir Key TaskforceIT Transformation, BSS Program Management - CRMHead of IT BSS PMOCelcom International Toastmaster ClubVice President Membership 2014Advance Communicator Bronce (ACB)Commpetent Leader (CL)Creative Dream InternationalMobile Apps E-FranchiseLeader, Minister Club 2013 … see more",
  "contact_info": "Liyana-Haley’s Profile linkedin.com/in/haleyliy Birthday December 2"
 },
 {
  "profile_link": "https://www.linkedin.com/in/sofiyant-neo-78010371?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAA8ktJABO9xRsVffxLF4sfruZYtmllju084",
  "name": "Sofiyant Neo",
  "information": "Director of Media & Creative Content at IDEAL Systems Group",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "IDEAL Systems Group Cambridgeshire University, UK",
  "connections": "500+ connections",
  "about": "25 years of experience in Broadcasting Network, Television Content Development and Productions, Film Making & marketing, Commercial Productions, TV Programming skills, Business Development, Branding & International Marketing skills.",
  "contact_info": "Sofiyant’s Profile linkedin.com/in/sofiyant-neo-78010371"
 },
 {
  "profile_link": "https://www.linkedin.com/in/asugan?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAA4O32UBqZZlAk2mev8EfLAgkgaWqML4cNc",
  "name": "Asugan Pechi Muthu",
  "information": "CEO at One Stop Music (OSM) Berhad | Digital Licensing & Distribution | OTT Content Aggregator",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "One Stop Music (OSM) Berhad",
  "connections": "500+ connections",
  "about": "An ambitious and self-motivated personality who drives towards self-set life goals confidently. Always very passionate and committed to the task being handled with zero compromise.Has excellent senior managerial expertise with various management background from the local Malaysian business industries. Have good track records in various field such as Music, OTT, Information Technology, Human Resources including Administration with total of 20 years of working experience.Currently attached as Chief Executive Officer (CEO) of One Stop Music (OSM) Berhad since year 2013 which itself is local major music player in Malaysia besides the 3 multi-national record labels - Sony Music, Universal Music & Warner Music. OSM comprises more than 350 record labels and music publishing companies from various territories of Asia Pacific. … see more",
  "contact_info": "Asugan’s Profile linkedin.com/in/asugan"
 },
 {
  "profile_link": "https://www.linkedin.com/in/brindhaj?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAACrmGIB-ym8eBwfWfIrW-_FSbtLPhGooic",
  "name": "Brindha Jesudasan",
  "information": "Motion Graphic Designer at SIRIUS TV",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "SIRIUS TV Malaysian Institute Of Art",
  "connections": "301 connections",
  "about": "Conceptualizing+Ideation+Designing+Broadcast Motion Graphics for TV Programme/OTT+Graphic Design+Social Media & Digital Media designSo do drop me a message' if you would like to know more about my work. Cheers' … see more",
  "contact_info": "Brindha’s Profile linkedin.com/in/brindhaj"
 },
 {
  "profile_link": "https://www.linkedin.com/in/nor-effendi-othman-b66a6611?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAJ4XP4BbBUVNdVjxgcv6QiMC1gdo6a-jLc",
  "name": "Nor Effendi Othman",
  "information": "Manager, Partnership, Client Services & Marketing",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Securities Industry Development Corporation (SIDC) Monash University",
  "connections": "500+ connections",
  "about": "A results-oriented management professional with years of experience in various industries like banking, media, telco, IT, education and corporate training. Resourceful, creative and analytical in approach with strong personal drive. Strong interpersonal skills and organisational development experience to drive performance and deliver results. Always think out-of-box. … see more",
  "contact_info": "Nor Effendi’s Profile linkedin.com/in/nor-effendi-othman-b66a6611 Birthday April 23"
 },
 {
  "profile_link": "https://www.linkedin.com/in/konesh-kochhal-0b4b8918?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAO7yUgBgCHFtuTaDclTPrACMG_ymnrDuis",
  "name": "Konesh Kochhal",
  "information": "Director: Industry Ecosystem Engagements (Asia Pacific Region), Huawei",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Huawei Technologies MIT Sloan School of Management",
  "connections": "1,645 followers 500+ connections",
  "about": "I am a senior telecoms executive, currently Director - Industry Ecosystem Engagements & Operator Strategies, Asia Pacific Region with Huawei in Malaysia, after earlier roles including Director – Technical & Sales (ZTE Malaysia) and General Manager – Data Business (Bharti Airtel Africa).Working as a techno-commercial leader, my experience spans the development & implementation of new strategy, building / leading diverse teams, major account management, building / operating / monetizing technical infrastructure & services, driving / maintaining network efficiency, leading digital transformations, working with senior stakeholders (clients, cross-functional colleagues, regulators, governments), go-to-market planning / rollouts, product / devices management, user & revenue analytics, sales & marketing management and business development. I have worked in 25 countries across Africa, Asia, Australasia and Europe. I possess strong technical knowledge and have a highly-commercial mindset and approach. I am/have been a Keynote Speaker and Panellist at various industry events on 5G, Smart Cities, Digital Transformation, Industry4.0, Network Transformation and Regulation and Policy. … see more",
  "contact_info": "Konesh’s Profile linkedin.com/in/konesh-kochhal-0b4b8918"
 },
 {
  "profile_link": "https://www.linkedin.com/in/jayarjuan?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAvsxCsBAhTkvs-jQzjB-fTSjtyIhOvLwpY",
  "name": "Jay Ar Juan",
  "information": "Commercial Director at foodpanda",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "foodpanda University of the Philippines",
  "connections": "500+ connections",
  "about": "A couple of years back I came to a realization that to experience things I've never had before it needed me to do things I've never done before.I have carried this into how I operate and allowed me to make a jump into the world of startups, the internet industry and international business expansions. It opened my eyes not only to innovative ways of doing business but also the people, culture, and the fine details that make it all work. Introspectively it made me realize that there's always something I can improve on and learn from others. Likewise, I hope to be able to pass on to people whatever I have learned throughout my journey. Apart from making companies grow from 0 to 1 and to infinity, I am into traveling, electronic music, and entrepreneurship. … see more",
  "contact_info": "Jay Ar’s Profile linkedin.com/in/jayarjuan Birthday October 5"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ashish-vaishnav-b9290ab?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAIXph4BTziSm95D3Yha-oG11w9n5X2hyrg",
  "name": "Ashish Vaishnav",
  "information": "Solutions Architect/Telecom BSS-OSS/Digital Commerce",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Amdocs",
  "connections": "270 connections",
  "about": "A solution architect with 18+ years of experience in solution architecture, business analysis, software design &development in Telecom BSS & OSS systems. I am having extensive experience in solution architecture and designs for multiple large-scale Digital, BSS & Cloud transformation programs for top tier Telco Operators across globe.In-depth knowledge of Digital Care & Commerce, CPQ, Order management, Enterprise product catalogue, Billing, Account receivable, Real time Rating & Charging and Service order management systems.Expertise of creating E2E BSS solution architecture & designs related to OMNI channel customer journeys, Prepaid, Postpaid Mobile, Fixed Services, Convergence bundles, OTT Content, IOT Services, 5G, Consumer & Enterprise offeringsOn top of transformation programs also leading solution architecture for various initiatives: cloud transition, platform upgrades, capability enhancements, introduction of the new system in existing IT ECO systemsUtilizing Rich knowledge of market trends, Open frameworks and standards, cutting-edge technologies, Amdocs portfolio capabilities and best practices to deliver innovative solutions.My key roles & responsibilities are as per below• Defining IT vision & roadmap for customers• Ensuring solution meets defined objectives and delivering practical solution considering budget, timeline & feasibility• Thriving rationalization & simplification opportunities by showcasing industry and market trends, available products & capabilities and best practices experience of other transformation programs.• Trusted advisor & partner of customer senior executives in conceptualizing new ideas/initiatives and translating it in feasible solution• Using rational reasonings and collaborative approach with internal & external stake holders to take or make difficult decisions, consensus building, disagree on unmerited requests or situations & keeping commitments• Managing & grooming solution team across geography and cultures• Close collaboration different teams, organization units, stake holders & executive management to ensure successful delivery. … see more",
  "contact_info": "Ashish’s Profile linkedin.com/in/ashish-vaishnav-b9290ab Twitter AshishVaishnav"
 },
 {
  "profile_link": "https://www.linkedin.com/in/siti-sapina-abdul-rahim-8a632711?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAJcij4BUMiepyW34ZYD3T26rJuVYsAy0PQ",
  "name": "Siti Sapina Abdul Rahim",
  "information": "Chief Business Development & Sales Strategy, Global Solution Elite Team, APAC at Huawei Technologies",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Huawei Middlesex University",
  "connections": "500+ connections",
  "about": "21 years of working experience in the fixed and mobile sectors of the telecom industry and IT sectors with working experience in the areas of consultative solution selling, strategic business and solutions development, sales leader, business strategy;product management, sales and marketing; account management and managed services. Working knowledge garnered - Subsea, 3G/LTE/TETRA; IPLC/LL, IPVN MPLS, Applications Enablement platforms, Customer Experience Management Solution; Enterprise Cloud, CRM, SAP, ERP, OSS/BSS, Converget Billing platforms, Messaging platform solution, Risk Management/Fault Management/Revenue Assurance, Managed Services, SOA, IT Outsourcing, Satellite, Wireless, Small Cells Solutions and Optics, Mobile Advertising, Open API platforms, IPTV OTT, MVNE/MVNO, BI and Analytics, Digital solutions include Cloud, Big Data and Data Centre solution; Document Management Systems, Smart Card solution for Electronic Payment Transportation/Time Management systems, Public Safety Apps, eCommerce and Mobile Content platforms - from solution sales and commercial perspective. Specialties - lead sales team; digital business transformation; business and enterprise digital solutions; strategic partnership; manage stakeholders; hunt and win complex business and sales target; people management; account management; formulating innovative and proactive business plan and sales strategies; good business acumen, customer engagement ; accelerate business relationship; financial analysis for good business model and healthy project ROI payback period. … see more",
  "contact_info": "Siti Sapina’s Profile linkedin.com/in/siti-sapina-abdul-rahim-8a632711"
 },
 {
  "profile_link": "https://www.linkedin.com/in/debadityaroy?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAASzSUUBjNgxzg5hs76TnuDabjZusJkLdco",
  "name": "Debaditya Roy",
  "information": "Insights Specialist | Forever Curious",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Ipsos in Singapore Northumbria University",
  "connections": "500+ connections",
  "about": "An Insights professional with over 6 years’ experience in Qualitative Research in India & SEA markets. Creating consumer stories through sociological & psychological techniques to help brands drive actionable insights & strategy.",
  "contact_info": "Debaditya’s Profile linkedin.com/in/debadityaroy Twitter debadityaroy"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ganziyang?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAVgH08Bkv1f6_v8OqpeTJeFAhrXMby73YE",
  "name": "Yang Gan",
  "information": "TM Forum | Telecom | APAC",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "TM Forum Lancaster University",
  "connections": "500+ connections",
  "about": "Hello, I’m able to help you grow revenues rapidly in Southeast Asia, Australia and New Zealand through advisory services in operating model, enterprise architecture and B2B GTM strategies. The learnings I’ve accumulated over my career has a consistent affiliation to enterprise business in the Telecommunication and Technology sector. I have extensive relationships in the telco industry, tech vendors, consulting firms, system integrators and highly skilled professionals in the region. … see more",
  "contact_info": "Yang’s Profile linkedin.com/in/ganziyang Birthday October 17"
 },
 {
  "profile_link": "https://www.linkedin.com/in/anthonymokmk?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABiBRScBwyk2pXztugI7qWH9zkO3zg8tUg4",
  "name": "Anthony Mok",
  "information": "Director | Broadcast Consultant | Technology Solution Provider | Empowering Media and Enterprises with video solutions to drive business values | Connect with me for Broadcast & Media advisory.",
  "location": "Petaling Jaya, Selangor, Malaysia Contact info",
  "company": "Mirack Technologies",
  "connections": "192 connections",
  "about": "I am a broadcast solution specialist with a mission to empower broadcast and media enterprises with an innovative and simplified video technology solution. For over 12 years, I worked as technical support, system integrator, solution consultant and business manager with a passion for helping businesses to simplify technical workflow and meeting business goals.Throughout my career, I have the opportunities to work with top leaders in the industry such as Media Prima, TM or promising clients like Awesome TV and others. Here are some of the challenges I have solved for my clients:- Transition from traditional to an IP based infrastructure - Integration of complex system workflow- Technical know-how to setup broadcast infrastructure- High operational cost and inefficient processI can be contacted if you need technical consulting and advisory related to broadcasting technology or media solution to help in your new project or value add to your existing workflow or technology platform. 𝐒𝐩𝐞𝐜𝐢𝐚𝐥𝐭𝐢𝐞𝐬: Broadcast System Integration, Broadcast Solution Provider, Managed Broadcast Services, Broadcast Management System, Broadcast Traffic And Scheduling, MCR Playout Automation, PCR Live Production, Newsroom Automation, Media Asset Management, Media Archiving, Media Delivery, IP Video Contribution And Distribution, IPTV, OTT, Cloud TV Playout, Business Continuity Plan, Disaster Recovery Services … see more",
  "contact_info": "Anthony’s Profile linkedin.com/in/anthonymokmk"
 },
 {
  "profile_link": "https://www.linkedin.com/in/georjinah-anne?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAyLj0sBf5kG5vblXYLchzj4CWvZLDlg9ek",
  "name": "Georjinah Anne",
  "information": "Sales & Marketing | Business Analytics | Product Marketing | Digital Strategy",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "AEON CO. (M) BHD. National University of Malaysia",
  "connections": "1,891 followers 500+ connections",
  "about": "Driven growth marketing & sales leader with 10 years of experience in Marketing & Sales, Customer Lifecycle Management, Digital Marketing and Business Analytics.A hands-on conscientious leader with a strong background in team development, and a solid reputation for assessing business needs, developing cost-saving solutions, increasing sales and driving customer satisfaction by starting with ground work and using a hands-on approach. … see more",
  "contact_info": "Georjinah’s Profile linkedin.com/in/georjinah-anne"
 },
 {
  "profile_link": "https://www.linkedin.com/in/sahanakamath?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAACZpJgBNcMMTCGcpbmsHsk7CUd-wsGgOQA",
  "name": "Sahana Kamath",
  "information": "Head, Original Production - Malaysia & Indonesia at Viu",
  "location": "Malaysia Contact info",
  "company": "International Academy of Television Arts & Sciences London School of Economics and Political Science",
  "connections": "500+ connections",
  "about": "Sahana Kamath is a producer and senior executive whose work in international production has taken her to 25 countries, overseeing the production of over 4,000 hours of content in 20 languages. Her breadth of experience spans writing, development, commissioning, exec producing and format distribution across digital, cable, FTA and feature film, including stints at Sony Pictures Television (International) and Discovery Networks (South Asia). In her current role at pan-regional OTT platform Viu, Sahana heads up Original Production for Malaysia and Indonesia, based in Kuala Lumpur and Jakarta. Her most recent productions include the critically acclaimed Asian remake of PRETTY LITTLE LIARS and the second season of landmark regional production THE BRIDGE (launched in association with HBO Asia across 24 markets). Amongst her past productions: trailblazing premium thriller MANDATORI (Southeast Asia) and TEFI and Guinness World Record Award-winning powerhouse sitcom THE VORONINS (Russia+CIS). Sahana holds 4 degrees across 3 continents, including masters from the London School of Economics and University of Southern California. … see more",
  "contact_info": "Sahana’s Profile linkedin.com/in/sahanakamath"
 },
 {
  "profile_link": "https://www.linkedin.com/in/iamgokula?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAALqFHQBQu6yJpR_i45_5_Hu8Ypm0s4bI0o",
  "name": "Gokula Krishnan Subramaniam",
  "information": "Fintech for the under-served in Asia",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Vircle The Wharton School",
  "connections": "500+ connections",
  "about": "A transformational leader with ~20 years Global work exposure across Telecoms, Media MNC's and Start-ups, with experience in business turnaround, sales, people mentor-ship, operations, commercial, technology solutions and Innovation. With a keen passion to solve big problems and most often through innovative approaches, i had the privilege of rapidly raising from an Engineer to regional VP and Practice Head within 7 years at the Ericsson group and at age 34, the youngest too. After 17 years of corporate life and leading teams across 16 countries i called it quits to focus on a personal mission, to bring financial services to the under-served in Asia through a startup i founded called Vircle.A firm believer in hands on leadership, my strength lies in coaching and mentoring teams with the approach that the best organizations shine when you succeed through collective work of the people you entrust and lead. Be CLEAR on what we won't do, be FOCUSED on what we should do and be OBSESSED in being the best in what we do. … see more",
  "contact_info": "Gokula Krishnan’s Profile linkedin.com/in/iamgokula Birthday October 23"
 },
 {
  "profile_link": "https://www.linkedin.com/in/adityabasole?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAQUKxYBHxKTcwz-CHdR_WQsxOuU6XltDeg",
  "name": "Aditya Basole",
  "information": "Building Global Brands in SEA",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Lazada MICA",
  "connections": "500+ connections",
  "about": "Integrating disparate pieces of media, marketing and consumer knowledge into actionable strategies. Using qualitative and data-led research to solve challenges for brands across traditional and digital ecosystems.Consumer Insights, Strategy and Communications experience on brands from various industries and geographies. I have worked on insights based - strategy, design, communication and positioning for major brands in SEA, India and across other international geographies. Observing people and cultures has always interested me - and thus the desire to be the consumers voice while solving problems. I believe in the power of brand and consumer insights and their impact on both brand success as well as consumer happiness.Specialties: Consumer Insights, Brand Strategy and Positioning, Research, Story, Marketing, Account Planning, ZMET, Sports. … see more",
  "contact_info": "Aditya’s Profile linkedin.com/in/adityabasole Twitter AdityaBasole"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ahmadjamalkhan?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAPfJ4gBKtrdS8Eozl2B1qtWNvbnIcrua1k",
  "name": "Ahmed Jamal Khan",
  "information": "Head of Enterprise Architecture Delivery at PETRONAS Digital Sdn Bhd",
  "location": "Greater Kuala Lumpur Contact info",
  "company": "PETRONAS Digital Sdn Bhd",
  "connections": "500+ connections",
  "about": "• Senior Stakeholder, Client Engagement • Business and IT/Digital Transformation • International (EMEA) Consulting experience • Strategic Planning and Operational Expertise• Target Operating Model / Centre of Excellence• Certified Enterprise Architecture• Cloud Architecture & Migration to cloud• B2B and B2C product Design & Development• Agile software Development lead• Business requirements & change process • Team Management (onshore & offshore)• Security, Privacy and GDPR compliance• AWS, Azure & GCP architecture• MVC, MVP and MVVM design pattern• Microservices, SOA and RESTful API architecture• CI /CD automation & Digital tooling strategy • Customer Insight / BI Analytics platform • Containerization and Kubernetes• IaaS, PaaS and SaaS application architecture• Lead Product owner and Scrum of Scrum … see more",
  "contact_info": "Ahmed Jamal’s Profile linkedin.com/in/ahmadjamalkhan"
 },
 {
  "profile_link": "https://www.linkedin.com/in/rozina-aziz-transformation-personalbranding-leadership-coach-mentor-trainer-consultant?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAADsLi4BthVjFereCbN-cRm7TU-Xb-w0ijM",
  "name": "Rozina Aziz",
  "information": "Global Leadership and Startup Coach l Tranformational Leadership and Personal Branding Advocate | Co-Host, Leaders Speakeasy with Rizal and Rozina",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Metamorfosa Harvard Business School",
  "connections": "500+ connections",
  "about": "Rozina is a dynamic, versatile and experienced C-suite business leader and builder with a passion for exciting challenges as well as new startups, transformation and greenfield initiatives. A transformational leadership, branding and personal branding advocate, she draws on her 30-year corporate experience to coach, mentor, train and advise clients on building their brand, people and organisation for success. Among others, she coaches international business leaders and startups on leading change, go-to-market strategies and building businesses.An accomplished Chief Marketing Officer and Customer Experience and Management expert, Rozina has a demonstrated history in the TV home shopping, e-commerce, TV and digital news, media, entertainment and financial industries. She is skilled in Branding and Marketing (Traditional and Digital), Customer Experience and Management, Retail and Institutional Sales, News and Content Management, Media Relations and Strategic Communications, TV Programming and Production, Logistics and Operations. An economics graduate from Cambridge University, United Kingdom and alumnus of Harvard Business School's Advanced Management Programme, Rozina is also a certified coach and trainer. … see more",
  "contact_info": "Rozina’s Profile linkedin.com/in/rozina-aziz-transformation-personalbranding-leadership-coach-mentor-trainer-consultant Twitter Rozina_Aziz"
 },
 {
  "profile_link": "https://www.linkedin.com/in/kaushikmohanraj?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAhXiG4BbzmSfBR5AJrl4NE86FsHNzvLhFo",
  "name": "Kaushik Mohanraj",
  "information": "Enabling Digital Transformation on ☁️ | Director - Blazeclan Technologies, Malaysia",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Blazeclan Technologies University of Pune",
  "connections": "8,116 followers 500+ connections",
  "about": "A Cloud Enthusiast, with a career spanning in roles of Cloud-Native Product Development, Solution Architecting, Cloud Pre-sales, and now with the responsibility of leading the Operations for the Malaysian and Indonesian Region of the Born in the Cloud Company Blazeclan Technologies.An avid cloud practitioner with experience in the evaluation of Well-Architected Solutions and an Ambassador for Cloud Technologies and Digital Transformation, with an understanding of agile practices required for the Enterprises.Over the span have worked with customers in India, Europe, UK, the US, and ASEAN countries.Appreciate Networking and building social networks to help mutually grow in the community.Specialties: Cloud Consulting, Cloud Operations, Conceptualization and Execution, Strategy Development & Business Management … see more",
  "contact_info": "Kaushik’s Profile linkedin.com/in/kaushikmohanraj Twitter kaushikmohanraj Birthday April 18"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ainanadzir?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABbn6_gBLBVbbauhbL-gOSbNIk3SI4Y9KEM",
  "name": "Aina Nadzir",
  "information": "Passionate about brand building & developing great customer experience",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Telekom Malaysia University of Westminster",
  "connections": "669 followers 500+ connections",
  "about": "Throughout my years in the marketing field, I have acquired a proven track record of leading the creation of significant revenue growth and the development and management of award-winning marketing campaigns.My background consists of spearheading campaigns designed to break new ground in markets by significantly increasing engagement and visibility through engaging content, strategies, and campaigns. I excel in assembling and leading high performing teams who possess the leadership and skills needed to drive success and consistent growth.My successes within the marketing and business development fields have allowed me to gain the firsthand experiences and tools needed to enact positive change on an organizational level. … see more",
  "contact_info": "Aina’s Profile linkedin.com/in/ainanadzir Birthday July 30"
 },
 {
  "profile_link": "https://www.linkedin.com/in/shelley-wong-172a872?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAACD0CYB1kNEj42C-erKCa506UOq7yoLgpY",
  "name": "Shelley Wong",
  "information": "Head of OTT Operations - sooka; Specialist in Corporate Finance & Business Planning",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Astro The University of Western Australia",
  "connections": "434 connections",
  "about": "I have been with a diversified media group - Astro Group – looking at various areas of business. I started my career there by looking at investments/ mergers and acquisitions (“M&A”) opportunities and strategic planning for the investment strategy. In the last 3+ years, I have transitioned to OTT operations – operating to drive the active user base of Astro GO. I have also been responsible for partnership discussions with telcos and digital partners (Grab and e-wallets) in enabling payment gateways on these channels.My experiences include:-(1) Project led and managed the multiple cross-border investment activities, which comprised business joint ventures, strategic acquisitions, and mergers and acquisitions in, amongst others, India, China, Vietnam, Hong Kong, United Kingdom and United Arab Emirates. The role involved complex contractual negotiations, built business and financial models to arrive at acceptable return on investment/ internal rate of return, and dealing with internal and external parties in due diligence, and finally recommendation to the senior management/ board of directors; (2) Business partnering role with involved strategic planning with CEOs/ COOs to drive business directions. (3) Project managed key initiatives in strategic planning activities at the investee levels and consolidating with the group strategic directions. My asset portfolio primarily focussed in media content and intellectual properties development in the region as well as globally.I am currently the business owner of Astro Malaysia’s OTT streaming service - \"sooka\" - in which I am responsible for overall operations and strategise initiatives to drive active users on these platforms with tactical and targeted digital marketing. I work closely with Product, Marketing and Content team to plan the tactical strategies. … see more",
  "contact_info": "Shelley’s Profile linkedin.com/in/shelley-wong-172a872 Twitter phaitlee"
 },
 {
  "profile_link": "https://www.linkedin.com/in/noormusaddik?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAABS2wMB7Cjkw8w3g5rP5dsGPIoD6VSImKk",
  "name": "Noor Musaddik Mokhtar",
  "information": "Head of Solutions GTM, Pricing and Partnership, Enterprise Business Unit at Celcom Axiata Berhad",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Celcom Axiata Berhad University of Virginia",
  "connections": "500+ connections",
  "about": "A self-motivated, dynamic and well-rounded professional with 25 years’ experience managing successful businesses in the IT and integrated communications industry, with a proven ability in managing high performing teams and complex projects and programs at the company level. Results oriented with a consistent record of exceeding standards and expectations.Bilingual: English and MalayStrengths:- Expert in Mobile Communications (2G, 3G, LTE) technologies & products.- Results oriented with a consistent record of exceeding standards and expectations.- Experience in managing high performing teams and complex projects and programs at the company level.- Experience in the inception of new teams and departments with admirable leadership qualities.- Excellent technical and communication skills with a unique combination of interpersonal and analytical abilities that enables efficient coordination and management of division, department, work, resources, programs and projects.- Aware of regional and global telecommunications business developments. … see more",
  "contact_info": "Noor Musaddik’s Profile linkedin.com/in/noormusaddik"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ashish-kale-a291bb?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAAHlwEBe49TJ24JcOw41CEf5ht3AhtP0vg",
  "name": "Ashish Kale",
  "information": "Managing Director at Integer Consulting Group Sdn Bhd",
  "location": "Selangor, Malaysia Contact info",
  "company": "Integer Consulting Group Sdn Bhd Indian Institute of Management, Lucknow",
  "connections": "500+ connections",
  "about": "A self-motivated, dynamic and well-rounded professional with 25 years’ experience managing successful businesses in the IT and integrated communications industry, with a proven ability in managing high performing teams and complex projects and programs at the company level. Results oriented with a consistent record of exceeding standards and expectations.Bilingual: English and MalayStrengths:- Expert in Mobile Communications (2G, 3G, LTE) technologies & products.- Results oriented with a consistent record of exceeding standards and expectations.- Experience in managing high performing teams and complex projects and programs at the company level.- Experience in the inception of new teams and departments with admirable leadership qualities.- Excellent technical and communication skills with a unique combination of interpersonal and analytical abilities that enables efficient coordination and management of division, department, work, resources, programs and projects.- Aware of regional and global telecommunications business developments. … see more",
  "contact_info": "Ashish’s Profile linkedin.com/in/ashish-kale-a291bb"
 },
 {
  "profile_link": "https://www.linkedin.com/in/isaac-yong-9790022a?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAYNMu0BhSIVD-WeAz5JzzuT5i5Q2qIGc3c",
  "name": "Isaac Yong",
  "information": "Head of Business Operations (Viu Malaysia)",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Viu University of Cambridge",
  "connections": "500+ connections",
  "about": "Experienced Strategy & Operations Manager with a demonstrated history of working in the OTT entertainment industry. Strong operations professional skilled in Strategy Development, Business Planning, Growth Hacking / Analytics, Digital Marketing, Tech Strategy",
  "contact_info": "Isaac’s Profile linkedin.com/in/isaac-yong-9790022a"
 },
 {
  "profile_link": "https://www.linkedin.com/in/ongpeikei?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAA1_5oYBUTztCHk3REeZKJpRREevDwt7a_k",
  "name": "Pei Kei Ong",
  "information": "Senior Solution Architect at DHL IT Services",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "DHL IT Services",
  "connections": "500+ connections",
  "about": "Mobile apps & Portal development lead, experience in Digital Solution Architect Design, Native iOS objective-C, swift, Android Java, React Native, ReactJs, Angular, ReactJS, AEM, php in lumen and pimcore framework. Microsoft .Net. oAuth2.0 authorization framework. Cloud based technology stack in AWS & headless architect design. Successfully drive various iOS & Android mobile apps, eCommerce & selfserve projects within agreed timeline. Comprehensive knowledge in digital platform development by successfully delivered revamp, optimization and security enhancement in entire mobile apps & portal platform. … see more",
  "contact_info": "Pei Kei’s Profile linkedin.com/in/ongpeikei"
 },
 {
  "profile_link": "https://www.linkedin.com/in/chany-lim-kua-496904b4?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABhWybIBE64sWZh1PFWs-z4bEgmCBXscBNQ",
  "name": "Chany Lim Kua",
  "information": "Territory Sales Manager",
  "location": "Selangor, Malaysia Contact info",
  "company": "Honeywell University of Hertfordshire",
  "connections": "296 connections",
  "about": "Experienced Sales professional with expertise in client relationship, management & retention, excellent communicator, independent, dynamic, team player, responsible & adaptive learner.",
  "contact_info": "Chany’s Profile linkedin.com/in/chany-lim-kua-496904b4"
 },
 {
  "profile_link": "https://www.linkedin.com/in/chriswylim?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAABumo-sBnkMfuYXmKFR4CSbm_PCk3325l5o",
  "name": "Chris Lim, Wei Yew",
  "information": "DevOps Architect Executive at PETRONAS",
  "location": "Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "PETRONAS Digital Sdn Bhd University of Southampton",
  "connections": "500+ connections",
  "about": "\"A little nonsense, now and then, is relished by the wisest men. -R.D. (1972)\" Imagine a world where we consciously consume ideas and voice out thoughts, where powerful communication is a norm, flooded with appreciation and love, without malicious judging or prejudice. Doesn't that sound like a nonsense worthwhile spreading? … see more",
  "contact_info": "Chris Lim,’s Profile linkedin.com/in/chriswylim"
 },
 {
  "profile_link": "https://www.linkedin.com/in/kadermydin?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAR_BjsBnsOgVokg4-MN6vXmIgiPsxTKY6E",
  "name": "Kader Mydin",
  "information": "CEO at Media Digital Distribution Sdn Bhd",
  "location": "Kuala Lumpur, Federal Territory of Kuala Lumpur, Malaysia Contact info",
  "company": "Media Digital Distribution Sdn Bhd Institute of Bankers, Malaysia",
  "connections": "500+ connections",
  "about": "Experienced Chief Executive Officer with a demonstrated history of working in the Telco and broadcast media industry. Skilled in Broadcast Engineering, Telco Services, Video Streaming, and convergence. Strong Social Media and mobile deployment skills. Strong international business development, C level management, professional graduated from Association of Chartered and Certified Accountants and Institute of Bankers Malaysia. … see more",
  "contact_info": "Kader’s Profile linkedin.com/in/kadermydin Website mdd.com.my (Company Website) Twitter KaderMydin Birthday March 3"
 }
]