[
 {
  "google_info": "neil travis mayes - Designer - California Landscape Design ...",
  "profile_link": "https://www.linkedin.com/in/neil-travis-mayes-31b70b41",
  "name": "neil travis mayes",
  "information": "I'm a Artist",
  "location": "Upland, California, United States Contact info",
  "company": "California Landscape Design and California Skatepark Design California State Polytechnic University-Pomona",
  "connections": "93 connections",
  "about": ""
 },
 {
  "google_info": "Allison McCarthy - Freelance Writer + Editor - Editorial and ...",
  "profile_link": "https://www.linkedin.com/in/allison-mccarthy-b584175",
  "name": "Allison McCarthy",
  "information": "Freelance Writer Editor",
  "location": "San Francisco, California, United States Contact info",
  "company": "Editorial and Content Creation New York University",
  "connections": "500+ connections",
  "about": "I am a San Francisco-based freelance writer and editor specializing in lifestyle content—style, design, travel, wellness, arts & culture, food & drink. I am the San Francisco editor for PureWow and regularly contribute to the San Francisco Chronicle, Sunset Magazine, Interiors California, Luxe Interiors Design, and California Home Design. I have also been published in Dwell, Ozy, Yoga Journal, Rodale’s Organic Life, Time Out SF, and Weddings CA. In addition to editorial work, I have written marketing content for companies such as Square, Visit California, and IfOnly and help businesses improve their online presence by developing SEO-friendly web copy, blog posts, and marketing collateral. View my portfolio: www.allison-mccarthy.comSkills: Microsoft Office, InCopy, Drupal CMS, Squarespace, and Google Analytics … see more"
 },
 {
  "google_info": "jon berle - Publications Coordinator and WriterWriter ...",
  "profile_link": "https://www.linkedin.com/in/jon-berle-571b6729",
  "name": "jon berle",
  "information": "--",
  "location": "Ellicott City, Maryland, United States Contact info",
  "company": "Maryland Transit Administration School of Holography, San Francisco. Made very first white light hologram there.",
  "connections": "33 connections",
  "about": "I am a San Francisco-based freelance writer and editor specializing in lifestyle content—style, design, travel, wellness, arts & culture, food & drink. I am the San Francisco editor for PureWow and regularly contribute to the San Francisco Chronicle, Sunset Magazine, Interiors California, Luxe Interiors Design, and California Home Design. I have also been published in Dwell, Ozy, Yoga Journal, Rodale’s Organic Life, Time Out SF, and Weddings CA. In addition to editorial work, I have written marketing content for companies such as Square, Visit California, and IfOnly and help businesses improve their online presence by developing SEO-friendly web copy, blog posts, and marketing collateral. View my portfolio: www.allison-mccarthy.comSkills: Microsoft Office, InCopy, Drupal CMS, Squarespace, and Google Analytics … see more"
 },
 {
  "google_info": "self employed painter / artist - Bruce Richards Studio | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/bruce-richards-6172a71a",
  "name": "Bruce Richards",
  "information": "Bruce Richards Studio",
  "location": "Dobbs Ferry, New York, United States Contact info",
  "company": "Bruce Richards Studio Cal Arts",
  "connections": "500+ connections",
  "about": "I am a painter interested art historical knowledge to allow the viewer to visualize and make their previous associations with objects into concepts for a visual dialogue. To reorient their past awareness with a new perspective to contemplate. In addition to painting my practice also includes, printmaking, watercolor, and sculpture in an effort to best display these ideas.. Perspective, color theory, composition and graduate seminars were some of the courses I taught over a 25 year period at various art colleges in Southern California: USC, Otis, Art Center College of Design and California Institute of the Arts. … see more"
 },
 {
  "google_info": "Alyssa Romano - Designer & Project Manager - Ocio Design ...",
  "profile_link": "https://www.linkedin.com/in/alyssa-romano-812a9624",
  "name": "Alyssa Romano",
  "information": "Interior Designer & Project Manager",
  "location": "San Diego, California, United States Contact info",
  "company": "Ocio Design Group",
  "connections": "500+ connections",
  "about": "Experienced Interior Designer with a demonstrated history of working in the architecture & planning industry. Skilled in AutoCAD, Sketching, Custom Furniture design, and Adobe Photoshop. Strong arts and design professional graduated from the Fashion Institute of Technology with a bachelors degree in Interior Design, and California State University San Marcos, with a certificate in Graphic Design. … see more"
 },
 {
  "google_info": "Josefina Muñoz - New York, New York, United States ...",
  "profile_link": "https://www.linkedin.com/in/josefinamunoz1",
  "name": "Josefina Muñoz",
  "information": "Fashion Designer",
  "location": "New York, New York, United States Contact info",
  "company": "Hood By Air Parsons School of Design - The New School",
  "connections": "216 connections",
  "about": "Experienced Interior Designer with a demonstrated history of working in the architecture & planning industry. Skilled in AutoCAD, Sketching, Custom Furniture design, and Adobe Photoshop. Strong arts and design professional graduated from the Fashion Institute of Technology with a bachelors degree in Interior Design, and California State University San Marcos, with a certificate in Graphic Design. … see more"
 },
 {
  "google_info": "Mike Jarvis - Owner - Emerald Coast Landscape | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/mike-jarvis-a475549b",
  "name": "Mike Jarvis",
  "information": "Owner at Emerald Coast Landscape",
  "location": "United States Contact info",
  "company": "Emerald Coast Landscape California State Polytechnic University-Pomona",
  "connections": "79 connections",
  "about": "We are a Landscape Maintenance and Construction Company for Commercial Properties and High End Residence. We have a Certified Arborist on staff and our Irrigation Technicians are certified for installation of back flow devices, water meters and all reclaimed water systems. We have been in business since 1983 and look forward to many more years of helping our customers. … see more"
 },
 {
  "google_info": "Will Coburn - Electrical Engineer - General Atomics | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/will-coburn-4686aa73",
  "name": "Will Coburn",
  "information": "Avionics Electrical Engineer at General Atomics",
  "location": "Huntsville, Alabama, United States Contact info",
  "company": "General Atomics California Polytechnic State University-San Luis Obispo",
  "connections": "128 connections",
  "about": "Experienced Electrical/Avionics Engineer with a diverse set of skills including mixed signal electronics design, firmware development, power distribution engineering, project engineering, and management."
 },
 {
  "google_info": "Pablo A. Medina - Founder - Design is Culture | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/pablo4medina",
  "name": "Pablo A. Medina",
  "information": "Art Director / Designer",
  "location": "New York, New York, United States Contact info",
  "company": "Design is Culture Type@Cooper",
  "connections": "500+ connections",
  "about": "Throughout my career, I've dedicated myself to three disciplines within design: design for commerce, design experimentation, and teaching. I taught for 14 years as an art and design professor, all the while mastering my design craft, working with clients such as the MoMA, The New York Times and ESPN. In 2016, I joined the country’s leading environmental organization, Natural Resources Defense Council as their Design Lead. These days, I'm either freelancing with some of the best agencies in New York City, including The Fader/Cornerstone, HUGE, Young & Rubicam and SY Partners, or working with clients at my studio Design is Culture in Sunset Park, Brooklyn. My typeface designs were exhibited at the prestigious Design Triennial exhibition at the Smithsonian’s Cooper Hewitt Museum and I am the recipient of the ADC Young Guns award. I have taught in both adjunct and full-time capacities at MICA, Parsons School of Design and California College of the Arts. … see more"
 },
 {
  "google_info": "Kate Wilson - Software Engineer II - Microsoft | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/kfwilson",
  "name": "Kate Wilson",
  "information": "Software Engineer II at Microsoft",
  "location": "Seattle, Washington, United States Contact info",
  "company": "Microsoft Stanford University",
  "connections": "188 connections",
  "about": "Throughout my career, I've dedicated myself to three disciplines within design: design for commerce, design experimentation, and teaching. I taught for 14 years as an art and design professor, all the while mastering my design craft, working with clients such as the MoMA, The New York Times and ESPN. In 2016, I joined the country’s leading environmental organization, Natural Resources Defense Council as their Design Lead. These days, I'm either freelancing with some of the best agencies in New York City, including The Fader/Cornerstone, HUGE, Young & Rubicam and SY Partners, or working with clients at my studio Design is Culture in Sunset Park, Brooklyn. My typeface designs were exhibited at the prestigious Design Triennial exhibition at the Smithsonian’s Cooper Hewitt Museum and I am the recipient of the ADC Young Guns award. I have taught in both adjunct and full-time capacities at MICA, Parsons School of Design and California College of the Arts. … see more"
 },
 {
  "google_info": "Pablo A. Medina - Founder - Design is Culture | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/pablo4medina",
  "name": "Pablo A. Medina",
  "information": "Art Director / Designer",
  "location": "New York, New York, United States Contact info",
  "company": "Design is Culture Type@Cooper",
  "connections": "500+ connections",
  "about": "Throughout my career, I've dedicated myself to three disciplines within design: design for commerce, design experimentation, and teaching. I taught for 14 years as an art and design professor, all the while mastering my design craft, working with clients such as the MoMA, The New York Times and ESPN. In 2016, I joined the country’s leading environmental organization, Natural Resources Defense Council as their Design Lead. These days, I'm either freelancing with some of the best agencies in New York City, including The Fader/Cornerstone, HUGE, Young & Rubicam and SY Partners, or working with clients at my studio Design is Culture in Sunset Park, Brooklyn. My typeface designs were exhibited at the prestigious Design Triennial exhibition at the Smithsonian’s Cooper Hewitt Museum and I am the recipient of the ADC Young Guns award. I have taught in both adjunct and full-time capacities at MICA, Parsons School of Design and California College of the Arts. … see more"
 },
 {
  "google_info": "Darshini S. - Product Designer III - Workday | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/sdarshini",
  "name": "Darshini S.",
  "information": "Product Designer at Workday",
  "location": "San Francisco Bay Area Contact info",
  "company": "Workday California College of the Arts",
  "connections": "484 connections",
  "about": "I am deeply passionate about designing spaces that really enhance human life. My design philosophy revolves around putting the human experience at the center of all my workI received my education in design and architecture from Parsons The New School of Design and California College of the Arts. After graduation, I worked for some years at Garcia Tamjidi Architecture Design, as a Brand Environment designer. Eventually transitioning from designing physical spaces to digital spaces, currently I am a Visual Designer at Workday, where I continues learning and honing my skills. … see more"
 },
 {
  "google_info": "Ben Inskeep - Principal Analyst - EQ Research LLC | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/ben-inskeep-a6b02034",
  "name": "Ben Inskeep",
  "information": "Principal Analyst at EQ Research",
  "location": "Indianapolis, Indiana, United States Contact info",
  "company": "EQ Research LLC Indiana University Bloomington",
  "connections": "500+ connections",
  "about": "As a Principal Analyst at the consulting firm EQ Research, I help clients understand and engage in U.S. state policy impacting clean and distributed energy. I work with community choice energy programs and clean energy businesses, advocates, trade associations, and consumers who are catalyzing a rapid clean energy transition. My areas of expertise include U.S. state clean energy policy and markets; renewable and distributed energy resources; electric utility rate cases, resource plans, and rate design; and California community choice aggregation (CCA) programs, regulations, and compliance obligations. … see more"
 },
 {
  "google_info": "Brian Heidsiek - Principal - Sandbox Innovation Studio ...",
  "profile_link": "https://www.linkedin.com/in/brian-heidsiek-36666b3",
  "name": "Brian Heidsiek",
  "information": "Principal, Sandbox Innovation Studio",
  "location": "Seattle, Washington, United States Contact info",
  "company": "Sandbox Innovation Studio California State University, Northridge",
  "connections": "500+ connections",
  "about": "Brian is a designer and innovator with national and international recognition. He’s an expert with user centric design methodologies and design thinking techniques. Brian’s focus is healthcare delivery innovation in the form of products and services.He’s delivered innovation for COPD, molecular diagnostics, wireless patient monitoring/medication carts and automated exterior defibrillators. He’s also been credited with helping Johnson Controls permanently alter the automotive landscape through their Homelink product and helped conceptualize one of HP’s best selling peripherals.Fourteen years ago, Brian founded Sandbox Innovation Studio, a collaborative of research, design and technology “A” players. They collaborate with small to fortune 50 companies and deliver organic growth through design led innovation.Brian has taught design at Art Center College of Design and California State University, Northridge and guest lectures for the University of Washington’s Industrial Design program. He is a member of the Design Management Institute, Industrial Designers Society of America, Product Development Management Association and the Golden Key National Honors Society. Brian also volunteers as an active member of the Seattle Police Department’s Victim Support Team. … see more"
 },
 {
  "google_info": "Taylor Shubert - Creative Director - Slate & Palm LLC | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/taylor-shubert-411217123",
  "name": "Taylor Shubert",
  "information": "Creative Director at Slate and Palm",
  "location": "Huntington Beach, California, United States Contact info",
  "company": "Slate & Palm LLC California State University, Long Beach",
  "connections": "24 connections",
  "about": "I am a Designer based in Orange County, California. I have studied Design at Long Beach City College, Artcenter College of Design, and California State University, Long Beach. I have 6 years of design education as well as 3 years of Anthropology education. I have experience in graphic design, furniture design and construction, 3D modeling, and environmental design. I am highly motivated and incredibly adaptable, new environments and new programs are a welcome challenge for me.SEGD Member since 2018Themed Entertainment Association Chapter President 2019-2020 … see more"
 },
 {
  "google_info": "Amber Urena - Landscape Designer - SQLA Inc. | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/amber-urena-a9aa5197",
  "name": "Amber Urena",
  "information": "Construction Coordinator/Landscape Designer",
  "location": "Brea, California, United States Contact info",
  "company": "SQLA Inc. Norco College",
  "connections": "144 connections",
  "about": "I currently hold a B.S. in Landscape Architecture with a minor in Regenerative Studies from Cal Poly Pomona , an emphasis in sustainable design and California Native planting practices."
 },
 {
  "google_info": "Joanne Kim - Adjunct Lecturer - California State University ...",
  "profile_link": "https://www.linkedin.com/in/joannekimphoto",
  "name": "Joanne Kim",
  "information": "Photographer, Educator, Consultant",
  "location": "Los Angeles, California, United States Contact info",
  "company": "California State University Long Beach, School of Art",
  "connections": "203 connections",
  "about": "Joanne Kim is a photographer, consultant, artist, and educator. She currently teaches at Otis College of Art and Design and California State University Long Beach. Her practice includes journalism, documentary, and commercial photography, as well as with the photographic medium as an art practice. Her photojournalistic work has been published at Capital & Main, Newsweek, and The Nation. She has taught photography for over a decade and has facilitated participant-produced photography projects with youth and young adults in Palestine, Mozambique, and marginalized communities throughout California. For several years, she was a consultant and trainer to a photography education program for teens in Hong Kong, helping build local capacity to offer meaningful engagement in contemporary lens-based media practices with the intention of encouraging and supporting a deeper understanding of self and community through artistic expression. Her most recent consultancy and arts education project was with the Pablove Foundation where she developed curriculum and piloted an Advanced Photography course for teens and young adults to share their stories about their cancer experience through photography. She currently teaches photography courses, works as a freelance photographer and videographer, and consults with groups in need of community storytelling and photography education projects. … see more"
 },
 {
  "google_info": "Chelsea Till - Sales Leadership Development Program ...",
  "profile_link": "https://www.linkedin.com/in/chelsea-till",
  "name": "Chelsea Till",
  "information": "Commercial Market Development in the South East Region",
  "location": "Charlotte, North Carolina, United States Contact info",
  "company": "Lutron Electronics Arizona State University",
  "connections": "500+ connections",
  "about": "After graduating in 2011 from Arizona State University with degrees in civil engineering and sustainability, I have been with Lutron Electronics as a commercial sales engineer. The first six years of my career were spent in California. In 2019 I moved to Charlotte, NC in a new role with Lutron. I specialize in commercial retrofit projects, utilizing radio frequency lighting controls with building management software. I support electrical contractors and energy services contractors (ESCOs) by helping with specification, rebates and training. I also manage our higher education relationships and projects in the Southeast US. I support all types of end users providing training, service agreements, and software upgrades, and helping with new construction/renovation projects.- Certified Sales Professional, Manufacturers Representatives Educational Research Foundation- Certified Lighting Efficiency Professional, American Association of Energy Engineers … see more"
 },
 {
  "google_info": "Sunshine Angulo - Student Supervisor - Ruffalo Noel Levitz ...",
  "profile_link": "https://www.linkedin.com/in/sunshine-angulo-0317271b4",
  "name": "Sunshine Angulo",
  "information": "Intern at Marian Drane Graham Scholars Program",
  "location": "Greater Wilmington Area Contact info",
  "company": "Ruffalo Noel Levitz University of North Carolina Wilmington",
  "connections": "241 connections",
  "about": "After graduating in 2011 from Arizona State University with degrees in civil engineering and sustainability, I have been with Lutron Electronics as a commercial sales engineer. The first six years of my career were spent in California. In 2019 I moved to Charlotte, NC in a new role with Lutron. I specialize in commercial retrofit projects, utilizing radio frequency lighting controls with building management software. I support electrical contractors and energy services contractors (ESCOs) by helping with specification, rebates and training. I also manage our higher education relationships and projects in the Southeast US. I support all types of end users providing training, service agreements, and software upgrades, and helping with new construction/renovation projects.- Certified Sales Professional, Manufacturers Representatives Educational Research Foundation- Certified Lighting Efficiency Professional, American Association of Energy Engineers … see more"
 },
 {
  "google_info": "Author, editor, book coach - Tiffany Hawk | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/tiffanyhawk",
  "name": "Tiffany Hawk",
  "information": "Author, Editor, Book Coach",
  "location": "Tucson, Arizona, United States Contact info",
  "company": "Tiffany Hawk University of California, Riverside",
  "connections": "312 connections",
  "about": "I’m an author, editor, and book coach for writers and thought leaders who have something to say and want to say it from the front tables of Barnes & Noble. (Trust me it’s a hell of feeling!) It’s not just an ego thing. It’s that you know in your bones that this book can move readers and maybe even show them a new way of looking at the world.I want to help you develop the skills and courage to write the best, boldest, most impactful book you can. Of course you know it’s not going to be easy. We’ve both worked too long and hard for our accomplishments to believe in the overnight success or the quick fix. And I can promise you that no amount of marketing or social media can get you there without a killer book.This is going to take skill, passion, and marathon-level persistence. But we can do hard things.To write a book that makes a lasting impact on readers, you’re going to need to: ● Commit to giving your readers the highest quality ● Create a distraction-proof plan so you can follow through on that promise, even when life gets in the way ● Dial in the tightly-focused premise that makes your book special● Learn how the publishing industry works so you can make savvy decisions I can help. My coaching and editing clients have finished books, landed agents, traditionally published, self published, won awards, and seen their stories in places like Harper’s, the Los Angeles Times, Narratively, McSweeney’s, and The Atlantic.For more than 15 years I’ve worked in publishing—as an author (St. Martin’s Press), editor at Coast (a Maggie award-winning lifestyle magazine), and currently as Editorial Director of Undomesticated magazine. I’ve also taught writing and the business of publishing at Rutgers University and Arizona State University and my writing has been featured in The New York Times, The Los Angeles Times, CNN, StoryQuarterly, The Week, National Geographic Traveler, and on NPR’s “All Things Considered.”Website: tiffanyhawk.com … see more"
 },
 {
  "google_info": "Olivia Trinidad - Principal - OT graphic design | LinkedIn",
  "profile_link": "https://www.linkedin.com/in/oliviatrinidad",
  "name": "Olivia Trinidad",
  "information": "Graphic and Website Designer",
  "location": "Monterey, California, United States Contact info",
  "company": "OT graphic design Santa Catalina College",
  "connections": "373 connections",
  "about": "Olivia Trinidad has more than a decade of graphic design experience, specializing in the creation of logos and corporate identity packages, printed collateral, websites, book design, catalogs and all types of print merchandise.Olivia Trinidad (OT) has the expertise to coordinate all aspects of your project—from conceptualizing, to web development, to final artwork and printing. OT worked as a Senior Graphic Designer at Graphic Atelier for 8 years and at Evan Moor Publishing Group for an additional 6 years. In 2007, OT joined Ross Media Group to serve as their Art Director. This position entailed creating the design style and overseeing the production of California Coast Parent Magazine and conceptualizing and creating graphic advertising pieces in all media for Plus Graphic Design.Specialties: Services include: Graphic Design, Web Design, Interactive Presentation (Power Point and Keynote), PrintingWe create : logo/corporate identity/business collaterals, magazine/book design and layout, product catalogs, brochures, flyers, posters, outdoor ads (tarpaulin banners, streamers, billboards), consumer ads (posters, print ads, window cards), print ads (newspaper and magazine ads), We also design and maintain professional websites. … see more"
 },
 {
  "google_info": "Amber Clarkson - Interior Designer - VISCUSI ELSON, LLC ...",
  "profile_link": "https://www.linkedin.com/in/amber-clarkson-78208a148",
  "name": "Amber Clarkson",
  "information": "Interior Designer at VISCUSI ELSON, LLC",
  "location": "Campbell, California, United States Contact info",
  "company": "VISCUSI ELSON, LLC The Art Institute of California-San Francisco",
  "connections": "49 connections",
  "about": "Experienced Interior Designer with a demonstrated history of working in the architecture & planning industry. Skilled in AutoCAD, SoftPlan, Microsoft Excel, Construction Drawings, SketchUp, and Adobe Indesign CC. Strong arts and design professional with a Bachelor's degree focused in Interior Design from The Art Institute of California-San Francisco. … see more"
 },
 {
  "google_info": "Nick Glase ASLA AIA - Principal & Cofounder - Unknown ...",
  "profile_link": "https://www.linkedin.com/in/nick-glase-asla-aia-b05a729",
  "name": "Nick Glase ASLA AIA",
  "information": "Principal & Cofounder at Unknown Studio, LLC",
  "location": "Baltimore, Maryland, United States Contact info",
  "company": "Unknown Studio, Landscape Architecture & Urban Design, LLC Cornell University",
  "connections": "500+ connections",
  "about": "Nick Glase, Partner and co-founder of Unknown Studio, has a passion for both systems thinking and fine-grain detail, thriving at multiple scales of design. Throughout Nick’s practice, he has specialized in public realm, institutional, and ecological projects. He is a Registered Landscape Architect and a Licensed Architect, bringing extensive knowledge and experience to his engagement with clients and stakeholders, from concept design through construction and maintenance.Nick’s prior experience includes leadership roles at the landscape architecture offices of SCAPE, West 8, and Reed Hilderbrand. Major landscape projects under his leadership include Town Branch Commons in Lexington, KY; the United States Golf Association Headquarters in Liberty Corners, NJ; Tomorrowland at Disney Shanghai; Yale University’s Science Hill Campus; Miami Beach Square and District Plan; and the Pete V. Domenici Courthouse in Albuquerque, NM. Early in his career as a practicing architect, he was a co-founding architect at ProjectFrog, now an industry leader in high-performance prefab buildings. Nick earned a Master of Landscape Architecture from the University of California at Berkeley, and holds a Bachelor of Architecture from Cornell University, where he graduated with the college’s top awards for design and research. Nick has served as a Visiting Critic and guest juror at Cornell University, Harvard University Graduate School of Design, Ohio State’s Knowlton School of Architecture, Columbia University, Rhode Island School of Design, and California College of the Arts. He is active in the ASLA and AIA, and currently holds licenses in Landscape Architecture in Maryland, Delaware, and New York, and is licensed to practice Architecture in Maryland and California. … see more"
 },
 {
  "google_info": "Art Cunningham - Construction Project Manager - T-Mobile ...",
  "profile_link": "https://www.linkedin.com/in/art-cunningham-899a576",
  "name": "Art Cunningham",
  "information": "Sprint Project Manager - Regional Site Development",
  "location": "San Ramon, California, United States Contact info",
  "company": "T-Mobile Georgia Institute of Technology",
  "connections": "343 connections",
  "about": "Significant project management experience in the digital communication services area and energy storage systems. Recognized for my skills in team leadership and technical disciplines for site acquisition and development. Thorough understanding of industry communication standards and technology specifications. Demonstrated project management responsibilities in cellular transmission site deployment, lease contracts, land use entitlements, and construction management. A self-starter with excellent team organization, planning and communication skills. Proven ability to work in a fast paced environment and handle multiple priorities successfully.Specialties: Site development, wireless sites, cellular sites, energy & battery storage systems, vehicle electric charging systems, engineering, design, construction management, leasing, zoning, regulatory, entitlements, finance, invoicing, contracts, scheduling, forecasting, material, logistics, 911, modifications, COW, temporary sites, permanent sites, co-locations, relocations, telco, outside plant, power, electrical service, CDMA, iDEN, Wimax, DAS, distributed fiber, microwave, high voltage protection, generators, stealth, concealment, tenant improvements, land survey … see more"
 },
 {
  "google_info": "Eric Sherman - Educator - Art Center College of Design ...",
  "profile_link": "https://www.linkedin.com/in/eric-sherman-6581236",
  "name": "Eric Sherman",
  "information": "Author, Filmmaker, Private Filmmaking Consultant, Entertainment Industry Legal Consultant at Eric Sherman",
  "location": "Glendale, California, United States Contact info",
  "company": "Art Center College of Design Yale University",
  "connections": "500+ connections",
  "about": "Significant project management experience in the digital communication services area and energy storage systems. Recognized for my skills in team leadership and technical disciplines for site acquisition and development. Thorough understanding of industry communication standards and technology specifications. Demonstrated project management responsibilities in cellular transmission site deployment, lease contracts, land use entitlements, and construction management. A self-starter with excellent team organization, planning and communication skills. Proven ability to work in a fast paced environment and handle multiple priorities successfully.Specialties: Site development, wireless sites, cellular sites, energy & battery storage systems, vehicle electric charging systems, engineering, design, construction management, leasing, zoning, regulatory, entitlements, finance, invoicing, contracts, scheduling, forecasting, material, logistics, 911, modifications, COW, temporary sites, permanent sites, co-locations, relocations, telco, outside plant, power, electrical service, CDMA, iDEN, Wimax, DAS, distributed fiber, microwave, high voltage protection, generators, stealth, concealment, tenant improvements, land survey … see more"
 },
 {
  "google_info": "Sandra Ask - Founder - Building Dreams | LinkedIn",
  "profile_link": "https://se.linkedin.com/in/sandra-ask",
  "name": "Sandra (Sharma) Ask",
  "information": "Founder at Building Dreams",
  "location": "Stockholm Metropolitan Area Contact info",
  "company": "Building Dreams Rhode Island School of Design",
  "connections": "500+ connections",
  "about": "Future-focused Interior Architect changing how people live and interact through collaboration and innovative design thinking."
 },
 {
  "google_info": "Alan Do - San Francisco, California, United States ... - LinkedIn",
  "profile_link": "https://www.linkedin.com/in/alan-do-022a03133",
  "name": "Alan Do",
  "information": "Wedding / Corporate account Floral Designer ­- Event stylist at Floramor Studio Florist",
  "location": "San Francisco, California, United States Contact info",
  "company": "Blue Print Studio - Nancy Lichin - Inwater Academy of Art University",
  "connections": "",
  "about": "Creating unique and harmony-inspired spaces for my clients' home or workplace is my main source of happiness. Having spent 10 years in the US and 20 years in Asia, I feel appreciative of possessing a diverse interior design background and designing spaces using multiple point of views. My specialties include: interior design, project management, floral design, photography, furnishing, space planning, and floor plan editing. … see more"
 },
 {
  "google_info": "Andy Springer - Project Executive, Construction Management ...",
  "profile_link": "https://www.linkedin.com/in/andy-springer",
  "name": "Andy Springer",
  "information": "Project Executive, Construction Management, Infrastructure and Transportation at Google",
  "location": "Sunnyvale, California, United States Contact info",
  "company": "Google Penn State University",
  "connections": "500+ connections",
  "about": "I am working as a Development Executive on Google's Infrastructure and Transportation team.I have more than 20 years of experience managing complex horizontal and vertical projects in the commercial, institutional and industrial sectors. I have worked in various roles in the industry with an emphasis on ground-up campus, branded interiors, data center, biotech, laboratory, sustainable, renewable and energy service projects.Specialties: Real estate development, entitlements, project management, design and construction management … see more"
 },
 {
  "google_info": "Paul Fortino - Licensed Real Estate Agent - David Lyng Real ...",
  "profile_link": "https://www.linkedin.com/in/paulfortinorealtor",
  "name": "Paul Fortino",
  "information": "Licensed Real Estate Professional",
  "location": "Santa Cruz, California, United States Contact info",
  "company": "David Lyng Real Estate",
  "connections": "220 connections",
  "about": "Broad background in the field of real estate, including: residential seller representation, buyer representation, representing seniors, strong contract negotiations, property management/maintenance, green/sustainable improvements. Strong interpersonal and client relationship skills with a high degree of professionalism and ethics.Buildings & Facilities Management including: project management, utility upgrades, moves, access & security, and personnel management. Planning, analytical and planning skills with strong organization and attention to detail.Municipal Parks Management/Maintenance including: project design and management, parks and building maintenance/renovation, and personnel management. … see more"
 },
 {
  "google_info": "Karen Julian-Arax, MS, LMFT - Licensed Marriage And Family ...",
  "profile_link": "https://www.linkedin.com/in/karen-julian-arax-ms-lmft-2b91979b",
  "name": "Karen Julian-Arax, MS, LMFT",
  "information": "Licensed Marriage And Family Therapist, Adult Psychiatry",
  "location": "Fresno, California, United States Contact info",
  "company": "Kaiser Permanente California State University, Fresno",
  "connections": "231 connections",
  "about": "In her practice at Kaiser Permanente, Karen provides individual, couples and family therapy to adults struggling with a variety of emotional and mental health issues--with a special emphasis on anxiety, trauma, and substance use disorders. When working with others, Karen prefers to take a solution-focused, strength-based approach, emphasizing a mindful approach to recovery from mental illness, addiction, or both. Through specialized clinical training, Karen is qualified to provide EMDR therapy for trauma-related disorders and is certified by EMDRIA, the international association for EMDR professionals.Karen is graduated from UCLA with a B.F.A. in Design, and California State University, Fresno with a M.S. in Counseling, with a Marriage and Family Therapy emphasis. Karen is a Licensed Marriage and Family Therapist and a member of both CAMFT and EMDRIA. In addition, she has been a long-time advocate in the disability community, through her involvement with various charitable special needs organizations and community agencies. … see more"
 },
 {
  "google_info": "Yimin Deng (Deng-Wen) - Energy Transition Intern ... - 领英",
  "profile_link": "https://cn.linkedin.com/in/dengyimin",
  "name": "Yimin Deng (Deng-Wen)",
  "information": "Master of International Development at Sciences Po // Energy Transition Intern at WWF China // Ambassador at Remake",
  "location": "Shenzhen, Guangdong, China Contact info",
  "company": "WWF-China Sciences Po",
  "connections": "500+ connections",
  "about": "In her practice at Kaiser Permanente, Karen provides individual, couples and family therapy to adults struggling with a variety of emotional and mental health issues--with a special emphasis on anxiety, trauma, and substance use disorders. When working with others, Karen prefers to take a solution-focused, strength-based approach, emphasizing a mindful approach to recovery from mental illness, addiction, or both. Through specialized clinical training, Karen is qualified to provide EMDR therapy for trauma-related disorders and is certified by EMDRIA, the international association for EMDR professionals.Karen is graduated from UCLA with a B.F.A. in Design, and California State University, Fresno with a M.S. in Counseling, with a Marriage and Family Therapy emphasis. Karen is a Licensed Marriage and Family Therapist and a member of both CAMFT and EMDRIA. In addition, she has been a long-time advocate in the disability community, through her involvement with various charitable special needs organizations and community agencies. … see more"
 },
 {
  "google_info": "Vanessa Vanek - DP & MYP Visual Art and Digital & Product ...",
  "profile_link": "https://www.linkedin.com/in/vanessa-vankova",
  "name": "Vanessa Vanek",
  "information": "DP & MYP Visual Art and MYP Digital & Product Design Teacher at The Western International School of Shanghai",
  "location": "Lawrence, Kansas, United States Contact info",
  "company": "WISS - The Western International School of Shanghai University of Kansas",
  "connections": "128 connections",
  "about": "An accomplished and resourceful Visual Art & Design Teacher with 20+ years of experience and success developing, managing, implementing, and supporting dynamic art and design curricula. Highly trained in a variety of artistic and design mediums including digital design, jewelry design, 3D art, portfolio development, studio art, and textile design—I also possess expertise in Adobe Creative Suite, CAD programs, and 3D printing. As an innovative and imaginative educator, I am committed to motivating, engaging, supported, and empowering my students via differentiated instruction. With excellent communication and interpersonal skills, I easily build relationships and rapport with diverse groups of international students and colleagues. Thriving in collaborative environments, I am recognized for my sound judgment, learning optimization, and solid work ethic. … see more"
 }
]